{
    "job": {
        "title": "Software Engineer",
        "industry": [],
        "description": "<p><strong>Software Engineer</strong></p><p><br></p><p>Are you a full-stack developer with React, Rails, Node, or Python experience? The Gnar Company is seeking multiple developers to join our growing, 20 person remote team. Your typical day will include shipping code on your active client project, and interacting with client partners to promote standard methodologies and process improvements. Applicants must be US based.</p><p><br></p><p><strong>ABOUT US</strong></p><p>We help companies solve their Gnarly problems. From small, one-person startups to enterprises, we help businesses level up their teams, hone in on their process, and ship the right features at the right time. You will be joining an experienced team, and will be instrumental in crafting our company culture and team values. Our new office is located in Downtown Crossing, Boston and offers great views of the city and lots of natural light. We are growing quickly and this role presents an excellent opportunity to grow with us. We value a strong work/life balance, when you are off work it’s your time.</p><p><br></p><p><strong>ABOUT YOU</strong></p><ul><li>You are a software engineer with multiple years of professional experience</li><li>You are comfortable working in a wide range of industries, platforms, and project sizes</li><li>You care about your craft and actively seek to improve your skills and share your takeaways with others</li><li>You love the technology you already know and are always eager to learn more</li></ul><p><br></p><p><strong>RESPONSIBILITIES</strong></p><p>From day one you’ll be working with our clients to build high quality, foundational web applications. You will build scalable software that helps businesses in various industries including healthcare, FinTech, and cyber-security. You’ll have full autonomy to influence the scope of the engagement, the technology decisions and the delivery of the product. We use a range of technologies including:</p><ul><li>Ruby/Rails</li><li>Typescript</li><li>React/React Native</li><li>Python</li><li>We’ve also dabbled in other technologies such as Elixir, Go, and Node</li></ul><p><br></p><p>We pride ourselves on good development process, team collaboration, and clean, well tested code.</p><p><br></p><p><strong>BENEFITS</strong></p><ul><li>A competitive salary</li><li>A gnar-ly remote team</li><li>A generous employee profit sharing program</li><li>A mandatory vacation policy</li><li>Paid team lunches</li><li>100% healthcare &amp; dental coverage</li><li>A generous, paid maternity/paternity leave policy</li><li>Fully company paid phone plan for both business and personal use</li><li>New coding setup of your choosing</li><li>A fun work anniversary prize every year</li></ul><p><br></p><p>Salary: $100K - $130K</p><p><br></p><p>*** Sorry no sponsored visas</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-02"
    },
    "company": {
        "name": "The Gnar Company, Inc.",
        "link": "https://www.linkedin.com/company/the-gnar-company-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}