{
    "job": {
        "title": "Lead Software Engineer -REMOTE",
        "industry": [
            "Computer Software"
        ],
        "description": "We are an online waiver solution for businesses large and small. Customized, legally binding waivers created with Smartwaiver can be signed online, or at your location on a computer, tablet, or smartphone. Signed smart waivers are stored in our secure, searchable database, eliminating the need for paper waivers and filing cabinets.<br><br>We're a small, nimble team in Bend, OR obsessed with customer service since 2012. Millions of smart waivers are signed each year by organizations like the NFL, VANS, and the U.S. Army.<br><br>We are looking for a purposeful, results-oriented, and capable Engineering Lead to guide and mentor scrum teams with Developers and QA resources who support legacy system maintenance and new application development. The ideal candidate will possess a good balance of technology and people management skills, leads with empathy, and has a keen desire to deeply understand our products and services to push our technology forward for functionality, performance, reliability, and scalability and fully own the delivery of the product.<br><br>What You Will Be Doing<br><ul><li> Formally mentor, guide, and develop a high-performing Scrum team.</li><li> Layout technical vision for the team and lead the design for the product while ensuring high-quality development.</li><li> Leverage modern cloud-first technologies to create efficient and performant processes.</li><li> Push the bar to solve complex technical challenges of scale and performance.</li><li> Own your teams' deliverables and ship high-quality, maintainable software.</li><li> Partner effectively and influence peers and senior leadership both within the organization.<br></li></ul>What You Need for this Position<br><br>BSCS and 5+ years of development experience and knowledge of:<br><ul><li> Front end technology preferably react.js and vue.js</li><li> .NET and PHP and other backend technologies</li><li> Database technologies both RDBMS and NoSQL. Preference for MySQL and DynamoDB,</li><li> Experience leading and managing a small to a medium-sized team of developers for a minimum of 2 years, or someone who has a history of engineering expertise and is ready to assume that next position</li><li> Demonstrates core competencies of communication and collaboration, decision-making, problem-solving, teamwork, and initiative</li><li> Experience in building and delivering enterprise software with high availability, quality, scalability, and resilience</li><li> An advanced understanding of processes and practices which contribute to the reliability, maintainability, security, simplicity, performance, and testability of software</li><li> Demonstrated success in defining and implementing process improvements,</li><li> Participate in vendor relationship, contract management, and implementation planning,</li><li> Experienced knowledge of maintaining and debugging live software systems proactively engage in the remediation of software issues related to code or solutions quality, security, and/or pattern/frameworks and software usability or end user-related issues</li><li> Deep understanding of issues involved in delivering, deploying, and supporting an integrated suite of products</li><li> Ability to grasp new areas and adapt to change</li><li> Proficient and minimum 1+ years of experience in AWS Cloud Eco System<br></li></ul>= Knowledge and experience working in the payments industry preferred.<br><br>What's In It for You<br><br>Competitive base salary ($120,000-$140,000/year) and overall compensation package<br><ul><li> Full benefits: Medical, Dental, Vision</li><li> 401 (K) with generous company match</li><li> Vacation, sick, and paid holidays</li><li> Life Insurance coverage<br></li></ul>So, if this sounds like yourself, we'd love to hear from you!<br><br><strong><u>Either<br></u></strong><ul><li> Apply directly to this job opening here!<br></li></ul>Or<br><ul><li> E-mail directly for more information to patrick.solano@cybercoders.com<br></li></ul><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Patrick.Solano@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : PS2-1633029 -- in the email subject line for your application to be considered.***<br></li></ul>Patrick Solano - Lead Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Deschutes County",
        "region": "OR",
        "postal_code": "97707",
        "street_address": null,
        "latitude": 44.058086,
        "longitude": -121.31515
    }
}