{
    "job": {
        "title": "AI/ML - Backend Software Engineer, Speech & Language Technologies",
        "industry": [
            "Consumer Electronics"
        ],
        "description": "<br><strong>Summary<br></strong> <br>The AI/ML - Machine Translation team is looking for exceptional Software Engineers passionate about delighting customer’s experience and pushing the envelope on Machine Learning, Artificial Intelligence, Embedded and Distributed Computing.<br><br> <br><strong>Key Qualifications<br></strong> <br>In-depth development experience with C/C++<br><br>Experience in object-oriented software design and programming<br><br>Experience in implementing services scalable to millions of users<br><br>Familiarity with networking, distributed systems and multi-threaded programming<br><br>Knowledge of machine learning techniques is a plus<br><br>Passionate about creating phenomenal products<br><br> <br><strong>Description<br></strong> <br>You will be a part of a team that is responsible for a wide variety of language technologies related research and development activities. You will primarily be responsible for developing services that deliver our applications and technologies to millions of people.<br><br><br>To succeed in this role, you are a strong programmer and a creative problem solver, who enjoys learning new things.<br><br><br>You will possess strong skills in object-oriented software design and programming. You are passionate about developing new features, maintaining existing code, fixing bugs, and contributing to overall system design. You are a great teammate who thrives in a dynamic environment with rapidly changing priorities.<br><br> <br><strong>Education &amp; Experience<br></strong> <br>B.S. or M.S. in Computer Science or related field with 4+ years of industrial working experience<br><br> <br>Role Number: 200200063<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}