{
    "job": {
        "title": "Social Media Manager",
        "industry": [],
        "description": "<p>Emspace + Lovgren is growing its team! We're looking for a&nbsp;Social Media Manager who is passionate about making a difference in the Omaha metro and broader region.</p><p><br></p><p>Many of our clients are nonprofit organizations. We’ve found a happy niche in this sector – adding creative firepower to the missions of nonprofits and helping them make an even bigger impact in our community. The person in this position will drive our clients' digital media efforts and help us accomplish their online communications goals.</p><p><br></p><p><strong>JOB DESCRIPTION</strong></p><p><br></p><p>The<strong><em>&nbsp;Social Media Manager</em></strong>&nbsp;actively supports multiple communications initiatives, including development of social strategies, generating and growing social media plans, implementing and reporting on their success, and day-to-day coordination and support of social initiatives.</p><p><br></p><p>This growth-oriented position can stretch to allow for the development and delivery of digital media services and/or specific creative services, such as content development, copywriting, editing, new business efforts, media relations, and events.</p><p><br></p><p><strong>Qualifications:</strong></p><p>- Minimum BA required</p><p>- 3+ years experience preferred</p><p>- Strong social media background</p><p>- Agency experience is a plus for this position, but it’s not required</p><p><br></p><p><strong>ADDITIONAL INFORMATION&nbsp;</strong></p><p><br></p><p>We're committed to being a diverse and inclusive workplace that represents the community we serve and the clients we partner with. Learn more by reading the full job description on our website: http://emspacegroup.com/about/careers/</p><p><br></p><p><strong>Please send your resume and cover letter to:</strong></p><p>James Thompson</p><p>james@emspacegroup.com</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Emspace + Lovgren",
        "link": "https://www.linkedin.com/company/emspace-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Omaha",
        "region": "NE",
        "postal_code": "68145",
        "street_address": null,
        "latitude": 41.25865,
        "longitude": -95.937195
    }
}