{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<strong>Remote-IoT- Equity<br><br></strong>This Jobot Job is hosted by Dylan Currier<br><br>Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.<br><br>Salary $140,000 - $180,000 per year<br><br><strong>A Bit About Us<br><br></strong>We are an early stage startup in the Bay Area that is utilizing machine data to deliver critical information. We make sure people are safe by taking advantage of IoT and sensor data. Our goal is to help improve lives and make sure that everyone is safe at all times.<br><br>As a member of our team, your work will be at a global presence impacting the lives of millions. We are looking for someone who is excited about making a global impact at scale!<br><br><strong><br><br><strong>Why join us?<br><br><br></strong></strong>We are a fast growing startup and have a strong engineering presence here in Silicon Valley. We have executives who have worked at top tech companies and attended top universities.<br><br>We offer a generous amount of equity and pay competitive salaries!<br><br><strong>Job Details<br></strong><ul><li>You will be owning both our on prem and cloud infrastructure</li><li>You will be implementing end to end infra automation </li><li>You will be automating everything and anything</li><li>You will be using cutting edge technologies such as Ansible, Terraform, Kubernetes, and Docker<br></li></ul>Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-09"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Mateo",
        "region": "CA",
        "postal_code": "94406",
        "street_address": null,
        "latitude": 37.54715,
        "longitude": -122.3144
    }
}