{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Computer Software"
        ],
        "description": "🚀<strong>What's the opportunity?<br><br></strong>WorkRamp is growing steadily in a large well defined SAAS market. We are currently looking for engineers that will help architect and lay the foundation for the company for the next few years. At WorkRamp we strive for engineering excellence. Our team is collaborative and impact focused, and we hold each other to a high quality standard with code review. Engineers own projects end to end. You will work closely with our customer and design teams to identify the customer pain point, architect a well-crafted solution, and deploy at scale.<br><br>🔧<strong>What will I be doing?<br><br></strong><strong><u>Our Tech Stack Consists Of<br></u></strong><ul><li>Ruby on Rails backend</li><li>React and MobX on the frontend</li><li>Postgres</li><li>Deployed on AWS<br></li></ul><strong><u>Projects You Might Work On<br></u></strong><ul><li>Rearchitect certain parts of the codebase to be more event-driven (evaluate different queueing systems, make sure queued actions are idempotent, etc.)</li><li>A reporting/analytics engine to surface all the training metrics generated by our system. Have the ability to filter by many different dimensions. Figure out the data storage/caching mechanism to make queries performant.</li><li>Set up continuous testing pipeline. Build up test suite and make sure it runs in a reasonable amount of time. Integrate testing with our code review tool (phabricator).</li><li>Implement a new UI design on some of our most critical pages. Make sure the UX makes sense and the page loads quickly.</li><li>Architecting, developing, and deploying new features for our core SAAS product in a full stack capacity<br></li></ul>🙌 <strong>What skills do I need?<br></strong><ul><li>Strong desire to work at an early-stage startup</li><li>1-4 years of industry-experience building product quality software</li><li>Expert time-management and prioritization within a fast-paced environment</li><li>Effective at collaborating with cross-functional teams<br></li></ul>The salary range for this position is $120,000 - $200,000<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02"
    },
    "company": {
        "name": "WorkRamp",
        "link": "https://www.linkedin.com/company/workramp"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}