{
    "job": {
        "title": "Front End Web Developer",
        "industry": [
            "Marketing and Advertising",
            "Design",
            "Graphic Design"
        ],
        "description": "We are looking for a Front-End Web Developer who is motivated to combine the art of design with the art of programming. Responsibilities will include translation of the UI/UX design wireframes to actual code that will produce visual elements of the application. You will work with the design team and bridge the gap between graphical design and technical implementation, taking an active role on both sides and defining how the application looks as well as how it works.<br><br><strong><u>Requirements<br></u></strong><ul> <li>Must live in Los Angeles. No relocation or visa sponsorship is available for this position</li> <li>3+ years’ experience in converting graphical content to HTML5 responsive desktop and mobile-ready website/apps</li> <li>Proficient understanding of cross-browser compatibility issues and ways to work around them.</li> <li>Comfortable taking PSD, AI, and/or Sketch files and creating HTML/CSS/JavaScript renditions</li> <li>An eye for the graphical integrity of the original design is required</li> <li>Solid working knowledge of HTML5, CSS, SASS, Bootstrap3 &amp; 4 and knowledge of the DOM</li> <li>Experience with jQuery, Angula5 or other JavaScript frameworks would be helpful</li> <li>Comfortable working closely with both the graphics provider and the development team</li> <li>Must understand responsive design and have the ability to optimize a design for all devices</li> <li>Have the desire and ability to mentor other team members to establish a good team environment</li> <br><br></ul><u><strong>Benefits<br></strong></u><ul><li>This will be a contract position.</li></ul>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-30"
    },
    "company": {
        "name": "Contend",
        "link": "https://www.linkedin.com/company/contend"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}