{
    "job": {
        "title": "Mathematician/Data Scientist",
        "industry": [
            "Information Technology and Services",
            "Banking",
            "Financial Services"
        ],
        "description": "<p><strong>Mathematician/Data Scientist</strong></p><p><strong>Large Banking Client</strong></p><p><strong>Corporate Investment Banking Operations </strong></p><p><strong>12 month+ contract to hire potential </strong></p><p><strong>&nbsp;</strong></p><p>Are you inquisitive? Do you love math? Apex Systems is seeking Data Scientists to assist our client's model developers with model development, enhancement, breach remediation, performance testing, and documentation. The ideal candidate will have a background in a quantitative or technical field and have experience in data-driven prediction and decision making, machine learning, data analysis, and working with large data sets.   </p><p><br></p><p><strong>Job Duties: </strong></p><p>- Lead or assist the model developer with Machine Learning and AI modeling engagement from understanding the business objective, through data sourcing and analysis, to model development and implementation</p><p> - Identify model breach and develop action plans to remediate the breach</p><p> - Develop model ongoing monitoring plan to proactively monitor model performance</p><p> - Management relationship with key stakeholders including technology team, line of business, and model risk management team</p><p> - Become a subject matter expert and trusted advisor to your business partners and help them understand the strengths and shortcomings of our models   </p><p><br></p><p><strong>Required Skillsets and Education:   </strong></p><ul><li>M.S. degree in Statistics, Mathematics, Operations Research, Engineering, Computer Science, or Economics   </li><li>3+ years of quantitative or mathematical modeling related experience   </li><li>Hands-on experience with Machine Learning and Artificial Intelligence applied to large datasets   (A major plus - but not required)</li><li>Expertise in at least one of the following: Python, SAS, Java   &nbsp;  </li></ul><p><br></p><p><strong> Preferred Skillsets and Education:</strong>   </p><ul><li>PhD in a quantitative discipline   </li><li>5+ years of quantitative model development experience in banks   </li><li>Hands-on experience with Machine Learning, Deep Learning, Natural Language Processing, and Optical Character Recognition (OCR) models  </li><li> Demonstrated ability to set clear goals, plan ahead, and deliver against tight timelines   &nbsp; </li></ul><p>&nbsp;</p>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-19"
    },
    "company": {
        "name": "Apex Systems",
        "link": "https://www.linkedin.com/company/apex-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Charlotte",
        "region": "NC",
        "postal_code": "28241",
        "street_address": null,
        "latitude": 35.223785,
        "longitude": -80.84114
    }
}