{
    "job": {
        "title": "Junior Full-Stack Web Developer",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Internet"
        ],
        "description": "Do you love bringing innovative dreams to life? Are you creative with a technological bent? Do you want to be a part of a team that pushes boundaries and redefines what’s possible in tech? We have something you might like.<br><br>InterWorks is currently seeking a Junior Full-Stack PHP Web Developer to join our Experience team. We need someone with boundless imagination who’s ready to hit the ground running with backend support for our tailormade Curator product. Our ideal fit thrives in fast-paced environments and is right at home when it comes to collaboration, customer service and exceeding client expectations. This individual will play an integral role in laying a strong foundation for this product, charting a trailblazing course for its future and dreaming up new ways to experience data.<br><br><strong><u>What You’ll Do<br></u></strong><ul><li>Consult with clients and other developers to define the right solution</li><li>Install and customize software based on client needs</li><li>Interact directly with clients to outline requirements, manage expectations and train on software administration</li><li>Manage and deliver PHP software <br><br></li></ul><strong><u>What You’ll Need<br><br></u></strong><u>Must-Haves<br></u><ul><li>Experience in CSS3</li><li>Experience with jQuery or other JavaScript libraries</li><li>Strong communication skills</li><li>Highly effective time-management skills<br></li></ul><u>What We’d Like You to Have <br></u><ul><li>Experience in OOP PHP</li><li>Experience with AJAX</li><li>Experience with SQL</li><li>Laravel and/or OctoberCMS, or similar frameworks</li><li>Experience integrating third-party APIs into PHP</li><li>Frontend CSS frameworks, like Bootstrap</li><li>Interest in consulting and training, beyond simply coding</li><li>MySQL administration</li><li>Apache and/or IIS administration</li><li>Linux administration<br><br></li></ul><strong>Why InterWorks<br><br></strong>InterWorks is a people-focused tech consultancy that empowers clients with customized, collaborative solutions, and we love pursuing innovation alongside people who inspire us. Our approach to work and community is unique and unconventional—just like us—and that’s the way we want it. The only thing missing is you.<br><br><em>We are currently monitoring the COVID-19 situation globally and our team is working remotely. Please don't talk yourself out of applying if you don't meet all requirements. At InterWorks, we value unique contributions, our people are the glue that holds our business together. We’re always looking for the right people, and we could be your perfect fit.<br><br></em>Powered by JazzHR<br><br>awXlk90upg",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-26"
    },
    "company": {
        "name": "InterWorks",
        "link": "https://www.linkedin.com/company/interworks"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Oklahoma City",
        "region": "OK",
        "postal_code": "73118",
        "street_address": null,
        "latitude": 35.468494,
        "longitude": -97.52126
    }
}