{
    "job": {
        "title": "Software Engineer - Delphi, Borland C++, SRS",
        "industry": [
            "Biotechnology"
        ],
        "description": "If you are a Software Engineer with experience in the Medical Device field, please read on!<br><br>We are a quickly growing medical device company looking for a Research and Development Software Engineer to join our passionate and energetic team!<br><br>The ideal candidate would posses a Bachelor's or Master's degree in software engineering or related discipline and 3 to 5 years of experience in software development with emphasis on embedded system and medical devices.<br><br>What You Will Be Doing<br><ul><li>Responsible for software design, development, coding, testing, bug fixing and maintaining of applications for medical device</li><li>Independently evaluates, selects, and applies standard software engineering practices and procedures to create software design concepts that satisfy or exceeds product requirements</li><li>Make major and minor modifications and enhancement to existing software designs</li><li>Plans and schedules work assignments and tasks in coordination with overall project objectives</li><li>Generate complete, concise documentation of the software requirement specifications, software design specification, and detail design including software coding<br></li></ul>What You Need for this Position<br><ul><li> Delphi</li><li> Borland C++</li><li> SRS</li><li> SVP</li><li> SLOC</li><li> SDS</li><li> SDP</li><li> SDD</li><li> SAS</li><li> Pascal<br></li></ul>What's In It for You<br><ul><li>90-120K</li><li>Full benefit package</li><li>Great leadership</li><li>Endless growth potential</li><li>Passionate and helpful team members<br></li></ul>We are actively interviewing for this role, so please APPLY TODAY!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Shauna.Hillegas@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SH6-1645634 -- in the email subject line for your application to be considered.***<br></li></ul>Shauna Hillegas - Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Rancho Cordova",
        "region": "CA",
        "postal_code": "95741",
        "street_address": null,
        "latitude": 38.602104,
        "longitude": -121.2909
    }
}