{
    "job": {
        "title": "DevOps Engineer - Drone / Government / AV / AI",
        "industry": [
            "Defense & Space"
        ],
        "description": "We are a rapidly growing autonomy and robotics technology company that has been in business for over 20 years! We are transforming government and commercial transportation with programs that include self-driving cars and trucks; autonomous shuttles; UAV; UAS; and drones. As we grow our team, we are looking for passionate people who want to build long-term careers with us!<br><br>What's In It for You<br><ul><li> Competitive Compensation Contingent On Experience</li><li> Health, Vision, and Dental Benefits</li><li> 401k Matching</li><li> Parental Leave</li><li> Life Insurance<br></li></ul>What You Need for this Position<br><ul><li> Experience as a DevOps Engineer</li><li> Proficient with both Windows and Linux, both from the GUI and command line</li><li> Familiar with Linux diagnostic applications such as top, ps, df, wireshark</li><li> Able to work through and document installation process of Linux on x86 and ARM hardware</li><li> Capable of documenting instructions, issues, and resolutions in the Atlassian Suite of tools</li><li> Experience with writing scripts to aid in automation of installation and configuration tasks</li><li> Familiar with cloud-based services, preferably AWS</li><li> Familiar with CAN, RS232, and Ethernet (Plus)</li><li> Compile and tweak the Linux kernel (Plus)</li><li> VPN configuration (Plus)</li><li> Container frameworks such as Docker (Plus)</li><li> Experience with robotics, AV , AUS, AUS, and/or AI (Plus)</li><li> Ability to obtain government clearance; although clearance is not required for this role<br></li></ul>What You Will Be Doing<br><ul><li> Secure Linux-based systems from cyber attacks, including physical install and configure firmware on embedded hardware devices on custom Linux distributions (especially Ubuntu), Android devices, and microcontrollers (STM)</li><li> Configure various network devices, including wireless radios and network switches</li><li> Maintain proper documentation of system configuration changes</li><li> Collaborate with technicians, SysAdmins, and other DevOps Engineers to diagnose and solve higher level issues</li><li> Accurately document installation and configuration processes</li><li> May require domestic and international travel<br></li></ul>So, if you have the experience above, please apply today or email me directly at edwin.ocampo@cybercoders.com!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Edwin.Ocampo@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : EO1-1636917 -- in the email subject line for your application to be considered.***<br></li></ul>Edwin Ocampo - Recruiting Manager - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.<br><br>CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Gaithersburg",
        "region": "MD",
        "postal_code": "20884",
        "street_address": null,
        "latitude": 39.142185,
        "longitude": -77.193405
    }
}