{
    "job": {
        "title": "Post Doctoral Researcher",
        "industry": [
            "Higher Education"
        ],
        "description": "<strong><u>Posting Number<br><br></u></strong>A00450<br><br><strong><u>Position Title<br><br></u></strong>Post Doctoral Researcher<br><br><strong><u>Campus<br><br></u></strong>Western University Campus-Pomona, CA<br><br><strong><u>Department<br><br></u></strong>1404-Basic Medical Sciences<br><br><strong><u>Type Of Position<br><br></u></strong>Administration<br><br><strong><u>Job Summary<br><br></u></strong>To study the mechanisms of synaptic plasticity in hippocampus and other brain structures, using a combination of electrophysiological, behavioral, and molecular and cell biology approaches, under physiological conditions and in diseases. In particular, to study transcription regulation and the roles of protein synthesis and protein degradation in these mechanisms. These studies will be applied to understand the basis for impairment of synaptic plasticity in various models of human diseases, including Angelman syndrome, traumatic brain injury, and repeated concussions.<br><br><strong><u>Knowledge, Skills And Abilities<br></u></strong><ul><li>Must possess good English skills and have the ability to communicate effectively with others in person, via telephone, Internet and e-mail programs.</li><li>Ability to effectively interact with administration, faculty, staff, and students.<br></li></ul><strong><u>Required Qualifications<br></u></strong><ul><li>Education:Ph.D. and/or M.D. in neurobiology, neuroscience, molecular biology and or related areas.</li><li>Experience: Prior experience with confocal microscopy, immunohistochemistry, biochemistry, molecular biology, tissue culture, transgenic techniques, ELISA and animal behavior.<br></li></ul><strong><u>List Comments Regarding Work Hours<br><br></u></strong>Work hours may vary from 8:00 to 5:00 p.m.<br><br><strong><u>Posting Date<br><br></u></strong>05/17/2021<br><br><strong><u>Job Duty<br><br></u></strong>Designs and conducts independent experiments in coordination with principal investigator, Dr. Xiaoning Bi; including, designing novel experiments; conducting literature searches of published research; performing experiments; collecting/ analyzing/ summarizing data; and assisting with writing/ proofreading manuscripts.<br><br><strong><u>Percentage Of Time<br><br></u></strong>25<br><br><strong><u>Job Duty<br><br></u></strong>Meticulously maintains laboratories, keeping inventory of equipment and supplies, ordering equipment and supplies; contacting vendors/technical support/ obtaining price quotes/ and determining best value/ price for various products.<br><br><strong><u>Job Duty<br><br></u></strong>Job DutyMeticulously maintains laboratory notebook to formally document results of experiments. Researches published literature, including locating/obtaining articles for principal investigator; searching internet/library for literature related to independent research. Reads published literature and continuously updates research protocols as techniques evolve or change. Applies protocols from published literature to evolve or change. Applies protocols from published literature to novel experimental designs.<br><br><strong><u>Job Duty<br><br></u></strong>Supervises junior new laboratory personnel, including technicians, work study, and students.<br><br><strong><u>Percentage Of Time<br><br></u></strong>25<br><br><strong>Do the essential functions of this job require lifting?:<br><br></strong>Yes<br><br><strong><u>If Yes, List Maximum Weight And Duration<br><br></u></strong>The physical demands described here are representative of those that must be met by any employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br>While performing the duties of this job, the employee is frequently required to use hands, reach with hands and arms, and stoop. The employee is also required to stand and walk. The employee must occasionally lift and/or move up to 10 pounds.<br><br><strong><u>Describe Work Environment<br><br></u></strong>The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.<br><br>Duties of the position are normally performed in a typical laboratory setting. Occasionally the employee is exposed moving mechanical parts, toxic and/or caustic chemicals and there may be a risk of electrical shock. Specific vision abilities required by this job include close vision, color vision, depth perception and the ability to adjust focus. The noise level in this setting is usually moderate due to telephone calls, office and laboratory equipment, and normal laboratory personnel traffic.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21"
    },
    "company": {
        "name": "Western University of Health Sciences",
        "link": "https://www.linkedin.com/company/western-university-of-health-sciences"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Phillips",
        "region": "CA",
        "postal_code": "95709",
        "street_address": null,
        "latitude": 38.81701,
        "longitude": -120.077194
    }
}