{
    "job": {
        "title": "Test Engineer - RF",
        "industry": [
            "Computer Software",
            "Automotive",
            "Telecommunications"
        ],
        "description": "<strong>yöu</strong><strong>top 5 reasöns<br></strong><ul><li>This position is currently a temporary work from home/remote position. You must be willing to relocate to Morristown, NJ or Irvine, CA USA once COVID policies/restrictions are lifted. üs umlaut is a 4500+ people strong global full-service cross industry end-to-end partner that applies its deep-running interdisciplinary, collaborative advisory and fulfilment capabilities to change its clients fortunes for the better and - on top of that - add value, quality and focus to their organisations and produce. our öffer</li><li>Perform RF Interference Hunting operations, including identification and mitigation of sources all over the U.S.</li><li>Perform Passive Intermodulation (PIM) tests and repair base stations</li><li>Identify source of radio frequency interference</li><li>Operate and maintain your measurement instruments, tools, and vehicle</li><li>Identify and plan routes in concert with Interference Hunting management</li><li>Work closely with senior engineers at the nation’s biggest carriers to solve interference issues</li><li>Drive obligations to successful closure, balancing a “getting it done” attitude combined with “doing it right the first time”</li><li>Develop visually compelling presentations of your results</li><li>Report project status, action items and next planned steps on a regular basis</li><li>Bachelor's degree in Electrical Engineering, Telecommunications, Computer Science, or equivalent</li><li>Proficient with a spectrum analyzer, and PIM test tools</li><li>Knowledge of RF technology, radio propagation, and cellular technologies.</li><li>Experience in the physical setup of cellular base stations</li><li>Proficient in computer applications including databases, spreadsheets, and word processing</li><li>Proficient in MS Power Point</li><li>Must be technically sound, detail oriented with strong troubleshooting skills</li><li>Able to work independently</li><li>Comfortable in a multi-cultural environment</li><li>Ability to handle short deadlines and ad-hoc travel schedules</li><li>Willingness to work weekends and holidays if needed</li><li>Travel up to 90% is expected both domestic and international</li><li>An entrepreneurial environment with immediate responsibility and a chance to make a difference from the word go</li><li>Innovative projects with big name clients and exposure to future, cutting edge technologies</li><li>Unlimited individual growth opportunities and the ability to create a personalised career path</li><li>Access to a global network with opportunities to live and work abroad</li><li>All the support, training and coaching you need to further your career</li><li>+X. A team spirit and family-like culture as exciting and colourful as our gradient coloured coffee marshmallows</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08"
    },
    "company": {
        "name": "umlaut company",
        "link": "https://de.linkedin.com/company/umlaut-company"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}