{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Financial Services",
            "Computer Software"
        ],
        "description": "<p><strong>Software Engineer, Platform Application Developer </strong></p><p><strong>Company</strong>: Rhove (https://rhove.com/ ) </p><p><br></p><p><strong>Job Description:</strong> </p><p>Rhove is seeking a software engineer interested in building our core product’s platform. Rhove engineers are part of a fast-moving startup building an impactful product and supporting each other on the job. Software engineers who love shipping meaningful code weekly, ramping up on something new and having an outsized impact are encouraged to apply. </p><p><br></p><p><strong>About Rhove </strong></p><p>Democracy is strongest when everyone has ownership. Rhove is a venture-backed Fintech startup that’s removing barriers and creating access so that anyone can invest in the places they love most. Our mission is to democratize real estate investing so that anyone can experience ownership. </p><p><br></p><p><strong>Job Responsibilities </strong></p><p>You will be responsible for architecting, developing, testing, and deploying platform application code to support Rhove’s mission. A strong ability to communicate with team members to identify technical tradeoffs and problem-solve for short timelines is crucial. Job responsibilities include, but are not limited to, the following: </p><ul><li>Collaborate with product and business teams to define features, balancing functionality with time to market </li><li>Design scalability solutions that are the right fit for our domain and load expectations Learn our business and help align technology innovation with our customer needs </li><li>Collaborate with other team members and stakeholders </li></ul><p>Must be located in, or willing to relocate to, Columbus, OH. </p><p>At this time, we do not sponsor H-1B visas. </p><p><br></p><p><strong>Desired Skills and Experience</strong> </p><ul><li>We’re looking for someone with experience in a mixture of the following technologies: </li><li>2+ Years Experience in software development Experience with backend frameworks (eg. Spring, .NET, Django, etc) </li><li>REST API design and development </li><li>Experience with Relational Database </li><li>AWS Cloud services usage - (e.g. Lambda, S3, SQS, Fargate, DynamoDB, etc) </li></ul><p><br></p><p><strong>Benefits </strong></p><ul><li>Employer-paid healthcare plan for you and your family </li><li>Employer-contributed Health Savings Account Dental, vision, basic life insurance </li><li>Short term and Long term disability insurance </li><li>Generous PTO </li><li>Equity stock option plan </li></ul><p><br></p><p><strong>Core Values </strong></p><ul><li>Authenticity - We are honest, open, ethical, and fair. People trust us to adhere to our word. </li><li>Curiosity &amp; Creativity - We embrace reason and the scientific method. Curiosity drives creativity. We continuously learn from others and the world, ask interesting questions, test our hypotheses, make conclusions and apply knowledge. We take risks, develop and apply good judgment, cultivate our own voice, and celebrate the expression of others. </li><li>Remarkable - We solve hard problems. We take moon shots and swing for the fences. We operate in the realm of the adjacent possible. </li><li>Diversity &amp; Inclusion - We embrace people with dignity and respect regardless of their background, race, ethnicity, age, gender, disability, belief system, nationality, or sexual orientation. We foster the appreciation of and seek to engage, different perspectives and ideas. </li><li>Deliberate - We are purpose-driven. We act with intention. We are organized and timely. Our actions are considerate of the best interests of our team members, customers, stakeholders, investors, the market, and ourselves. </li><li>Autonomy &amp; Responsibility - We hold ourselves and each other accountable to the highest standards. We are proactive and dependable. We have a high tolerance for disciplined experimentation and failure but no tolerance for incompetence.</li><li>Grit &amp; Resilience - We overcome challenges. We operate with courage, resolve, and strength of character. We make mistakes, learn from them, and break through. </li><li>Pride &amp; Swagger - We take pride in our work and ourselves. We put in the extra effort, walk the walk, deliver and win. We understand our limitations, overcome them and strive for greatness. We bring our best selves and contribute to the success of our team, customers and stakeholders. </li><li>Fulfillment - We are content. Our work is meaningful, challenging and makes a positive difference. Our collaboration contributes to the happiness and well-being of our team and families. </li><li>Craftsmanship - We value the quality in our work that comes from creating with passion, care, and attention to detail</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18"
    },
    "company": {
        "name": "Rhove",
        "link": "https://www.linkedin.com/company/rhove"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Columbus",
        "region": "Ohio Metropolitan Area",
        "postal_code": "43206",
        "street_address": null,
        "latitude": 39.978302,
        "longitude": -82.99313
    }
}