{
    "job": {
        "title": "Software Engineer I",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Computer & Network Security"
        ],
        "description": "This position requires common knowledge and an understanding of basic techniques and concepts of programming in at least one programming language. The focus is on learning and gaining on the job experience.<br><br><strong><u>General Characteristics<br></u></strong><ul><li> Acquires basic knowledge and develops skills in a specific practice area.</li><li> Applies standard techniques and procedures to perform assigned tasks as part of a broader assignment.</li><li> Requires guidance and oversight on details of work.</li><li> Familiar with the principals of the Agile Manifesto. Ideally has some knowledge of the SCRUM Agile methodology.</li><li> Active participant in Agile ceremonies (daily standup, retrospective, etc.).</li><li> Displays ability to follow directions and understand procedural guidelines.</li><li> Possesses an analytical mind and the desire to investigate problem.<br></li></ul><strong><u>Technical Responsibilities<br></u></strong><ul><li> Performs basic design tasks.</li><li> Performs coding, testing and administration assignments.</li><li> Familiarity with Java (understanding of object oriented concepts, syntax, etc.).</li><li>Familiarity with an integrated design environment (IDE) and tools required to write software.</li><li> Familiarity with Linux or Unix operating system</li><li> Working knowledge of computer networking with protocols such as TCP, UDP and SCTP.</li><li>Familiarity with other languages such as javascript, python, C/C++, HTML, CSS, etc.<br></li></ul><strong><u>Managerial Responsibilities<br></u></strong><ul><li> Coordinates with technical and/or administrative staff.</li><li> Focus is on learning.<br></li></ul><strong><u>Direction Received<br></u></strong><ul><li> Close supervision and guidance is required for many aspects of work.<br></li></ul><strong><u>Communication Skills<br></u></strong><ul><li> Possesses basic oral and written communication skills.</li><li> Interacts professionally with other staff.</li><li> Actively seeks help from manager, peers, and other members of the team.<br></li></ul><strong><u>Experience<br></u></strong><ul><li> 0-1+ Years, bachelor's degree in computer science or a related field<br></li></ul><em>By submitting your interest in this job, you agree to receive text notifications with additional steps to complete your job application. You will receive up to 6 messages from the number \"63879\". Message &amp; data rates may apply. Please refer to our privacy policy for more information.</em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09"
    },
    "company": {
        "name": "NetNumber",
        "link": "https://www.linkedin.com/company/netnumber"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Lowell",
        "region": "MA",
        "postal_code": "01850",
        "street_address": null,
        "latitude": 42.645428,
        "longitude": -71.3074
    }
}