{
    "job": {
        "title": "Invoice Specialist - Remote",
        "industry": [
            "Biotechnology",
            "Hospital & Health Care",
            "Pharmaceuticals"
        ],
        "description": "<strong><u>Description<br><br></u></strong><em>Position at Premier Research<br><br></em>Premier Research helps highly innovative bio-pharmaceutical and medical device companies transform life-changing ideas into reality. We take on the most challenging areas of study, with a special focus on unmet needs in such areas as Oncology, Analgesia, CNS, Rare Diseases, Dermatology and Pediatric Research.<br><br>We’re looking for a talented and innovative <strong>Invoice Specialist</strong> to join our dynamic team!<br><br>Working at Premier Research means being an individual - you will be recognised for your expertise and you will truly have an impact. You will be working in an aspiring and empowering environment with colleagues who are genuinely supportive regardless of location or seniority. Premier Research is on an exciting journey - there is a true buzz throughout the company, so come and be part of it!<br><br><strong><u>Role Responsibilities<br></u></strong><ul><li>Oversee investigator payment reimbursement</li><li>Review, verify, and approve invoices in accordance with standard operating procedures</li><li>Ensure additional necessary invoice approvals are obtained from management as required</li><li>Responsible for querying anomalies on invoices and escalating to appropriate individual(s)</li><li>Track invoice statuses in Microsoft Excel and provide standard and ad hoc reports to management</li><li>Track individual workload in Microsoft Excel template and provide monthly workload metrics to management.</li><li>Perform additional duties as assigned.<br></li></ul><strong><u>Role Requirements<br></u></strong><ul><li>Bachelor degree, or international equivalent from an accredited institution, preferably in a financial field, or equivalent combination of education, training and experience</li><li>1 to 5 years of practical experience processing invoices for clinical trial sites, clinical trial investigators, clinical research organizations, pharmaceutical companies, or medical device companies. Alternately, must have proven experience in all primary job functions.</li><li>Demonstrates excellent English verbal and written communication skills</li><li>Excellent computer skills in a Microsoft Windows environment including proficiency in the Microsoft Office Suite of tools (eg - Outlook, Work, Excel, etc)</li><li>Proven ability to drive a successful customer experience through positive customer interactions, provision of quality and timely deliverables, and task ownership</li><li>Strong analytical and organization skills, able to work independently and manage multiple projects simultaneously in a fast-paced environment with changing priorities</li><li>Previous project management experience preferred</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Premier Research",
        "link": "https://www.linkedin.com/company/premier-research"
    },
    "education": {
        "required_credential": "associate degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}