{
    "job": {
        "title": "Software Engineer",
        "industry": [],
        "description": "<p>Obsess is an experiential e-commerce platform, that enables retailers to create 3D 360 VIRTUAL STORES on their websites. We are a managed SaaS platform and have created proprietary patent-pending technology to deliver beautiful and fast web VR shoppable experiences. Our customers are large brands and retailers across fashion, beauty, and various other verticals. We are a startup based in New York City, backed by Village Global (fund backed by top tech entrepreneurs including Jeff Bezos, Mark Zuckerberg, Bill Gates, etc), Jump Capital, The VR Fund, Techstars and more. Our founder &amp; CEO is an MIT alum who was formerly an engineer &amp; tech lead at Google for 5 years and then led product at Vogue.</p><p><br></p><p>You can learn more about our platform here:&nbsp;https://obsessAR.com</p><p>You can see examples of virtual stores here:&nbsp;https://ShopObsess.co</p><p>You can read more about us on Forbes:&nbsp;https://www.forbes.com/sites/kristinlarson/2021/06/29/e-commerce-leader-obsess-takes-virtual-shopping-to-the-next-level-with-latest-funding-round/</p><p><br></p><p><br></p><p>ROLE&nbsp;</p><p>We are looking for a Fullstack Software Engineer, with experience in React and Python. You’ll be developing a new type of shopping experience using web-based 3D 360 technologies. You'll work on developing the frontend and backend APIs for the end-user experience and the content management system.&nbsp;</p><p><br></p><p>Our most important company value is hard work – we are looking for a dedicated and hardworking team member who understands what it takes to make an early-stage startup successful. And that a startup is not a 9-to-5 job. Someone who can work really fast and be flexible. Someone who wants to make a big impact by working on innovative technology.</p><p><br></p><p>This position is based in New York City, and will be local in-office starting October 2021. This is not a hybrid or remote role.</p><p><br></p><p><br></p><p>QUALIFICATIONS&nbsp;</p><p>* 2+ years of development experience with React.js</p><p>* 2+ years of development experience with Python</p><p>* Experience with building responsive, visual, interactive web-based user interfaces</p><p>* Experience with CI/CD pipelines</p><p>* Experience with architecting scaleable, fast performing web apps</p><p>* Interest in 3D technologies</p><p>* Bonus: experience with WebGL</p><p>* BS or MS degree in Computer Science preferred</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18"
    },
    "company": {
        "name": "Obsess",
        "link": "https://www.linkedin.com/company/obsess"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}