{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Retail",
            "Health",
            "Wellness and Fitness",
            "Hospital & Health Care"
        ],
        "description": "Peachy is seeking a Software Engineer to join the team! Peachy is a fast-growing, wrinkle prevention brand based in New York City. We offer the three scientifically demonstrated ways to prevent and treat facial wrinkles in our studios. It's our mission to make wrinkle prevention and treatment approachable, but also clinically excellent.<br><br>We are looking for a Software Engineer that is excited about building a technology infrastructure to scale with a growing business. This opportunity will report directly to our Engineering Lead, and will be an instrumental hire to expand our Technology department.<br><br><strong> What You'll Do <br></strong><ul><li>Develop, test, deploy and manage scalable technology applications (Peachy studio app, photo booth, and website)</li><li>Collaborate with UX designer on Peachy studio app layout modifications</li><li>Create and instill engineering best practices, drive adoption in code health, testing, and maintainability</li><li>Contribute to the full stack, from backend APIs to front end-user interfaces, to deliver end-to-end solutionsIdentify business needs, contribute to technical strategy, and create technology roadmaps and documentation</li><li>Design frameworks to ingest data from our customer journey</li><li>Improve existing technology infrastructure, and workflow challenges through recommended process improvement solutions<br><br></li></ul><strong> Who You Are <br></strong><ul><li>BS in Computer Science or a related field</li><li>2+ years of experience preferredFamiliarity with open-source technologies</li><li>Proficiency with HTML and CSS, or Javascript</li><li>Experience in any front end framework such as React/Redux, Angular, Vue, Svelte</li><li>Knowledge of HTTP protocols, developer tools, SSL certificates and web application architecture</li><li>Experience with distributed systems</li><li>Comfortable working with cloud services</li><li>A strong understanding of, and practical experience with, web application development.</li><li>Excited about the opportunity to act autonomously, manage individual project priorities, deadlines and deliverables</li><li>Experience writing understandable, testable, efficient code</li><li>Ability to collaborate cross-functionally and excellent communication skills</li><li>An understanding of modern design patterns and proven experience applying them</li></ul>Pay &amp; Perks:<br><ul><li>Health &amp; Wellness perks</li><li>Competitive compensation</li><li>Complimentary Peachy services and products</li><li>The opportunity to join a high-growth company at an early stage</li><li>The ability to impact the growth of the company, we value employee feedback &amp; suggestions!</li></ul>Peachy is an equal opportunity employer and does not discriminate against any applicant or employee because of race, color, religion, sex, national origin, disability, genetic information, age, or military or veteran status in accordance with federal law. In addition, the Company complies with applicable state and local laws governing non‐discrimination in employment in every jurisdiction in which it maintains facilities. The Company also provides reasonable accommodation to qualified individuals with disabilities, pregnant individuals, and individuals with sincerely held religious beliefs, in accordance with applicable laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10"
    },
    "company": {
        "name": "Peachy",
        "link": "https://www.linkedin.com/company/peachystudio"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}