{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<p><strong>Software Developer </strong></p><p><br></p><p>Paragon Hire has an opening with our client for a full-time direct hire<strong> REMOTE</strong> <strong>Software Developer</strong> reporting to the Development Manager.&nbsp;</p><p>&nbsp;</p><p>The Software Developer is responsible for using coding languages to compose, compile and test programs and applications in order to provide cellular cost optimization services to enterprises. The Software Developer will join our talented A-team with a shared commitment to reduce our clients’ monthly cell phone bills while simultaneously making it easier to manage their mobile device inventory and services.&nbsp;</p><p>&nbsp;</p><p>Our client, headquartered in New York, has been helping businesses around the world better manage their corporate-liable mobility assets for over 10 years with advanced mobile device management solutions and services. Through a mix of technology, processes, and people they scrutinize every element a Customer’s corporate mobility environment optimize your costs, increase your efficiency and provide you with real-time visibility and control.&nbsp;</p><p><strong>&nbsp;</strong></p><p><strong>Responsibilities</strong></p><p><strong>&nbsp;</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Collaborate with project manager, clients, end users, and other stakeholders to understand user needs.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Shape our product and deliver new features monthly improving our effectiveness and making our users happier.&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Attend and contribute to development team meeting.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Build new applications that will increase the values.&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Analyzes existing program logic to identify causes of program malfunctions; modifies program logic to eliminate problems or increase the operational efficiency of the program.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Maintains knowledge of trends and developments in related areas of technology and programming.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You will work under the tutelage of our team lead and developer extraordinaire, and alongside other like-minded professionals to design systems to support applications.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Write and maintain code.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Work on bug fixes.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Performs other related duties as assigned.</p><p>&nbsp;</p><p><strong>Required Skills</strong></p><p><strong>&nbsp;</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Able to write excellent code to solve complex business problems and process automation.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;You are eager to learn but have a solid foundation of experience to bring to the team.&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Thorough understanding of design, testing, and modification of programs and applications.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proficient with or the ability to quickly learn the technologies, coding and programming languages used in the organization.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Knowledge of coding languages and systems.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Able to develop front end UX using CSS3, HTML5 and Bootstrap while delivering content from MSSQL via Ruby on Rails.&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Eager to create new integrations with other systems to enhance our capabilities and find new ways to leverage existing features.&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Strong problem-solving, analytical and communication skills.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Excellent time management skills.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Proficient with Microsoft Office Suite and related software.&nbsp;&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Prolonged periods of sitting at a desk and working on a computer.</p><p>&nbsp;</p><p><strong>Experience and Education</strong></p><p>&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Three years of related work experience required.&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Bachelor’s degree or technical certification required.</p><p>&nbsp;</p><p><strong>Our Client Provides</strong></p><p><strong>&nbsp;</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Location:&nbsp;You have the option of working in one of our two offices (Long Island, NY or East Windsor, NJ) alongside other team members, 100% remote in the comfort of your most effective environment, or a hybrid of the two based on your location.&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Salary &amp; benefits to commensurate with experience and achievement.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Training opportunities and a highly collaborative environment.</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14"
    },
    "company": {
        "name": "Paragon Hire",
        "link": "https://www.linkedin.com/company/paragon-hire"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}