{
    "job": {
        "title": "Sr. Site Reliability Engineer (100% Remote)",
        "industry": [
            "Hospital & Health Care"
        ],
        "description": "If you are a Site Reliability Engineer with experience, please read on!<br><br>We are a Healthcare company that works in the insurance space looking for Site Reliability Engineer to join our team. Due to the growth of our company we are needing an SRE that posses strong experience with designing, building, monitoring, and implementation.<br><br>If interested in joining a growing company that pushes the envelope in the healthcare insurance space, then apply immediately!<br><br><strong>This is a full-time/permanent position, direct-hire with my client.<br><br></strong>What You Will Be Doing<br><br>As a Site Reliability Engineer you will be focused on helping our company transition to modern processes that allow our services to perform to the best of its ability. You will be gathering requirements and managing the implementation while troubleshooting to resolve performance and reliability of our platform.<br><br>What You Need for this Position<br><ul><li> Python and Java</li><li> AWS, Azure, GCP</li><li> Linux</li><li> Effective communication both visual and verbal<br></li></ul>What's In It for You<br><ul><li> Medical, Dental, Vision</li><li> 401K</li><li> Fully Remote</li><li> Competitive Salary</li><li> &amp; More<br></li></ul>So, if you are a Site Reliability Engineer with experience, please apply today!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Devin.Bell@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DB13-1646926 -- in the email subject line for your application to be considered.***<br></li></ul>Devin Bell - Executive Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-22"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}