{
    "job": {
        "title": "Senior Software Engineer",
        "industry": [],
        "description": "Our client is looking for a competent analyst who is experienced in developing and maintaining software applications to improve maintain and help achieve business demands. The company provides very competitive compensation and benefits for employees. Moreover, the working environment is healthy and very encouraging for growth. Grab this spot and secure a bright future!<br><br>The key function of a Senior Programmer/Analyst<br><br>- to define, develop, test, analyze, and maintain new software applications in support of the achievement of business requirements.<br><br>Responsibilities to expect:<br><br>Collaborate with developers, programmers, and designers to conceptualize and develop new and existing software programs and applications<br><br>Scoping/estimating stories, and epics<br><br>Conduct research on emerging application development software products, languages, and standards in support of procurement and development efforts<br><br>Liaise with network administrators, systems analysts, and software engineers to assist in resolving problems with software products or company software systems - Drive test-first and behavior-driven development practices<br><br>Manage and/or provide guidance to junior team members<br><br>Other Duties as assigned<br><br>Requirements:<br><br>5 years of software development using OO such as Java or C#<br><br>Experience with agile methodologies, Scrum specifically<br><br>Desired: Tomcat, Spring, React, JQuery, Javascript, MySQL/Maria<br><br>Benefits:<br><br>Healthy environment<br>Full Healthcare Benefits – Medical, <br>Dental, Vision, Disability insurance<br>401K with company matching<br>PTO credits<br>Salary:  (DOE)<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09"
    },
    "company": {
        "name": "STAFF CX",
        "link": "https://www.linkedin.com/company/staffcx"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Solon",
        "region": "OH",
        "postal_code": "44139",
        "street_address": null,
        "latitude": 41.36921,
        "longitude": -81.4156
    }
}