{
    "job": {
        "title": "AI / Machine Learning Engineer (Virtual - Early Career)",
        "industry": [
            "Defense & Space"
        ],
        "description": "The Lockheed Martin Artificial Intelligence Center (LAIC) team is seeking an inquisitive developer responsible for investigating and implementing services that enhance MLOps deployment as a part of the AI Factory, an enterprise Machine Learning and Artificial Intelligence (ML/AI) platform. The selected candidate will focus on model test, optimization, monitoring, and explainability. The selected candidate will also contribute to a broad range of projects across the enterprise to increase machine learning availability and value to Lockheed Martin.<br><br><strong><u>The Selected Candidate’s Responsibilities Will Include<br></u></strong><ul><li> Identifying existing model test and deployment pain points</li><li> Researching, understanding, and evaluating third-party or in-house technology solutions</li><li> Developing relationships with third-party technology providers</li><li> Supporting evaluation initiatives by implementing and evaluating model test and monitoring software solutions</li><li> Collaborating with MLOps, data, and infrastructure teams</li><li> Presenting evaluation outcomes and recommend enterprise-wide solution next steps<br></li></ul>The selected candidate can work at any major Lockheed Martin facility or remotely (in the US). Must be a US Citizen.<br><br>--",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-11"
    },
    "company": {
        "name": "Lockheed Martin",
        "link": "https://www.linkedin.com/company/lockheed-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Fort Worth",
        "region": "TX",
        "postal_code": "76116",
        "street_address": null,
        "latitude": 32.749905,
        "longitude": -97.33034
    }
}