{
    "job": {
        "title": "Software Engineer (C++ Application)",
        "industry": [
            "Electrical/Electronic Manufacturing",
            "Information Technology and Services",
            "Staffing and Recruiting"
        ],
        "description": "<strong><u>Overview<br><br></u></strong>The Software Engineer will work with an experienced team of software, firmware, and hardware engineers to develop our Q-SYS platform. Q-SYS is a fast growing, award winning, software and hardware platform built on cutting-edge audio, video and control products. This position is based in Boulder, Colorado, with possibility of hybrid or fully remote work.<br><br>QSC thrives where innovative technology and compelling audio-visual experiences intersect. For over 50 years, QSC has pioneered the technology and solutions that enable immersive cinema, live performance audio, themed entertainment, digital collaboration and meeting experiences for our customers and partners around the world. A globally recognized innovator in the design, engineering, and manufacture of category leading high-performance loudspeakers, digital mixers, power amplifiers, audio processors, digital cinema solutions, and the Q-SYS™ software-based audio, video and control Ecosystem.<br><br>By joining the QSC team, you will be in a challenging, collaborative, fun, and innovative environment. We encourage employees to take ownership, to color outside the lines, and to imagine possibilities. Our culture is casual but dynamic, with cross-functional teams collaborating on creating memorable audio-visual experiences that deliver joy to people, wherever they are. At QSC, fun and hard work go hand in hand. Join us and make a difference in the way people experience movies, meetings, presentations, live performances, and much more.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Develop world-class software within the pro audio, video &amp; control industry </li><li> Develop C++ application software in Linux OS </li><li> Embedded systems/firmware design, implementation and deployment </li><li> Work with Software Quality Assurance to develop appropriate test strategies </li><li> Perform other duties as assigned <br></li></ul><strong><u>Qualifications<br></u></strong><ul><li> B.S. in Computer Science, Electrical Engineering, Computer Engineering or equivalent </li><li> 3 to 8 years of work experience in a software development environment </li><li> Experience in developing C++ application software in Linux OS </li><li> Experience with the features of modern C++ and its effective use in solving real-world problems </li><li> Experience with the best principles, practices, and patterns of software architecture and design </li><li> Embedded platform development experience </li><li> Must be able to take ownership of large portions of the software from a technical perspective </li><li> Must be self-motivated in order to achieve assigned objectives with minimal supervision </li><li> Proficiency in several of the following areas: </li><ul><li> Communications protocols </li><li> Web technologies </li><li> Computer security and data privacy </li><li> Streaming media protocols </li><li> Real-time embedded systems </li><li> High performance, distributed, or high availability systems </li><li> Unit testing</li></ul></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17"
    },
    "company": {
        "name": "QSC",
        "link": "https://www.linkedin.com/company/qsc-audio-products-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Boulder",
        "region": "CO",
        "postal_code": "80310",
        "street_address": null,
        "latitude": 40.016872,
        "longitude": -105.279625
    }
}