{
    "job": {
        "title": "Software Engineer (Remote to start)",
        "industry": [
            "Design",
            "Computer Software",
            "Internet"
        ],
        "description": "At Flylance, we have fun doing what we love by providing superb experience, speed, quality, and cost. We empower our Flylancers to take on challenging assignments and roles with an elevated level of responsibility in our agile working environment. Our people make us who we are, and we provide incredible service and experiences that empower us to think outside the box.<br><br>Check us out at www.flylance.com<br><br><strong><u>Requirements<br><br></u></strong>Our client's amazing Fixed Income Front Office technology team is looking for a software engineer to help build a suite of next-generation, cloud-native applications. In this role, you will engineer and develop new capabilities using modern cloud technologies for use by our Portfolio Managers and Quantitative Analysts.<br><br>This is a hands-on, full-stack role, providing opportunities to solve complex business and technical problems. You will be a key contributor throughout the entire product lifecycle, capable of working individually, or in collaboration with others.<br><br>You will work with smart, talented people across our business. We will expect you to be agile, show leadership, and think outside the box. In return, we’ll give you challenging work that has an impact, gives opportunities for you to learn and grow, and to do so in a collaborative, supportive environment.<br><br><strong><u>Top Skills<br></u></strong><ul> <li>Experience with asset management</li> <li>Strong programming in one or more languages <em>Python, Java, JavaScript</em> </li> <li>Knowledge of one or more relevant database technologies <em>SQL Server, Oracle, MongoDB, PostgreSQL</em> </li> <br><br></ul><strong>Core Attributes <br></strong><ul> <li>Takes pride in engineering excellence and instills these values in others</li> <li>Client-focused approach – delivering working code often</li> <li>Strong interpersonal skills; able to establish and maintain a close working relationship with portfolio managers, quantitative researchers, traders, senior business stakeholders, and other technologists </li> <li>A proponent of strong collaborative software engineering techniques and methods agile development, continuous delivery, code review or pairing, unit testing, refactoring, and related approaches </li> <li>Demonstrable passion for technology (e.g. personal projects, open-source involvement) while using their problem-solving capabilities to deliver solutions utilizing a top-end engineering approach</li> <li>A solid understanding of financial instruments (securities, derivatives), capital markets, specifically relating to Fixed Income and Asset Management. Experience working closely with front office business clients – e.g. Portfolio Managers, Quants, Traders, etc</li> <br><br></ul><strong><u>Technology Skills<br></u></strong><ul> <li>Knowledge of one or more programming languages <em> Python, Java, JavaScript</em> </li> <li>Proficient with a range of frameworks and development tools <em>Pandas, </em><em>React</em><em>, Node.js</em><em>, </em> </li> <li>Experience with a modern cloud stack, including containerization and serverless architectures</li> <li>Test-oriented mentality using appropriate tools and techniques TDD, BDD, Cucumber, Cyprus</li> <li>Knowledge of one or more relevant database technologies <em>SQL Server, Oracle, MongoDB, PostgreSQL, RedShifturu</em></li></ul>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-20"
    },
    "company": {
        "name": "Flylance",
        "link": "https://www.linkedin.com/company/flylance"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Baltimore",
        "region": "MD",
        "postal_code": "21226",
        "street_address": null,
        "latitude": 39.290443,
        "longitude": -76.612335
    }
}