{
    "job": {
        "title": "Senior Software Engineer (C++)",
        "industry": [],
        "description": "<p>CodeLathe is looking for a software engineer with a strong track record to join our dynamic client team to help us deliver world-class high-quality products to our customers. You will have the opportunity to work on innovative projects and applications focused on Enterprise File Sharing, Sync, backup software, and utilize your design skills, architecture skills, and solid development experience.<br><br><strong> <strong>About the Role:</strong><br></strong> </p><p><strong>As part of our client team, you will be responsible for developing our next generation of syncing and file-sharing software applications and delivering a maintainable solution optimized for usability and reliability. You’ll have the opportunity to work with multiple technologies and codebases, interact directly with our customers, and learn firsthand how they use our products.&nbsp;This role is remote and will require working remotely with other team members.</strong> </p><p><strong><br></strong> </p><strong><strong><br>Responsibilities:</strong></strong> <ul><li>Writing clean, high-quality, high-performance, maintainable code </li><li>Design and build software capable of running on all primary operating systems used by millions of users </li><li>Develop, maintain and support software including applications, interfaces, and new features </li><li>Troubleshoot and resolve reported customer issues quickly and permanently </li><li>Participate in code reviews, provide feedback, and help with the advancement of tools and processes </li></ul><p><br> </p><strong><strong>Required Qualifications:</strong></strong><ul><li>Bachelor’s or Master’s degree in computer science or related field </li><li>5+ years of software development experience. </li><li>Comfortable developing software for Windows, Linux, and MacOS </li><li>Strong experience with C++ </li><li>Strong knowledge of Web Technologies including HTTP protocol, XML, REST APIs </li><li>Strong knowledge of server-client architecture </li><li>Comfortable with Git version control system </li><li>Ability to multi-task, organize, and prioritize tasks while working independently or as part of the team </li></ul><p><br> </p><strong><strong>Desired Qualifications:</strong></strong><ul><li><p>Experience working with databases and filesystems is highly desired </p></li><li><p>Knowledge and experience practicing TDD or BDD using Catch or other testing frameworks </p></li><li><p>Experience working with the Electron and front-end technologies JavaScript, HTML and CSS </p></li><li><p>Experience with C#, Golang, or Python </p></li><li><p>Comfortable working with CI/CD systems, Docker and Jenkin </p></li></ul><p><br> </p><strong><strong>We Offer:</strong></strong><p>Become a part of a team of passionate, committed individuals dedicated to building a world-class product and personal growth </p><p>A competitive salary with an annual bonus </p><p>Full-time, fully remote work with flexible working hours </p><p>25 days of paid time-off and five company-wide holidays </p><p>Reimbursement of hardware, monthly internet connection cost, and weekly lunch </p>Company meet-ups in places around the world (planned to resume with a trip to Singapore in 2022!)<br><br><p><br> </p><p><br> </p><p>Sending a cover letter is optional. Compensation is based on experience.</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20"
    },
    "company": {
        "name": "FileCloud (CodeLathe Inc)",
        "link": "https://www.linkedin.com/company/codelathe"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Virginia",
        "region": "United States",
        "postal_code": "23038",
        "street_address": null,
        "latitude": 37.512905,
        "longitude": -78.697624
    }
}