{
    "job": {
        "title": "data scientist - Remote",
        "industry": [
            "Consumer Goods",
            "Food & Beverages",
            "Retail"
        ],
        "description": "<strong>Now Brewing - Data Scientist! #tobeapartner<br><br></strong>From the beginning, Starbucks set out to be a different kind of company. One that not only<br><br>celebrated coffee and the rich tradition, but that also brought a feeling of connection. We are known for developing extraordinary leaders who share this passion and are guided by their service to others.<br><br>As a Starbucks Data Scientist, you will build data products, uncover customer insights, &amp; communicate discoveries that drive towards better decisions across the Marketing &amp; Digital domains, and develop a strong partnership with stakeholders to enhance understanding of our customers.<br><br><strong><u>Leveraging Your Previous Experience, We Will Enable You To<br></u></strong><ul> <li>Evaluate &amp; translate unstructured questions from business teams to data problems, and define roadmap for potential data solutions.</li> <li>Work independently as well as part of cross-functional teams to build relevant analytics solutions using quantitative approaches.</li> <li>Drive adoption of analytics data products &amp; insights across business teams.</li> <li>Utilize systems thinking approach to conceive, plan &amp; build evergreen data products.</li> <li>Develop analytic systems &amp; predictive models, experiment with new data science techniques, and visualize data &amp; craft effective communications to share discoveries</li> <li>Establish key performance indicators for the business team and promote data driven decision making that allows for effective planning in stakeholder teams</li> <li>Establish yourself &amp; the team as subject matter experts in advanced analytics across departments</li> <li>Collaborate with other data scientists &amp; business teams across the Marketing &amp; Digital spaces to drive foundational understanding of the Starbucks digital experience</li> <br><br></ul><strong><u>We’d Love To Hear From People With<br></u></strong><ul> <li>Demonstrated experience with data munging, analysis, machine learning techniques &amp; visualization.</li> <li>Strong problem solving skills with ability to influence business teams at different levels</li> <li>Working knowledge of data systems design &amp; data technologies</li> <li>Knowledge of statistical methods &amp; scripting (SQL, Python or R)</li> <li>Retail, customer loyalty, and/or eCommerce experience</li> <br><br></ul>Join us and be part of something bigger. Apply today!<br><br>Starbucks is an equal opportunity employer of all qualified individuals, including minorities, women, veterans &amp; individuals with disabilities. Starbucks will consider for employment qualified applicants with criminal histories in a manner consistent with all federal, state, and local ordinances<br><br>Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at 206-318-0660 or via email at applicantaccommodation@starbucks.com<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-08"
    },
    "company": {
        "name": "Starbucks",
        "link": "https://www.linkedin.com/company/starbucks"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}