{
    "job": {
        "title": "Software Engineer - Payments",
        "industry": [
            "Internet"
        ],
        "description": "<strong><u>About Us<br><br></u></strong>Launched in 2011, Twitch is a global community that comes together each day to create multiplayer entertainment: unique, live, unpredictable experiences created by the interactions of millions. We bring the joy of co-op to everything, from casual gaming to world-class esports to anime marathons, music, and art streams. Twitch also hosts TwitchCon, where we bring everyone together to celebrate, learn, and grow their personal interests and passions. We’re always live at Twitch. Stay up to date on all things Twitch on LinkedIn , Twitter and on our Blog .<br><br><strong><u>About The Role<br><br></u></strong>Twitch is building the future of interactive entertainment, and our Commerce Engineering team is preparing to scale to work on essential product plans to support Bits, Subscriptions, Affiliates, Twitch Prime, and many great social interaction features.<br><br>As an important member of the engineering team reporting to a technical manager, you will have the opportunity to design and build solutions that affect millions of users and broadcasters.<br><br><strong><u>You Will<br></u></strong><ul><li>Work with technical leads and other engineers to design and develop commerce/payments platform and services</li><li>Contribute to customer-focused project deliveries</li><li>Work with other teams to clarify product requirements</li><li>Improve engineering processes and tools </li><li>Participate in design and code reviews</li></ul> <strong><strong>You Have:<br></strong></strong><ul><li>Minimum of Bachelor's degree in Computer Science or prior relevant engineering experiences</li><li> Strong understanding of data structures, algorithms, data modeling and schema design</li><li>1+ years as an software engineer</li><li>Proficient experience level in one or more of the following language: Go, Ruby, Java , C++ </li><li>Familiar with AWS ecosystem</li></ul> <strong><strong>Bonus Points<br></strong></strong><ul><li> Previous experience in commerce/payments domain</li><li>Twitch user, broadcaster, or partner or experience in the gaming industry</li></ul> <strong><strong>Perks<br></strong></strong><ul><li>Medical, Dental, Vision &amp; Disability Insurance</li><li> 401(k) , Maternity &amp; Parental Leave </li><li>Flexible PTO</li><li> Commuter Benefits </li><li>Amazon Employee Discount</li><li>Monthly Contribution and Discounts for Wellness Related Activities &amp; Programs (e.g., gym memberships, off-site massages),</li><li>Breakfast, Lunch &amp; Dinner Served Daily</li><li>Free Snacks and Beverages <br></li></ul>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.<br><br>We are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17"
    },
    "company": {
        "name": "Twitch",
        "link": "https://www.linkedin.com/company/twitch-tv"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}