{
    "job": {
        "title": "Software Engineer c# .Net (with Azure)",
        "industry": [
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<p><strong><u>Project Description:</u></strong></p><p><br></p><p>Tax and Accounting group within the client. The mission of this engagement is to improve reliability, availability and performance of the flagship produce - CCH Axcess.</p><p>Axcess is a product suite made out of number of products that serve the accounting clients. </p><p>The clients of company that use this product are the accountants and accounting firms.</p><p><br></p><p><strong><u>Responsibilities:</u></strong></p><p><br></p><ul><li>- Perform analysis and Design, transform high-level design into low-level design, and implementation.</li><li>- To collaborate with an agile team that is passionate about utilizing emerging technologies and delivering high quality and timely code.</li><li>- Good understanding and experience following design patterns, test-driven development and continuous integration practices</li><li>- Build automated, scalable services and systems to power our growing Azure cloud infrastructure</li><li>- Software prototyping and construction - Design, Build, and Modify existing business tier components, Web applications, and database objects using Microsoft platform technologies (.NET Web API) and Azure.</li><li>- Work with Quality Assurance Team on issue reporting, resolution, and change control</li><li>- Support and Troubleshooting - Assist Operations Team with any environment issues during application deployment across Development, QA, Staging, and Production environments.</li><li>- Assist other cross teams with troubleshooting problems that may arise from applications or integration of various components.</li></ul><p><br></p><p><strong><u>Skills Description:</u></strong></p><ul><li>C# .Net, ASP .Net, TFS, Git, Cloud Experience (Azure, GCP, AWS), Solid experience building REST APIs</li></ul><p></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24"
    },
    "company": {
        "name": "Luxoft",
        "link": "https://ch.linkedin.com/company/luxoft"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}