{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": [],
        "description": "<p>Description</p><p>EnsoData seeks to recruit, hire, and retain the most talented people from a diverse candidate pool. We strongly encourage folks of all backgrounds to apply. To learn more about our ongoing commitment to diversity, check&nbsp;here&nbsp;for quarterly updates.</p><p><br></p><p>EnsoData, a fast growing, venture-backed startup based in Madison, WI, is seeking an experienced candidate for the position of AI &amp; Machine Learning Engineer, a fundamental part of the EnsoData technology team that will take ownership of critical AI/ML development initiatives, design and implement ML systems built on terabytes of health data that power core EnsoData products and services, and delight live healthcare customers with the very best performance achievable.</p><p><br></p><p>Our goal at EnsoData is to provide artificial intelligence powered software services that create massive cost and time savings for frontline clinicians, allowing them to spend more time with patients and less time with data; improving both patient and provider satisfaction, and patient outcomes. Our first product, EnsoSleep, uses our machine learning engine with Big Sleep Data to save clinicians hundreds of hours per month by automating one of the most arduous and repetitive data annotation tasks in all of healthcare - sleep study scoring.</p><p><br></p><p>The role:</p><ul><li>Perform research to make machine learning solve impactful issues in healthcare.</li><li>Provide research input on healthcare problems: evaluate scope of the problem, the best place to apply machine learning, and evaluate different approaches.</li><li>Collaborate with multi-displinary team of software engineers and clinicians to design and run experiments, including designing and evaluating new algorithms as well as implementing known algorithms.</li><li>Report and present experimental results and research findings clearly and efficiently, both internally and externally.</li><li>Engage as members of the applied research community, by validating and contributing to advances in ML.</li><li>Implement distributed training processes leveraging the world's largest computational accelerators (GPU+TPU).</li></ul><p>Requirements</p><p>Minimum qualifications:</p><ul><li>BS in computer science, engineering, or a related discipline.</li><li>Solid software engineering skills for prototyping.</li><li>Experience implementing and validating machine learning models</li><li>Good knowledge of algorithm design.</li><li>Personal qualities of integrity, perseverance, and commitment to the mission at EnsoData</li></ul><p>Preferred qualifications:</p><ul><li>MS/PhD in computer science, engineering, or a related discipline.</li><li>Experience in applying ML to real world problems.</li><li>Strong expertise in deep learning.</li><li>Publication track record in machine learning and healthcare conferences and/or journals.</li><li>Competent in python and modern deep learning libraries (tensorflow,keras)</li><li>A real passion for AI</li></ul><p>Culture:</p><ul><li>Gets things done</li><li>Goes above and beyond</li><li>Doesn’t cut corners</li><li>Shares knowledge</li><li>Spreads good vibes</li><li>Delights customers</li></ul><p><br></p><p>Benefits</p><p>In addition to a competitive salary ($100k-$150k), equity in a high-growth startup, and standard benefits including health care, you will have a transformative impact on company culture and success. In this position, you will have the opportunity to grow personally and professionally to help build a world-class data science team, own critical EnsoData R&amp;D initiatives, and serve as a key member of the EnsoData technical leadership team.</p><p><br></p><p>Remote Work</p><p>EnsoData supports both fully remote and local employees! Expectations for employment are 40 hours/week. Our headquarters are located in Madison, WI but you can live anywhere with US work visa!</p><p><br></p><p>Recruiting Process</p><p>We have a simple, concise, and effective recruiting process to find the most qualified and best fit for our team:</p><ol><li>Initial phone screen with Sam Rusk, Co-founder and Head of AI</li><li>Take home technical evaluation (2-4 hours est time)</li><li>Technical interview with our AI Team (1 hour) to review technical evaluation and evaluate other technical knowledge.</li><li>Job Offer!</li></ol><p><br></p><p>Diversity, Equity, and Inclusion</p><p>Research shows that while men apply to jobs when they meet an average of 60% of the criteria, women and other marginalized folks tend to only apply when they check every box. If you think you’re a great fit, but don't necessarily check every box on the job description, please still get in touch.</p><p>Apply for this job</p><p><br></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14"
    },
    "company": {
        "name": "EnsoData",
        "link": "https://www.linkedin.com/company/ensodata"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Madison",
        "region": "WI",
        "postal_code": "53706",
        "street_address": null,
        "latitude": 43.073925,
        "longitude": -89.38525
    }
}