{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": [
            "Information Technology and Services"
        ],
        "description": "<p><strong>Site Reliability Engineer- Salesforce</strong></p><p><strong>Raritan, NJ</strong></p><p><strong>Contract</strong></p><p>&nbsp;</p><p>As the Site Reliability Engineer, you will be supporting a Fortune 50 organization to better run production systems. You will work directly with your team to help automate customer solutions and drive change to promote a more reliable Salesforce platform process.</p><p>&nbsp;</p><p><strong><u>REQUIREMENTS</u></strong></p><ul><li>Bachelor’s Degree in Computer Science or related technical field</li><li>Minimum of 5 years of experience within site reliability engineering</li><li>Experience within technologies in the commercial Customer and Sales stack (Salesforce, Veeva and/or Mulesoft)</li><li>Experience with algorithms, data structures and data analysis</li><li>Ability to debug and optimize code and automate routine tasks</li><li>Ability to build, foster and handle partner &amp; customer relationships</li><li>Extensive Salesforce experience preferred</li></ul><p><strong>&nbsp;</strong></p><p><strong><u>RESPONSIBILITIES</u></strong></p><ul><li>Work to keep revenue and reputation-critical systems up and running</li><li>Measure and monitor availability, performance, and overall health systems</li><li>Assist architects and developers to help automate customer issues and drive solutions to build more reliable Commercial Application solutions</li><li>Build, fix and extend business critical code to improve automation</li><li>Evolve systems by suggesting and implementing changes that approve reliability and velocity</li><li>Develop software platforms, frameworks, and Production Readiness reviews</li></ul><p>&nbsp;</p><p><strong>&nbsp;<u>What's in it for you?</u></strong></p><ul><li>Working for an international Fortune 50 company</li><li>Access to cutting edge technologies in an enterprise environment</li><li>Exposure to high-level business professionals in a variety of departments</li><li>Play a part in the growth and expansion of a major initiative impacting multiple business units</li><li>Weekly Paychecks</li></ul>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-10"
    },
    "company": {
        "name": "Brooksource",
        "link": "https://www.linkedin.com/company/brooksource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New Jersey",
        "region": "United States",
        "postal_code": "08810",
        "street_address": null,
        "latitude": 40.139095,
        "longitude": -74.67851
    }
}