{
    "job": {
        "title": "Software Engineer I",
        "industry": [
            "Hospital & Health Care"
        ],
        "description": "Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals, and branded generic medicines. Our 109,000 colleagues serve people in more than 160 countries.<br><br><strong><u>Software Engineer I – St Paul (Little Canada) Tech Center<br><br></u></strong>Join a dynamic and motivated team at Abbott Electrophysiology (EP), developing medical products that set the bar for clinical excellence and efficient workflow. Our products provide cutting edge, advanced software to enable 3D cardiac models which help in diagnosing and treating cardiac disease. As a member of the software development team you will help take these products to the next level and reduce cost, improve quality, increase access. The Software Engineer I contributes to all phases of the software lifecycle, including concept development, requirements, design, implementation, and testing.<br><br><strong><u>Primary Duties And Responsibilities<br></u></strong><ul><li>Write well-designed, testable code</li><li>Develop Machine learning capabilities for recognizing and analyzing cardiac images</li><li>Work closely with cross-functional teams in Systems and hardware/firmware to develop optimal solutions combining software and embedded software on FPGA’s</li><li>Integrate software components into functional software system</li><li>Develop graphical user interface components</li><li>Develop manual and automated tests for software verification as needed</li><li>Develop and maintain documentation to identify design, requirements, and solutions</li><li>Utilize your familiarity with all aspects of Software Development Life Cycle and methodologies</li><li>Communicate effectively both within immediate team and across the program and business leadership team<br></li></ul><strong><u>Required Qualifications<br></u></strong><ul><li>B.S. in Computer Engineering, Computer Science, Electrical Engineering, Computer Systems Engineering, Software Engineering, or related discipline.</li><li>Excellent C++/C#/Java knowledge<br></li></ul><strong><u>Preferred<br></u></strong><ul><li>Master’s Degree in Engineering (Computer, Electrical, Computer Systems, or Software), Computer Science, or related discipline / Advanced degree may substitute for up years of experience</li><li>2+ months of software engineering design.</li><li>Excellent documentation skills</li><li>Strong understanding of the hardware/software interface</li><li>Experience working in a Linux environment</li><li>Experience working in a regulated environment (preferably medical)</li><li>Strong oral and written communication skills</li><li>Strong interpersonal skills</li><li>Software development tool experience such as Perforce, Jira, Jenkins<br></li></ul><strong><u>What We Offer<br><br></u></strong>At Abbott, you can have a good job that can grow into a great career. We offer:<br><ul><li>Training and career development, with onboarding programs for new employees and tuition assistance and student loan repayment program</li><li>Student Loan Repayment Assistance</li><li>Financial security through competitive compensation, incentives, and retirement plans </li><li>Health care and well-being programs including medical, dental, vision, wellness and occupational health programs </li><li>Paid time off </li><li>401(k) retirement savings with a generous company match </li><li>The stability of a company with a record of strong financial performance and history of being actively involved in local communities <br></li></ul><strong><em>Learn more about our benefits that add real value to your life to help you live fully:  </em></strong><em>www.abbottbenefits.com<br><br></em><em>Follow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity.<br><br></em><em>Connect with us at </em><em>www.abbott.com</em><em>, on Facebook at </em><em>www.facebook.com/Abbott</em><em> and on Twitter @AbbottNews and @AbbottGlobal.</em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-14"
    },
    "company": {
        "name": "Abbott",
        "link": "https://www.linkedin.com/company/abbott-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Minneapolis–Saint Paul",
        "region": "MN",
        "postal_code": "56304",
        "street_address": null,
        "latitude": 44.95,
        "longitude": -93.2
    }
}