{
    "job": {
        "title": " Encroachment/Right of Way Inspector ",
        "industry": [
            "Utilities"
        ],
        "description": "<p>We are currently seeking an&nbsp;<strong>Encroachment/ROW Inspector</strong>&nbsp;to join our team.&nbsp;The ideal candidate would be familiar with Utility Vegetation Management, enjoys a mix of work from home and fieldwork, is a self-starter, and values the freedom of working independently.&nbsp;If you enjoy a fast-paced environment and the challenges of a rewarding profession, consider a career with ECI.&nbsp;&nbsp;<strong>This role typically requires 75% work from home and 25% fieldwork but is subject to change based on work requirements on any given day.</strong></p><p>During these uncertain times, you can take pride in knowing you are an&nbsp;<strong><em>essential</em></strong><em>&nbsp;</em><strong><em>employee</em></strong>. Our team members work independently and follow all CDC recommended guidelines and company safety protocols relevant to COVID-19.</p><p>Some of the most important characteristics of&nbsp;<strong>ECI</strong>&nbsp;<strong>Encroachment/ROW Inspector</strong>&nbsp;is that you are open-minded and able to engage in safe, constructive interactions with the public. You are accountable for advancing a culture of safety and excellence while providing quality and value to our customers and clients.</p><p><br></p><p><strong>WHAT WE OFFER:</strong></p><ul><li>Industry competitive pay.</li><li>Company vehicle with a fuel card to take to and from home &amp; work.</li><li>Medical/Health/Dental/Vision/Life Insurance, effective Day 1 for full-time team members.</li><li>401K eligibility.</li><li>Paid Holidays, Vacation, and Sick Leave.</li><li>Weekly paychecks and direct deposit.</li><li>Participation in Employee Referral Program (must meet eligibility requirements).</li><li>Boot and clothing program (company-funded).</li><li>Ongoing training and assistance with obtaining industry certifications.</li></ul><p><br></p><p><strong>WHAT YOU WILL DO:</strong></p><ul><li>Resolve encroachment issues by building trust with landowners and internal stakeholders.</li><li>Manage one or more concurrent projects spread across different geographical locations.</li><li>Read and interpret transmission construction engineering plans.</li><li>Negotiate landowner encroachment agreements.</li><li>Maintain detailed records.</li><li>Execute memorandum of understanding (MoU) with landowners.</li><li>Communicate daily with the utility client, contractors, landowners, and the general public.</li><li>Perform duties in a manner that will promote and maintain good public relations and work safety practices.</li><li>Assume other duties and responsibilities as assigned.</li></ul><p>&nbsp;</p><p><strong>WHAT YOU NEED TO HAVE:</strong></p><ul><li>Ability to understand and interpret engineering plans.</li><li>Strong negotiation skills are a must.</li><li>Must be able to work alone, outdoors in various weather conditions and terrain.</li><li>Must have exceptional interpersonal and communication skills, strong problem solving and multi-tasking abilities, and demonstrated attention to detail.</li><li>Must be able to adapt to change.</li><li>Must have basic computer skills.</li></ul><p><strong>&nbsp;</strong></p><p><strong>WHAT WOULD BE AMAZING TO HAVE:</strong></p><ul><li>A degree in Forestry, Engineering, or related field is a plus.</li><li>Prior utility or utility vegetation management (UVM) or related fieldwork experience is a plus.</li><li>Previous project management experience is desired.</li><li>ISA Arborist Certification preferred</li><li>&nbsp;Bi-Lingual (Spanish) is a plus.</li></ul><p>&nbsp;</p><p><strong>Physical</strong></p><p>Fieldwork can require extended periods of time driving to the worksite and accessing encroachments and/or property owner residences.</p><p><strong>&nbsp;</strong></p><p><strong>Company Overview</strong></p><p>Environmental Consultants (ECI) is a leading provider of vegetation and asset management consulting services to the utility industry. Successful professionals at ECI have come from a variety of backgrounds, including: forestry, arboriculture, natural resource management, biology, landscape maintenance, horticulture, nursery management, environmental sciences, geology, agriculture, parks &amp; recreation management, urban forestry, geography, and more.&nbsp;ECI offers exciting career opportunities with an excellent compensation package and ongoing growth potential.</p><p><strong>Applicants must pass a pre-employment drug test and a criminal background check.</strong></p><p><strong>All candidates must possess a valid driver's license and have a good driving record.</strong></p><p><strong>ECI is an Equal Opportunity and Affirmative Action Employer. EOE/AA : Minority/Female/ Vets/ Disabled.</strong></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Environmental Consultants (ECI)",
        "link": "https://www.linkedin.com/company/environmental-consultants-inc"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Asheville",
        "region": "NC",
        "postal_code": "28805",
        "street_address": null,
        "latitude": 35.595913,
        "longitude": -82.55004
    }
}