{
    "job": {
        "title": "Sr. Software Engineer",
        "industry": [
            "Financial Services",
            "Information Technology and Services"
        ],
        "description": "Every day, Global Payments makes it possible for millions of people to move money between buyers and sellers using our payments solutions for credit, debit, prepaid and merchant services. Our worldwide team helps over 3 million companies, more than 1,300 financial institutions and over 600 million cardholders grow with confidence and achieve amazing results. We are driven by our passion for success and we are proud to deliver best-in-class payment technology and software solutions. Join our dynamic team and make your mark on the payments technology landscape of tomorrow.<br><br><strong><u>Primary Responsibilities<br></u></strong><ul><li> Help maintain and extend existing applications written in Laravel 5/6/7, MySQL, Vue &amp; jQuery</li><li> Develop and maintain publicly consumable packages to make it easy to integrate to our services </li><li> Architect and evolve evergreen projects using the latest versions of Laravel and Vue <br></li></ul><strong><u>Required Skills/Knowledge<br></u></strong><ul><li> Extensive experience with PHP &amp; Laravel 5.x and greater. </li><li> Experienced in designing and maintaining MySQL databases </li><li> Experience with testing and test-driven workflows (PHPUnit) </li><li> Working with Git (Github) and common Git based workflows </li><li> Advanced knowledge building RESTful APIs </li><li> Comfortable developing in a Linux environment </li><li> Motivated to contribute and release to open source software </li><li> Comfortable in a fast paced, evolving environment </li><li> Hands on, passionate and persistent </li><li> Extremely comfortable with CLIs </li><li> Strong JS skillset (Vue or React, Vanilla, ES6/7) </li><li> Strong desire to evolve, progress, learn, and collaborate <br></li></ul><strong><u>Bonus Skills/Knowledge<br></u></strong><ul><li> Docker </li><li> AWS/Vapor </li><li> Active and involved with the Laravel community </li><li> Experience in the payment acceptance industry </li><li> Familiar with PCI DSS <br></li></ul><strong><u>Benefits<br></u></strong><ul><li> The chance to make a huge impact on a business </li><li> Direct involvement in all aspects of the product’s development </li><li> Ability to work on a forward focused tech-stack </li><li> Competitive salary, based on experience. </li><li> 401K </li><li> Health/Dental/Vision Insurance <br></li></ul>Global Payments Inc. is an equal opportunity employer.<br><br>Global Payments provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex (including pregnancy), national origin, ancestry, age, marital status, sexual orientation, gender identity or expression, disability, veteran status, genetic information or any other basis protected by law. Those applicants requiring reasonable accommodation to the application and/or interview process should notify a representative of the Human Resources Department.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15"
    },
    "company": {
        "name": "Global Payments Inc.",
        "link": "https://www.linkedin.com/company/global-payments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Michigan",
        "region": "United States",
        "postal_code": "48832",
        "street_address": null,
        "latitude": 44.874798,
        "longitude": -85.73098
    }
}