{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Financial Services"
        ],
        "description": "<strong>Description<br><br></strong><strong>Company Overview<br><br></strong>Shamrock Trading Corporation is the parent company for a family of brands in transportation services, finance and technology. Headquartered in Overland Park, KS, Shamrock has consistently been named “Best Places to Work” by the <em>Kansas City Business Journal.</em> We also have offices in Chicago, Dallas, Laredo, Midland, Nashville, and Atlanta.<br><br>With an average annual revenue growth of 25% since 1986, Shamrock’s success is attributed to three key factors: hiring the best people, cultivating long-term relationships with our customers and continually evolving in the marketplace.<br><br><strong>Responsibilities<br><br></strong>Shamrock Trading Corporation is looking for a Site Reliability Engineer to join the Development team. The Site Reliability Engineer will focus on collaborating with software developers and other IT staff members to design new internal solutions that increase operational efficiency. An ideal candidate will be a detail-oriented problem solver with proven experience. The Site Reliability Engineer should be familiar with multiple CI/CD processes and tools and be able to guide developers in the SDLC.<br><ul><li>Design and implement deployment pipelines </li><li>Monitor, troubleshoot, and upgrade database servers (Mongo, Postgres, SQL Server) </li><li>Partner with internal service owners and teams to evaluate technical data, plan and execute service upgrades and changes </li><li>Develop tools and solutions to increase the operational efficiency of the Development Team with a focus on building strong working relationships </li><li>Monitor mission critical systems, creating alerts on performance metrics to identify resource constraints </li><li>Act as Subject Matter Expert for cloud infrastructure, guiding the Development Team using best practices <br><br></li></ul><strong>Qualifications<br></strong><ul><li>Bachelor’s degree in computer science, engineering or a related technical field, or equivalent practical experience </li><li>Experience with cloud-based infrastructure (e.g. AWS, GCP, Azure) </li><li>Experience in automation with scripting or programming languages (e.g. Bash, Python, Java, JavaScript) </li><li>Familiar with the system administration of various operating systems (e.g. Linux, macOS, iOS, Android, Windows) </li><li>Knowledge of networking and web standards (e.g. DNS, DHCP, TCP/IP, HTTP, web security mechanisms, proxies, firewalls, load balancers) </li><li>Systematic problem-solving approach coupled with a strong sense of ownership and drive</li><li>Adaptable to changing priorities</li><li>Ability to prioritize work effectively </li><li>Strong communication and leadership skills </li><li>Preferred but not required qualifications include: </li><li>Experience building and deploying products in AWS </li><li>Experience with deployment and orchestration technologies (e.g. Docker, Kubernetes, OpenStack, Puppet, Chef, Gradle) </li><li>Experience with continuous integration systems and build and deployment automation (e.g. Jenkins, CodeBuild, CodeDeploy) </li><li>Strong understanding of complex IT infrastructure and ability to troubleshoot issues </li><li>Understanding of IT change management best practices </li><li>Ability to make progress when high ambiguity and uncertainty exist<br><br></li></ul><strong>Benefits Package<br><br></strong>At Shamrock we hire bright, ambitious people and give them the tools they need to be successful. By investing in training and development, we hope to become a long-term career for employees, where there are always opportunities for advancement. Shamrock also offers a premier set of benefits for employees and their families:<br><ul><li>Medical: Fully-paid healthcare, dental and vision premiums for employees and eligible dependents </li><li>Financial: Generous company 401(k) contributions and employee stock ownership after one year </li><li>Wellness: Onsite gym, jogging trail and discounted membership to nearby fitness center </li><li>Work-Life Balance: Competitive PTO and paid leave options</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18"
    },
    "company": {
        "name": "Shamrock Trading Corporation",
        "link": "https://www.linkedin.com/company/shamrock-trading-corp-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Overland Park",
        "region": "KS",
        "postal_code": "66214",
        "street_address": null,
        "latitude": 38.97482,
        "longitude": -94.6836
    }
}