{
    "job": {
        "title": "Software Test Engineer with Sign-On Bonus",
        "industry": [
            "Computer Networking",
            "Computer Software",
            "Computer & Network Security"
        ],
        "description": "<strong><u>Why APCON<br><br></u></strong>At APCON, we bring enthusiasm, passion, and dedication every day to building products that provide visibility into network data. Organizations ranging from midsize companies to Fortune 100 enterprises rely on APCON to achieve total visibility of their physical, private, and cloud environments. With APCON’s stable, scalable technology, IT professionals know they can monitor, secure, and protect their networks.<br><br><strong><u>Purpose Of Job<br><br></u></strong>The Software Test Engineer will be responsible for the testing and validation of APCON’s industry leading suite of network monitoring solutions.<br><br><strong><u>Responsibilities<br></u></strong><ul><li>Responsible for software testing and validation of APCON’s industry leading suite of network monitoring solutions</li><li>Writes novel and creative test cases using best industry practices</li><li>Manually executes non-automated test cases</li><li>Assists development on bug fixes, bug isolation, and resolution</li><li>Delivers timely verification of fixes in response to generation of bugs</li><li>Advocates, develops, and deploys new testing/automation tools and concepts<br><br></li></ul><strong><u>Qualifications And Requirements<br></u></strong><ul><li>2+ years in a software/hardware test engineering role</li><li>Testing experience with IP networking, routing or switching technologies</li><li>Hands-on engineering lab experience testing hardware or software</li><li>Experience in formal software testing methodologies, including software development cycles, testing processes and standards</li><li>Familiar with defect and test case tracking tools</li><li>Testing experience with embedded Linux systems</li><li>Experience developing Python automated scripts (preferred)</li><li>Familiarity with Selenium automation framework (preferred)</li><li>Possess a willingness and ability to adapt to new processes, ideas, and concepts<br><br></li></ul><strong><u>Core Competencies<br></u></strong><ul><li>Strong interpersonal skills; ability to communicate professionally across the organization</li><li>Excellent organizational, planning, presentation, troubleshooting, and multi-tasking skills</li><li>Ability to maintain a high level of confidentiality and professionalism</li><li>Strong attention to detail and exceptional customer support</li><li>Proficient in Microsoft Office Suite</li><li>Must be able to work independently and as a team member</li><li>Ability to prioritize and be flexible in a fast-paced environment<br><br></li></ul><strong><u>Education<br></u></strong><ul><li>Bachelor’s Degree preferred and/or equivalent in training and experience<br><br></li></ul><strong><u>Benefits<br></u></strong><ul><li>Sign-On Bonus (Terms and Conditions Apply)</li><li>Medical, dental and vision insurance</li><li>Company-paid short and long term disability </li><li>Flexible spending accounts</li><li>Healthy work-life balance and generous paid time off program</li><li>Retirement savings match</li><li>Professional development program</li><li>Volunteer time off and employee assistance plan</li><li>Collaborative and innovative work environment</li><li>On-site exercise facility<br><br></li></ul><strong><u>Physical Requirements<br></u></strong><ul><li>To perform the duties of this position, you must have the ability to occasionally sit, stand, bend, twist, reach, carry, lift, pull, and push between 1-15 lbs.<br></li></ul><em>APCON is a drug-free workplace and EEO Employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity, religion, natural origin, disability, veteran status, age, marital status, pregnancy, genetic information, or </em><em>other</em><em> legally protected status. Offers are contingent on the successful completion of </em><em>pre-employment</em><em> drug and background screenings. Please note that we follow Federal Guidelines regarding prohibited substances, even for those legal at the state level.</em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-23"
    },
    "company": {
        "name": "APCON",
        "link": "https://www.linkedin.com/company/apcon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}