{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": [
            "Staffing and Recruiting"
        ],
        "description": "<p>We are hiring a Machine Learning Engineer to join one of the largest global financial service firms in the world. If you are a Machine Learning Engineer looking to leverage your past experience than please look below. We are located in Jersey City (although we are remote at this time).</p><p><br></p><p><strong>What Is The Job?</strong></p><p>As a Machine Learning Engineer ( keep in mind this is a Data Engineer position first Machine Learning is secondary), you will be working on the companies new Asset Wealth Management AI team to develop high impact AI applications and platforms in the financial services industry. You will design and implement highly scalable data processing pipelines and perform analysis and insights to drive and optimize business results, as well as&nbsp;experiment, develop and productionize high quality machine learning models.</p><p><br></p><p><strong>What Skills Do We Need?</strong></p><ul><li>You are a Data Engineer with Machine Learning Experience&nbsp;</li><li>Python and AWS</li><li>Experience in ETL data pipelines both batch and real-time data processing, Data warehousing</li><li>MS or PhD in Computer Science, Statistics, or Mathematics</li><li>Excellent communication skills</li></ul><p><br></p><p><strong>Nice To Haves:</strong></p><ul><li>Machine Learning Engineering Experience</li><li>R</li></ul><p><br></p><p><strong>Who Are We?</strong></p><p>We are a top-tier global financial services firm with assets of $2 trillion and operations in more than 60 countries. We are a leader in investment banking, financial services for consumers, small business and commercial banking, financial transaction processing, asset management, and private equity.</p><p>The team works in our state-of-the-art, open workspace office in Jersey City. We value teamwork and pride ourselves as an ego-free culture.</p><p><br></p><p><strong>Compensation:</strong></p><ul><li>$170,000 - $200,000 base salary</li><li>Bonus</li><li>Full medical</li><li>Full Dental</li><li>401k</li></ul><p><br></p><p><strong>Whats in it for you?</strong></p><p>This is an opportunity to work for one of the world best financial firms. This opportunity offers a path to quick growth within the company, while working on some of the most cutting edge projects within the company.</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20"
    },
    "company": {
        "name": "Averity",
        "link": "https://www.linkedin.com/company/averity"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Jersey City",
        "region": "NJ",
        "postal_code": "07306",
        "street_address": null,
        "latitude": 40.717495,
        "longitude": -74.04411
    }
}