{
    "job": {
        "title": "Machine Learning Engineer- Deep Learning - RELOCATION OFFERED!",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Financial Services"
        ],
        "description": "Do you have Deep Learning experience?<br><br>Are you experienced with Neural Networks?<br><br>Do you have Tensorflow experience?<br><br>If you said yes to the above questions, keep reading!<br><br>We are a new, well-funded startup in West Hollywood, CA, using Deep Learning to solve longstanding problems in the biology field.<br><br>We are looking to bring on a Machine Learning Engineer with Deep Learning experience to our team ASAP!<br><br>--WE WILL RELOCATE THE RIGHT CANDIDATE!--<br><br>What You Need for this Position<br><ul><li> MS or PhD in Computer Science, Computer Vision, ML, or related field</li><li> Deep Learning Experience</li><li> Neural Networks (CNN, General Adversarial, or Autoencoders)</li><li> Tensorflow<br></li></ul>Plus Skills! (not required)<br><ul><li>RNN</li><li>Reinforcement Learning</li><li>Biology/Medical Related Skill Set<br></li></ul>So, if you are a Machine Learning Engineer with Deep Learning and Tensorflow experience, please apply today!<br><br>Or, send your resume directly to rajeev.peterson@Optello.com<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Nitu.Gulati-Pauly@Optello.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SC4-1395735 -- in the email subject line for your application to be considered.***<br></li></ul>Nitu Gulati-Pauly - VP of Recruiting - Optello<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>Optello is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.<br><br>Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "West Hollywood",
        "region": "CA",
        "postal_code": "90069",
        "street_address": null,
        "latitude": 34.090683,
        "longitude": -118.37175
    }
}