{
    "job": {
        "title": "Software Engineer (aka AWS DevOps/API Developer) -- REMOTE",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Financial Services"
        ],
        "description": "<strong><u>Job Description<br><br></u></strong><strong>AWS DevOps Engineer / API Developer<br><br></strong><strong>Job Type:</strong> Direct-hire<br><br><strong>Location: </strong>This role is US based remote or Chicago area only.<br><br><strong>About:</strong> In this role, you would support our client' s AWS Environment in delivering our AWS Well-Architected Framework to support our customers’ success. The bottom line at the top - we make the world a better place with the tools we build. Would you like to join us and help by building and deploying our AWS environment?<br><br><strong>Let' s define \" Software Engineer\" as we see it. You love to and are great at:<br></strong><ul><li>Conducting Systems Operations on AWS </li><li>Coding in .NET / NodeJS / JavaScript and deploying to the AWS environment.</li><li>C++, Linux</li><li>Creating API platforms using REST and API Gateway, experience with different styles or flavors - a plus on API designs with microservices and Serverless environments</li><li>Agile Development Methodology</li><li>Unit testing, debugging, and documenting API or Source code.</li><li>And a good amount of the things in the “ What you bring to the team” section below… so keep reading! <br></li></ul><strong>Now that you know what we’ re looking for. Let’ s speak about what you’ re looking for. Do you...?<br></strong><ul><li>Want to contribute and have a voice at the company that just beat Google and Adobe for “ Best Emerging Technology” at the 2021 Codie Awards?</li><li>Are you ready to build and manage an ENTIRE AWS INFRASTRUCTURE from code to our large deployment?</li><li>Desire to use your brilliant engineering skills to implement not just good products but products that do good?</li><li>Thrive in environments where accountability is prioritized and would love to own the output for a whole team?</li><li>See into the future to understand what structures we need to build now for our future to serve the future?</li><li>Want to work in an environment where you talk and problem solve with other teams?</li><li>Invest in tomorrow, today, by fixing tomorrow’ s problems, yesterday?</li><li>Believe in the value of documentation - and kinda love it?<br></li></ul><em>If you answered yes to those questions - this might be the role for you.<br><br></em><strong><u>What You Bring To The Team<br></u></strong><ul><li>Years working as a hands-on developer</li><li>You might have had one of these titles in the past: AWS DevOps Engineer, API Developer</li><li>Use of AWS CloudFormation and AWS OpsWorks</li><li>Hands-on experience using both the AWS Management Console and the AWS Command Line Interface (AWS CLI)</li><li>.Net is a bonus!</li><li>Bring a good amount of the stuff listed in our definition of an Lead Software Engineer (above)</li><li>Anecdotally, we once had a developer turn down a role because they wanted to keep working in Azure and not work in AWS. If you’ d turn down a role of work Azure to keep working in AWS - you might be a fit!<br></li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18"
    },
    "company": {
        "name": "Talution Group",
        "link": "https://www.linkedin.com/company/talution-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}