{
    "job": {
        "title": "Software Engineer",
        "industry": [],
        "description": "<p>Option Pool Exchange is a Crypto Futures Exchange with a cumulative trading volume of $7.5 billion USD. We offer x7000 times leveraged products and have recently issued our own Rich Otter token, a tokenized insurance fund for our Crypto Derivative Exchange.</p><p><br></p><p>We are currently in the process of relocating our headquarter to New York City, and thus we are looking for software engineers to work at our New York City office. This job offer is on a rolling basis and may close at any time whenever we find the right candidates. </p><p><br></p><p>&nbsp;</p><p><strong>Job description</strong></p><ul><li>Full-time, office in midtown manhattan</li><li>$110-220K depending on your market rate (includes stock options &amp; bonus)</li><li>Designing highly scalable codes that can handle millions of transactions per second</li><li>Meticulous research and development on ultra-low latency applications </li></ul><p>       (we care about microsecond level latency, which is one-millionth of a second)</p><p><br></p><p>We don't micromanage our employees, thus you must be highly self-motivated to be successful at our organization.</p><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree or higher in Computer Science or related field </li></ul><p>        (graduate degree highly preferred)</p><ul><li>At least +3 years of commercial application development experience</li><li>Fluency in the following tools: GO, PostgreSQL, Node.js, AWS, EC2, S3, RDS</li><li>US work authorization (visa sponsorships will not be generally considered)</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30"
    },
    "company": {
        "name": "OPTION POOL",
        "link": "https://www.linkedin.com/company/option-pool"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}