{
    "job": {
        "title": "Software Engineer I",
        "industry": [
            "Internet"
        ],
        "description": "Expected compensation: $52.00 - $59.00 per hour<br><br>HireArt is helping the world’s largest social network find a Software Engineer to join the test infrastructure team for one of its flagship devices.<br><br>In this role, you’ll maintain automation and lab environments related to the device, as well as work with its upcoming prototypes.<br><br><strong><u>As a Software Engineer, You Will<br></u></strong><ul><li>Modify existing databases and database management systems.</li><li>Write/code logical and physical database descriptions and specify identifiers of the database to the management system (or direct others in coding descriptions).</li><li>Work as part of a project team to coordinate database development and determine project scope and limitations.</li><li>Review project requests describing database users’ needs in order to estimate time and cost required to accomplish projects.<br></li></ul><strong><u>Requirements<br></u></strong><ul><li>Bachelor's in computer science, software engineering, or relevant field</li><li>1+ years experience as a software engineer or in relevant role</li><li>Proficiency with Python</li><li> Knowledge of computer development software as it relates to systems (e.g. SQL, VisualBasic, etc.)</li><li>Basic knowledge of the full software development lifecycle (i.e. business/systems analysis, requirements gathering, functional specification authoring, development, testing, and delivery)</li><li> Basic knowledge of computer hardware and software</li><li>Verbal/written communication, problem solving, customer service, and interpersonal skills</li><li>Basic ability to work independently and manage your time</li><li> Basic ability to troubleshoot issues and make system changes as needed to resolve them<br></li></ul><strong>Commitment:</strong><em>This is a full-time, 6-month contract position (with the potential for extension or conversion) staffed via HireArt and based in Burlingame, CA. It will be fully remote until offices reopen and is available to candidates local to the area.<br><br></em><em>HireArt values diversity and is an Equal Opportunity Employer. We are interested in every qualified candidate who is eligible to work in the United States. Unfortunately, we are not able to sponsor visas or employ corp-to-corp.<br><br></em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06"
    },
    "company": {
        "name": "HireArt",
        "link": "https://www.linkedin.com/company/hireart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Burlingame",
        "region": "CA",
        "postal_code": "94012",
        "street_address": null,
        "latitude": 37.584194,
        "longitude": -122.366264
    }
}