{
    "job": {
        "title": "Data Scientist",
        "industry": [
            "Computer Software",
            "Information Technology and Services",
            "Internet"
        ],
        "description": "<strong><u>Description<br><br></u></strong>Are you seeking an environment where you can drive innovation? The Consumer Finance Science and Analytics (CFSA) team's mission is to inject advanced quantitative techniques into traditional financial analytics. We are data leaders, who identify and deliver actionable financial analyses and recommendations.<br><br>As we expand our transportation footprint, Amazon faces important questions, including how can we identify and influence controllable factors to reduce transportation costs while driving the Amazon flywheel? CFSA is partnering with the Supply Chain Optimization Technologies (SCOT) finance team, who is dedicated to answering these questions using statistical and machine learning methods.<br><br>Amazon is looking for the next outstanding Data Scientist to help build a brand new product that analyzes transportation costs, led by SCOT. They will partner with a team of finance specialists, economists and business intelligence engineers to build models that explain Amazon’s transportation costs and decompose them into controllable and non-controllable levers.<br><br><strong><u>Our Scientists Raise The Bar On Our Ability To Fulfill Promises To Customers And Business Leaders At Greater Speed And Value Through<br></u></strong><ul><li> Working with technical and non-technical stakeholders across every step of science project life cycle.</li><li> Collaborating with our dedicated finance, product, engineering, and software development teams to create production implementations for large-scale data analysis.</li><li> Developing an understanding of key business metrics / KPIs and connecting them to levers that that shapes management decisions.</li><li> Presenting research results to our internal research community.</li><li> Leading training and informational sessions on our science and capabilities.<br><br></li></ul><strong><u>Basic Qualifications<br></u></strong><ul><li> Bachelor's Degree</li><li> 3+ years of experience with data scripting languages (e.g SQL, Python, R etc.) or statistical/mathematical software (e.g. R, SAS, or Matlab)</li><li> 2 years working as a Data Scientist<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> PhD-level training in computer science, statistics, or highly quantitative field OR an MS with 2+ years experience on a data, research, or applied science team OR equivalent applied research experience</li><li> Knowledge of and experience with causal inference techniques and panel data methods (difference-in-difference, fixed effects regression, propensity score matching, synthetic controls)</li><li> Excellent written and verbal communication skills on quantitative topics</li><li> Expertise in applying supervised and unsupervised algorithms to large-scale data</li><li> Keen judgment for balancing research depth and pacing</li><li> Able to operate autonomously in scoping, executing, and delivering projects</li><li> Undergraduate-level knowledge of investments, corporate finance, and accounting</li><li> Excitement to shape a growing team and state-of-the-art technology for Amazon Consumer Finance<br></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.<br><br><br><strong>Company</strong> - Amazon.com Services LLC<br><br>Job ID: A1666669",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10"
    },
    "company": {
        "name": "Amazon",
        "link": "https://www.linkedin.com/company/amazon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Santa Monica",
        "region": "CA",
        "postal_code": "90403",
        "street_address": null,
        "latitude": 34.010933,
        "longitude": -118.491516
    }
}