{
    "job": {
        "title": "Data Compliance Engineer (Cloud)",
        "industry": [
            "Consumer Electronics"
        ],
        "description": "<br><strong>Summary<br></strong> <br>Imagine what you could do here. At Apple, extraordinary ideas have a way of becoming industry leading products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!<br><br><br>Apple IS Data Services is seeking a hardworking, passionate and self-motivated Database Compliance engineer with focus on database security who has passion for security, compliance and automation! You should be able to support and implement groundbreaking technologies to provide compliance controls for cloud and hybrid database environments. Multifaceted candidate should be willing to accept new challenges in fast paced environment with responsibility to secure various critical relational / noSQL databases.<br><br><br>*Please note this role can also be based out of Sacramento, California*<br><br> <br><strong>Key Qualifications<br></strong> <br>Technical background with understanding database methodologies and various relational and noSQL database technologies <br><br>Comfortable translating compliance control language into terms that engineers can apply to their processes and work<br><br>Experience leading PCI or SOX audit or worked with an engineering organization to detail technical solutions to meet controls in a large scale environment<br><br>Design, govern and automate set of controls and associate implementation strategy in the cloud environment<br><br>Liaison with external auditor and other internal teams to support certification audits<br><br>Work in exciting environments and run tight deadlines or unexpected changes in highly multifaceted environment<br><br>Ability to quickly adapt and learn new technology and participate in design discussions as needed<br><br>Partner with various teams on developing security &amp; compliance documentation for new technologies<br><br> <br><strong>Description<br></strong> <br>2-4 years of experience in database security / compliance<br><br>Hands-on experience and detailed understanding of AWS, cloud security best practices, tools and automation<br><br>Clear and in-depth understanding of IT compliance controls<br><br>Capable of translating compliance requirements into technical specifications and leading security compliance engagements with database engineering and IT compliance organizations.<br><br>In-depth knowledge of Relational, NoSQL and BigData technologies. Security and compliance experience for these technologies is a must<br><br>Expertise with Jenkins, Python, Java, shell scripting preferably in cloud environment <br><br>Ability to work multiple teams across different geographical locations in different time zones<br><br>Experience with Linux and AIX operating systems<br><br>Thorough understanding of procedures and processes in large organization<br><br> <br><strong>Education &amp; Experience<br></strong> <br>BS in Computer Science/Engineering or Equivalent.<br><br> <br><strong>Additional Requirements<br></strong> <br>Working knowledge of automation in AWS environment is highly desirable<br><br> <br>Role Number: 200231908<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}