{
    "job": {
        "title": "Senior Software Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<p>Remote in Chicago / Other locations: Colorado, Austin, New York and California</p><p><br></p><p><strong>About this Opportunity:</strong></p><p><br></p><p>Our client is one of the best live streaming TV services focusing on Sports. They are rapidly growing and looking for a Sr Software Engineer to join their team.</p><p><br></p><p><strong>About you</strong></p><p><br></p><ul><li>Our client is looking for a hands-on Sr Software Engineer to take the lead in the team of talented software engineers</li><li>Enjoys learning new things and sharing knowledge with coworkers</li><li>Takes the initiative in identifying and removing roadblocks</li><li>Enjoys working in a fast-moving environment in which individual contributors are trusted to make technical decisions and execute independently</li></ul><p><br></p><p><strong>What you will do</strong></p><p><br></p><ul><li>This role will be responsible for day-to-day team operations including managing the team’s backlog and workload</li><li>Coach and mentor the team, expanding their expertise</li><li>Ensure that delivery teams are resourced and supported in order to meet the prioritized needs of the department</li><li>Clearly communicate schedule and quality expectations and ensure that teams are operating efficiently</li><li>Ensuring timely delivery on commitments and operational excellence</li><li>Acting as a coach and mentor to junior members of the team</li><li>Continuous collaboration with business stakeholders, product and other engineering teams on the team’s roadmap and deliverables</li><li>Build and promote a work environment for high performance that is highly Agile, Collaborative and team centric</li><li>Maintaining technical relationships with vendors that the team works closely with</li></ul><p><br></p><p><strong>What you will need</strong></p><p><br></p><ul><li>8 years of experience in delivering working software with at least 3 years building solutions for subscription-based services</li><li>3 years of experience leading a small engineering team</li><li>Bachelor’s Degree in Computer Science, Engineering, Information Technology or a related field or equivalent as determined by a professional credentials evaluation.</li><li>In-depth understanding of how subscriptions work - billing terms, renewals, cancellations, failed payments, etc. Ability to identify and cover edge cases.</li><li>Good knowledge of web technologies and experience building transactional RESTful API services with 24x7 availability</li><li>Master of at least one modern backend stack, with a willingness to learn new technologies and methodologies</li><li>Have an interest or experience in Go, message queues, and service-oriented architectures</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20"
    },
    "company": {
        "name": "Anew Recruit",
        "link": "https://www.linkedin.com/company/anew-recruit"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}