{
    "job": {
        "title": "Data Scientist",
        "industry": [],
        "description": "<p>Data Scientist </p><p><br></p><p>Job Description</p><p>Summary</p><p>• Responsible for overseeing the collection, storage and interpretation of data for</p><p>businesses.</p><p>• Sift through data points to create organized categories, comparing data points to current</p><p>company processes and writing reports outlining business predictions or proposals.</p><p>Duties and Responsibilities</p><p>• Use data to help businesses make decisions by collecting data through means such as</p><p>analyzing business results or by setting up and managing new studies</p><p>• Transferring data into a new format to make it more appropriate for analysis</p><p>• Creating new, experimental frameworks to collect data</p><p>• Building tools to automate data collection</p><p>• Searching through large data sets for usable information</p><p>• Creating reports and presentations for business uses</p><p>• Correlating similar data to find actionable results data Scientist skills and qualifications</p><p>Required Skills</p><p>• Exceptional technical writing skills</p><p>• Ability to communicate complex data in a simple, actionable way</p><p>• Ability to visualize data in the most effective way possible for a given project or study</p><p>• Analytical and problem-solving skills</p><p>• Experience with machine learning and AI</p><p>• Familiarity with data management tools</p><p>• Ability to work independently and with team members from different backgrounds</p><p>• Excellent attention to detail</p><p>• Data Scientist education and training requirements</p><p>Education</p><p>• Major: Computer Science, Mathematics, Statistics or Engineering</p><p>• Bachelor’s degree with 7+ years</p><p>• Master’s degree with 5+ years (preferred)</p><p><br></p><p><br></p><p>The ideal candidate's favorite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the right answers.&nbsp;</p><p>&nbsp;</p><p><strong>Responsibilities</strong></p><ul><li>Analyze raw data: assessing quality, cleansing, structuring for downstream processing</li><li>Design accurate and scalable prediction algorithms</li><li>Collaborate with engineering team to bring analytical prototypes to production</li><li>Generate actionable insights for business improvements</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree or equivalent experience in quantative field (Statistics, Mathematics, Computer Science, Engineering, etc.)</li><li>At least 10 years' of experience in quantitative analytics or data modeling</li><li>Deep understanding of predictive modeling, machine-learning, clustering and classification techniques, and algorithms</li><li>Fluency in a programming language (Python, C,C++, Java, SQL)</li><li>Familiarity with Big Data frameworks and visualization tools (Cassandra, Hadoop, Spark, Tableau)</li></ul>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-10"
    },
    "company": {
        "name": "Paramount Software Solutions, Inc",
        "link": "https://www.linkedin.com/company/paramount-software-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}