{
    "job": {
        "title": "Junior Software Engineer",
        "industry": [
            "Internet",
            "Consumer Goods",
            "Retail"
        ],
        "description": "Babylist is an e-commerce and gifting platform for new parents and parents-to-be. We are a rapidly growing business looking for talented contributors to join our seasoned, cross-discipline team.<br><br>Our web application and backend systems are at the center of the Babylist experience - an experience our users love as they prepare for one of life's biggest events.<br><br>The Babylist engineering culture is one of learning and knowledge sharing. We are passionate about experimentation, automation and shipping value to our customers. Our stack is based on Ruby on Rails and React. We continue to expand our toolbox to use the best technologies for the job.<br><br>Who You Are<br><ul><li>You find joy in debugging and pride in hunting down and squashing bugs</li><li>You enjoy working with multiple teams, and being the go-to person for your teammates when they need support</li><li>You get excited empowering others by building the tools they need to do their jobs more efficiently </li><li>You have the confidence to communicate something technical to a non-technical team member; you know how to cut out the jargon and talk to others in the ways they'll understand best</li><li>You value collaboration and working with a strong team</li><li>You understand testing, monitoring, and running a production software system</li><li>You know how to roll up your sleeves; we like systems that run well, but when things don't go as planned, we support each other<br></li></ul>What You'll Do<br><ul><li>Work closely with team members across different roles and departments, and become the point person for technical requests</li><li>Track and identify issues affecting both our users and other Babylist employees, and build tools and solutions to make people's lives easier</li><li>Facilitate and triage internal requests related to our business needs</li><li>Reduce toil by investing in long term solutions to frequent requests or complaints </li><li>Communicate new product launches and updates to our Customer Service team, so they can provide better service to our users</li><li>Support other engineers by writing scripts and building tools to service backend requests and make development easier</li><li>Learn and grow as an Engineer<br></li></ul>What You've Done<br><ul><li>2-3+ years of engineering experience with a proven track record of building consumer web applications or services</li><li>Solid fluency in at least one of Ruby, Python, or another modern programming language</li><li>Bachelor's Degree in Engineering, Computer Science, or related field, or relevant experience is a bonus; this role requires a concrete understanding of CS fundamentals</li><li>Experience with Ruby/Rails and AWS a plus</li><li>Demonstrated experience working fully remote with a team also a plus<br></li></ul><strong>Our Tech Stack<br></strong><ul><li>Ruby on Rails</li><li>React</li><li>MySQL</li><li>Redis</li><li>Sidekiq</li><li>AWS<br></li></ul><strong><u>About Babylist<br><br></u></strong>At Babylist, we help expecting parents get exactly what they need for the arrival of their new baby. Founded in 2011, Babylist is a popular baby gift registry in the US. We serve millions of families every year to help them make the journey to parenthood less overwhelming and more fun. Families can add any item from any store to their registry, including products Babylist directly sells, alongside meaningful gifts like babysitting and meals, which they can't buy in stores. The baby retail market is underserved and Babylist is well positioned to be the trusted brand that helps new families through this monumental life stage. In the US alone, 4 million babies are born every year and we have over 1.5 million new families signing up to create a baby registry with us annually. This year, 10M loved ones will give the perfect gift using Babylist.<br><br><strong>Why You Will Love Working at Babylist:<br></strong><ul><li> We get stuff done</li><li> We have a real impact on people's lives</li><li> We're passionate about our users and we genuinely appreciate them</li><li> We work at a sustainable pace for long-term success (yes, we're profitable)</li><li> We are growing and have meaningful opportunities for career advancement</li><li> We're a technological and results-driven business</li><li> We believe in autonomy and reward taking initiative</li><li> We have experienced leadership that is always open to new ideas<br></li></ul><strong>Benefits:<br></strong><ul><li> Competitive pay</li><li> Competitive health benefits including company-funded medical, dental, and vision</li><li> 401(k), FSA plans, and disability insurance</li><li> Flexible, paid parental leave policy</li><li> MacBook Pro, tools that you'll need to be successful, and remote working stipend for office set-up</li><li> Company-wide events and meetings to connect with the broader Babylist team</li><li> We work at a sustainable pace; in general we don't work late or on weekends<br></li></ul><em>If your experience is close to what we're looking for, please consider applying. Experience comes in many forms – skills are transferable, and passion goes a long way. We know that diversity makes for the best problem-solving and creative thinking, which is why we're dedicated to adding new perspectives to the team and encourage everyone to apply.</em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-25"
    },
    "company": {
        "name": "Babylist",
        "link": "https://www.linkedin.com/company/babylist"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Oakland",
        "region": "CA",
        "postal_code": "94612",
        "street_address": null,
        "latitude": 37.80483,
        "longitude": -122.27248
    }
}