{
    "job": {
        "title": "General Manager Task Force",
        "industry": [],
        "description": "<p><strong><em>The Hampton Inn, Wilmington/Christina, 1008 Old Churchman’s Road, Newark, DE is ready for you to join us as a Task Force General Manager.&nbsp;(With the ability to apply for the Full Time General Manager position)</em></strong></p><p><strong><em>If you have a passion for hospitality and want to be a part of TBC Hotels, a progressive, exciting hotel company, we think it would be incredible to hear from you… Are you currently an Assistant General Manager, an Operations Manager, or perhaps a Hotel General Manager looking to make a move?&nbsp;&nbsp;Do not let this Task Force opportunity pass you by.&nbsp;&nbsp;</em></strong></p><p>The Hampton Inn is looking to add an exceptional leader to our team.&nbsp;We are looking for a very “<strong><em>hands on</em></strong>” Task Force General Manager, to bring their talents to our hotel.&nbsp;Is this you?&nbsp;At least one year of hotel operational experience is required.&nbsp;If you have knowledge of OnQ, or Hilton experience, it is a major plus. It goes without saying that you must be dependable, ability to work a flexible schedule, and bring your smile and positive vibes with you every day!&nbsp;We are going to be picky as we are looking for the right puzzle piece to add to our family.&nbsp;If you are trying to find a new opportunity where everyone brings next level hospitality, please apply!</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "TBC Hotels",
        "link": "https://www.linkedin.com/company/tbchotels"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Wilmington",
        "region": "DE",
        "postal_code": "19806",
        "street_address": null,
        "latitude": 39.74443,
        "longitude": -75.5451
    }
}