{
    "job": {
        "title": "Data Scientist",
        "industry": [
            "Transportation/Trucking/Railroad"
        ],
        "description": "<p><strong>Who We Are:</strong></p><p>Reengineering one of America’s most antiquated industries is no small task. But at Variant, we like a challenge. And we’re committed to our cause. We believe&nbsp;drivers and shippers deserve better.&nbsp;We&nbsp;believe technology can transform trucking. And we know&nbsp;that when you hire the very best people, you get the very best results.</p><p>&nbsp;</p><p>And at Variant, that means reimagining every aspect of the driver experience. It also means successfully scaling a business model that others said couldn’t be scaled.&nbsp;So, if you want to be part of a cross-functional team that is using a first-of-its-kind platform to&nbsp;overhaul the long-haul trucking industry, we invite you to get on board.</p><p><strong>&nbsp;</strong></p><p><strong>Why Variant?</strong></p><p>This is a once-in-a-lifetime opportunity to be part of transforming one of America’s largest industries from the inside out. If that’s not enough, we also offer a highly-competitive compensation package, unlimited paid-time off, a collaborative work environment, and a team invested in each other’s growth. Additionally, we have profit-sharing, an employee stock purchasing program, 401K matching, a professional development allowance, and a tricked-out office that you can work from post-COVID. So, join us, and let’s reengineer this industry. Permanently. And for the better.</p><p><strong>&nbsp;</strong></p><p><strong>What You’ll Do:</strong></p><p>If you hate restrictive job descriptions, have an appetite for growth, and love collaborating with diverse teams, Variant is the place for you. Our ideal candidate will drive work around Mathematical Optimization, Machine Learning, Graph Algorithms, System Design and Architecture, and other critical workstreams as we continue to grow.</p><p><strong>&nbsp;</strong></p><p><strong>What We’re Looking For:</strong></p><p>&nbsp;</p><p>Education</p><ul><li>Master's in computer science, statistics, mathematics, operations research or a related discipline required, PhD preferred.</li></ul><p>&nbsp;</p><p>Experience</p><ul><li>· Experience with Routing optimization.</li><li>· Writing high-performance code for graph algorithms, linear algebra and matrix operations</li><li>· C++, Python, Java, Linux, CPLEX or Gurobi. C# a bonus</li><li>· Translating real world situations into mathematical constraints and objective functions</li><li>· Expertise with applied statistical modeling and machine learning techniques</li><li>· Strong experience with Git and/or bitbucket is required</li><li>· Ability to work with multiple data sources and types (structured/unstructured)</li><li>· Cloud experience (AWS/Azure/Google)</li><li>· Experience in manipulating and analyzing complex data from multiple sources</li></ul><p>&nbsp;</p><p><strong>Supervisory Responsibility: </strong>none</p><p><strong>&nbsp;</strong></p><p><strong>Work Environment: </strong>This job operates in a normal professional office environment and routinely uses standard office equipment such as computers, phones, photocopiers and fax machines, and filing cabinets.</p><p>&nbsp;</p><p><strong>Physical Requirements:</strong> While performing the duties of this job the employee must have the ability to communicate or exchange information; also, the employee is required to have close visual acuity to perform an activity such as viewing a computer, expansive reading, or preparing and analyzing data, reports and figures</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-09"
    },
    "company": {
        "name": "Variant",
        "link": "https://www.linkedin.com/company/drivevariant"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}