{
    "job": {
        "title": "Senior Full Stack Software Engineer - AWS, Python, Google Cloud",
        "industry": [
            "Internet"
        ],
        "description": "If you are a Senior Full Stack Software Engineer with experience, please read on!<br><br>This is a full-time/permanent position, direct-hire with my client.<br><br>We are the world leading digital invitation platform that has been around for many years. We are starting ramp back up post Covid and need software engineers to help manage our hundreds of thousands events per month. We need a senior level candidate that is strong in Python for our engineering team.<br><br>What You Need for this Position<br><ul><li> 5+ years of experience</li><li> AWS</li><li> Python</li><li> Google Cloud</li><li> JavaScript</li><li> REACT</li><li> HTML</li><li> Linux/UNIX</li><li> CSS<br></li></ul>So, if you are a Senior Full Stack Software Engineer with experience, please apply today!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Chris.Cavish@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : CC18-1645525 -- in the email subject line for your application to be considered.***<br></li></ul>Chris Cavish - Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.<br><br>CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}