{
    "job": {
        "title": "Full Stack Software Engineer",
        "industry": [],
        "description": "<p>Givewith is seeking a Full Stack Software Engineer to join our growing engineering team. As an early stage team member, you will be able to grow your skills and career by having significant responsibility in the development of the Givewith technology platform. You are seeking a growth oriented opportunity, and the ability to develop an industry-changing, socially impactful global SaaS platform. As a full stack developer, you enjoy working on both front-end and back-end technologies, and are able to contribute to codebases anywhere in the development process, from writing tests to deploying infrastructure. You will get hands-on production experience on a wide variety of technologies, and you will be able to develop expertise in areas that are both interesting to you and valuable to the platform, while helping to create meaningful social impact in the real world. You are a contributor to engineering organizational culture, and want to be a key stakeholder in the expansion of a new engineering organization.</p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Be a key, early contributor to our growing codebase</li><li>Partner with the engineering and product organization to plan and prepare for new features and enhancements for our technical and product roadmap</li><li>Maintain and improve existing systems; work closely and iterate quickly with product development to adapt to opportunities; architect, design, build, and deploy new features</li><li>Design and scale systems that collect, store, and transform data from various external sources</li><li>Support our Agile processes to build a high-quality product development lifecycle, and organized, thoughtful team culture</li><li>Work with non-technical stakeholders to define and build new features</li></ul><li><br></li><p><strong>Qualifications</strong></p><ul><li>Professional experience as a software developer</li><li>Strong ability in Python and JavaScript</li><li>Familiarity with Agile processes, version control (Git), automated testing, AWS/Cloud</li><li>The ability to work collaboratively or independently</li><li>The ability to communicate clearly with non-technical business leadership</li></ul><p><br></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05"
    },
    "company": {
        "name": "Givewith",
        "link": "https://www.linkedin.com/company/givewith"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}