{
    "job": {
        "title": "Software Test Engineer",
        "industry": [
            "Marketing and Advertising",
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "Lionbridge enables more than 800 world-leading brands to increase international market share, speed adoption of products and effectively engage their customers in local markets worldwide. Using our innovative cloud technology platforms and our global crowd of more than 100,000 professional cloud workers, we provide translation, digital marketing, global content management and application testing solutions that ensure global brand consistency, local relevancy and technical usability across all touch points of the customer lifecycle. Based in Waltham, Mass., Lionbridge maintains solution centers in 28 countries.<br><br>Employee Sub-Group: Regular FT Hourly<br><br><strong><u>Work Schedule<br><br></u></strong>Location: Work From Home , Idaho<br>Position Title: Accessibility Test Engineer<br><br>Req: 33836<br><br>The software test engineer will test software through different automated and non-automated ways and have an understanding of a wide variety of testing tools. They create and maintain test cases and run test cases accurately and efficiently to have confidence in the documented results. They use their own gaming knowledge and exploratory testing skills to identify potential issues and risk areas within the product. They report bugs in a clear and concise manner into a bug database and regress bugs and validate that the issues have been addressed correctly. Finally, the software test engineer provides feedback and suggestions to improve game quality and game experience and assists with updating and refining QA test cases.<br><br><strong><u>The Below Experience Is Required<br></u></strong><ul><li> Knowledge of JIRA, Confluence, Slack, GitHub, Zoom and Box.</li><li> Familiarity with Chrome and how to pull browser logs, FireFox, Edge, and Opera for compatibility testing.</li><li> MAC OS for compatibility testing.</li><li> Familiarity with network tools like Netlimiter, Clumsy for speed and ping tests.</li><li> Experience with Smoke testing, Functional Testing, Integration testing, System Testing, Compatibility Testing on the development, release and production servers.<br></li></ul>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19"
    },
    "company": {
        "name": "Lionbridge",
        "link": "https://www.linkedin.com/company/lionbridge"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Boise",
        "region": "ID",
        "postal_code": "83712",
        "street_address": null,
        "latitude": 43.61579,
        "longitude": -116.20158
    }
}