{
    "job": {
        "title": "Data Scientist / Biostatistician",
        "industry": [],
        "description": "<p><strong>Company Overview:&nbsp;</strong></p><p><br></p><p>BlinkTBI’s FDA-cleared technology, EyeStatTM, delivers objective data about the blink reflex in just minutes by stimulating and measuring the blink using light puffs of air and high-speed videography. Our foundational research and proof of concept data supports EyeStat's initial application intended to test for and identify abnormal blink patterns associated with traumatic brain injury (TBI). In addition to TBI, BlinkTBI is now exploring applications in the diagnosis, differentiation and management of neurological diseases and conditions such as Parkinson's, Alzheimer's, and Migraine.&nbsp;</p><p><br></p><p><strong><u>Position Summary: </u></strong></p><p><strong>Core Responsibilities: </strong></p><p><br></p><ul><li>Lead process to clarify with stakeholders. </li><li>Identify data sources, how to collect and prioritize. </li><li>Process/Clean data. </li><li>Integrate and store data. </li><li>Look for correlation/trends/relation between data sets that allows for improved diagnosis, to measure treatment success, to refine therapies, etc. </li><li>Use of machine learning, statistical modeling, and artificial intelligence. </li><li>Measure and improve. </li><li>Communicate actionable insights. </li><li> Utilizes statistical software programs (e.g., SAS, R) to implement advanced statistical methodologies (e.g., longitudinal data analysis, survival analysis, Poisson regression, imputation methodologies and analyses with missing data) and verify underlying distributional assumptions </li></ul><p><br></p><p><strong>Qualifications: </strong></p><p><br></p><ul><li>Prior experience in biological sciences, pharmaceuticals, medical devices in entrepreneurial environment. </li><li>A minimum of eight (8) years of experience conducting statistical analysis for clinical research projects. Master's or higher level degree in biostatistics, statistics, or a related field is required. </li><li>Excellent verbal and written communication and interpersonal skills. </li><li>Must be a self-starter, able to work independently and have the ability to coordinate multiple activities simultaneously in support of various projects&nbsp;</li></ul><p><br></p><p><strong>Preferred Skills:</strong></p><p><br></p><p>•\tMust be comfortable with early-stage data</p><p>•\tWill need to have the ability to help create structure where little exists&nbsp;</p><p>•\tMust be able to work with small teams</p><p>•\tSomeone who is persistent, persuasive, systematic, independent, seeks opportunities, takes the initiative, and demands efficiency and quality.</p><p><br></p><p><strong>Additional:</strong></p><p><strong><span class=\"ql-cursor\"></span></strong></p><p>Paid on an hourly basis</p><p><br></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10"
    },
    "company": {
        "name": "Blinktbi, Inc",
        "link": "https://www.linkedin.com/company/blinktbi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Charleston",
        "region": "SC",
        "postal_code": "29464",
        "street_address": null,
        "latitude": 32.77647,
        "longitude": -79.93103
    }
}