{
    "job": {
        "title": "Software Engineer I",
        "industry": [
            "Information Technology and Services",
            "Insurance",
            "Financial Services"
        ],
        "description": "<strong><u>Description<br><br></u></strong>Designs, develops and troubleshoots basic software programs for computer based systems.<br><ul><li>Participates in the development and review of specifications to gain an understanding of application changes.</li><li>Completes basic program changes to translate specifications and / or requirements into code.</li><li>Applies basic technical skills to produce deliverables (i.e. specifications, program changes, unit test scripts, documentation, etc.).</li><li>Provides documentation to support program changes.</li><li>Plans, documents, and executes unit test plans to ensure all code changes meet requirements / specifications.</li><li>Supports programming changes during quality assurance, user acceptance testing, and post implementation to ensure integrity of application.</li><li>Monitors progress against task estimates to provide status.</li><li>Complies with standards and procedures to ensure development consistency (e.g. programming standards, change management, version control).</li></ul><strong>Requirements<br></strong><ul><li>Bachelor's Degree in Computer-related discipline or equivalent work experience</li><li>Using one or more programming language(s).<br></li></ul><strong>Our Commitment<br><br></strong>Paychex is dedicated to fostering a culture of intentional Inclusion and Diversity (I&amp;D). Our valued employees and commitment to I&amp;D is the essence of our internal and external success. Inclusivity is a key value of our corporate culture and is exemplified through our reputation as a top employer for employee development, diversity, and ethics, as well as a focus on fairness in recruitment, selection, and decision making.<br><br>Click here for more information on our corporate social responsibility.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Paychex",
        "link": "https://www.linkedin.com/company/paychex"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Nashville",
        "region": "TN",
        "postal_code": "37221",
        "street_address": null,
        "latitude": 36.166344,
        "longitude": -86.77907
    }
}