{
    "job": {
        "title": "AI/ML - Machine Learning Researcher, MIND",
        "industry": [
            "Consumer Electronics"
        ],
        "description": "<br><strong>Summary<br></strong> <br>We are looking for outstanding researchers to work on ambitious artificial intelligence projects that will advance the field and shape intelligence in future Apple products. As a team, we are working to define and solve the hardest problems in machine learning, computer vision, NLP, and speech recognition. Our roots are in research, which means at our core, we value learning, intellectual curiosity, and exploration.<br><br> <br><strong>Key Qualifications<br></strong> <br>In-depth expertise in machine learning research <br><br><br>Domain expertise in one or more of computer vision, audio processing, NLP, optimization, or computer graphics fields.<br><br><br>Strong mathematical background in linear algebra and statistics.<br><br><br>Publication record in relevant venues (e.g. NeurIPS, ICML, ICLR, CVPR, ICCV, ECCV, ACL, SIGGRAPH).<br><br><br>Proficient in Python and C/C++. CUDA or other GPGPU is a plus.<br><br><br>Expertise in working with at least one deep learning framework, for example, PyTorch, TensorFlow<br><br><br>Strong interpersonal skills and ability to collaborate in a diverse environment<br><br> <br><strong>Description<br></strong> <br>As a Machine Learning Researcher on this team, you will:<br><br><br>-  Work on some of the most ambitious technical problems on data and compute efficient machine learning<br><br><br>-  Research novel AI solutions that will impact future Apple products<br><br><br>-  Collaborate with world-class machine learning researchers and engineers to bring research ideas to production <br><br><br>-  Publish and present your work in world-class scientific venues in machine learning field <br><br><br>-  Provide technical mentorship and guidance<br><br> <br><strong>Education &amp; Experience<br></strong> <br>PhD in Computer Science or a related field<br><br> <br>Role Number: 200246707<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}