{
    "job": {
        "title": "Autonomy/AI Machine Learning Research Engineer",
        "industry": [
            "Defense & Space"
        ],
        "description": "<strong><u>Summary Description<br><br></u></strong>Focuses on research &amp; development of technologies that enable and advance semi and fully<br><br>autonomous systems for both defense and commercial customers. Serves as the algorithm expert<br><br>working to enhance machine learning and robotic algorithms. Investigates, optimizes, and applies upto-<br><br>date knowledge on modern AI research with latest machine learning and deep learning techniques.<br><br>Develops algorithm implementation requirements. Develops prototypes and may be involved in the<br><br>inception of ideas and drive the development cycles from research to test of prototypes for a major<br><br>project or component of a major project.<br><br><strong><u>Key Responsibilities<br></u></strong><ul><li> Researches and discovers improvements to machine learning and robotic algorithms</li><li> Drives advancements in techniques used in signal processing, computer vision (CV), and control<br></li></ul>systems<br><ul><li> Develops AI algorithms for mission systems</li><li> Applies latest research on AI algorithms and trains machine learning / deep learning models to<br></li></ul>solve a variety of problems<br><ul><li> Investigates and applies the latest machine learning and deep learning techniques</li><li> Optimizes the performance of AI algorithms, applications, and platforms</li><li> Develops and documents algorithm and implementation requirements</li><li> Develops prototypes that will enable autonomous functionality in LM products and platforms</li><li> Interfaces with other teams involved the development lifecycle for perception, mission and<br></li></ul>motion planning, simulation and modeling, testing, etc.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13"
    },
    "company": {
        "name": "Lockheed Martin",
        "link": "https://www.linkedin.com/company/lockheed-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Littleton",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.61265,
        "longitude": -105.0162
    }
}