{
    "job": {
        "title": "End User Support Specialist II",
        "industry": [
            "Financial Services"
        ],
        "description": "<br><strong><u>End User Support Specialist II<br><br></u></strong><strong>Chicago, IL<br><br></strong>#WeAreTradeStation<br><br>TradeStation is an online brokerage firm seeking to level the playing field for self-directed investors and traders, empowering them to claim their individual financial edge. We have built a team of amazing people who work together in a high-performance culture to provide our clients with exceptional products and services. We offer a collaborative and flexible work environment, competitive salaries, comprehensive benefits and a generous PTO policy.<br><br>We are seeking an End User Support Specialist who will provide assistance and consultation to all users. The Specialist may perform help desk functions and training, provide direct user support and guidance, and assist with technology planning. Specialists at this level typically provide advanced technical support on hardware and software applications. The Specialist will respond to telephone calls, email, and personnel requests for technical support as well as track and monitor the problem to ensure a timely resolution.<br><br><u><strong>ESSENTIAL JOB FUNCTIONS</strong></u>:<br><ul><li>Maintain and upkeep assigned applications (ex. SCCM, Druva, Jamf, etc.)</li><li>Support end-users with technical questions (Hardware or software)</li><li>Assist in the development of streamlined procedures to ensure effective IT Customer Services assistance</li><li>Act as an escalation for the Support Specialist I for technical issues and customer service issues</li><li>Serve as liaison between system/network engineer staff and end-users to resolve customer/user problems and concerns</li><li>Explain computing concepts to non-technical staff</li><li>Assist in the deployment and support of telecommunication devices</li><li>Intermediate level administration of Active Directory (Create or modify security groups, update user information, etc.)</li><li>Assist with departmental projects<br><br></li></ul><u><strong>KNOWLEDGE, SKILLS &amp; ABILITIES</strong></u>:<br><ul><li>In-depth understanding of desktop operating systems and hardware configurations (Windows OS and macOS) including system deployment</li><li>General understanding of network concepts</li><li>Intermediate knowledge level of Active Directory</li><li>Intermediate knowledge of PowerShell scripting.</li><li>Ability to work independently in local and/or remote locations</li><li>Ability to prioritize multiple tasks and projects as needed.</li><li>Ability to present computing concepts to technical and non-technical staff and rely on his/her experience and judgment to plan and accomplish goals</li><li>Knowledge of enterprise software services (ex. Druva, SCCM, Jamf, CrowdStrike, McAfee, Office 365, OneDrive)</li><li>Knowledge of commonly-used concepts, practices, and procedures in more complex help desk support functions<br><br></li></ul><u><strong>EDUCATION &amp; EXPERIENCE</strong></u>:<br><ul><li>Bachelor’s Degree in a related area or Associates Degree and equivalent related experience</li><li>3-5 years experience in the computer field.</li><li>Microsoft certification is required (Minimum MCP)</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02"
    },
    "company": {
        "name": "TradeStation",
        "link": "https://www.linkedin.com/company/tradestation"
    },
    "education": {
        "required_credential": "associate degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}