{
    "job": {
        "title": "Entry-Level Back-End Software Engineer",
        "industry": [
            "Marketing and Advertising",
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "Awardco is an up-and-coming software company focused on providing better solutions to engage and reward employees. Our technology is changing the landscape of employee recognition and we are looking for individuals that want to be part of this exciting worldwide movement. We promise an exciting atmosphere where hard-working individuals are regularly presented with new challenges and opportunities for growth. As a young company on the rise, Awardco provides its employees with terrific opportunities for advancement.<br><br>Our development team is very lean. Lean software development (agile development) is an essential methodology for our development processes, and each member of our team is trained in agile software development methods and is capable of leading a team that adheres to these processes.<br><br><strong>What you will do:<br><br></strong>The Awardco engineers are responsible for an array of duties, including managing the development of new features, changes to our existing code, and improving overall product performance by optimizing existing workflows and code blocks. We expect our development team to be dynamic, display leadership qualities, bring fresh ideas to improve the product, and be enthusiastic to take on new problems as we continue to expand the recognition and incentive industry.<br><ul><li>Design and implement new features for our existing web application</li><li>Continue to maintain and iterate on released features by implementing and following key metrics</li><li>Peer code review<br></li></ul><strong>What you will bring:<br></strong><ul><li>Bachelor's degree in Computer Science or related technical field</li><li>Experience in software engineering from an internship or equivalent</li><li>Experience in a general purpose programming language including but not limited to: C, C++, C#, Java, JavaScript, Go, or Python</li><li>Interest and ability to learn other programming languages</li><li>Experience working with data structures and algorithms</li><li>Currently located or willing to relocate to Provo/Orem, UT area</li><li>Authorization to legally work in the US</li><li>Working proficiency in verbal and written English<br></li></ul><strong>Salary Range<br></strong><ul><li>$85,000 - $100,000 based on experience<br></li></ul><strong>Why Awardco?<br></strong><ul><li>Get in early with Utah's #1 fastest-growing company </li><li>Great Place to Work certified</li><li>A revolutionary, client-approved product</li><li>Leadership that listens</li><li>Diligent and dedicated coworkers that make work not feel like work </li><li>Career growth and opportunity according to what you want to do</li><li>Cool swag, free snacks, and unlimited PTO<br></li></ul><em>Awardco is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.</em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-07"
    },
    "company": {
        "name": "Awardco",
        "link": "https://www.linkedin.com/company/awardco"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Provo",
        "region": "UT",
        "postal_code": "84601",
        "street_address": null,
        "latitude": 40.235123,
        "longitude": -111.66219
    }
}