{
    "job": {
        "title": "Machine Learning Engineer, Viral Projects (Remote)",
        "industry": [
            "Information Technology and Services"
        ],
        "description": "<p>AssemblyAI (www.assemblyai.com) is the #1 rated API for Speech Recognition. Thousands of developers use our APIs to transcribe millions of videos, podcasts, phone calls, and zoom meetings every day - powering innovative products like visual voicemail, meeting summarizers, and closed captioning.</p><p><br></p><p>We're backed by leading investors including Y Combinator, John and Patrick Collison of Stripe, Daniel Gross, and Nat Friedman. We were founded in 2017.</p><p><br></p><p><strong>Responsibilities:</strong></p><p>Are you a Full Stack Engineer passionate about machine learning / deep learning that’s active on Reddit, Hacker News, Twitter, and/or YouTube? Maybe you are a former technical founder that’s not sure what you want to work on next?</p><p><br></p><p>We’re building an API company that will be just as well known as Twilio and Stripe. To do that, we’re investing in building a developer community around our API, and publishing high quality developer content that showcases our API’s capabilities and features. You’ll contribute to those efforts in this role, by focusing on:</p><p><br></p><ul><li>Creating high quality developer content (blogs, tutorials, YouTube videos, Tweet threads, etc) that showcases our API’s capabilities, demonstrates various programming or ML technologies, and engages the developer community</li><li>Involving yourself in discussions around Speech-to-Text, Speech Recognition, or similar technologies on Reddit, Hacker News, Twitter, etc in order to expose AssemblyAI to more developers</li><li>Building a community of developers around our API through newsletters, Discord channels, social media, etc.</li></ul><p><br></p><p>We’re a small team, and are looking for passionate, hungry, smart, and collaborative individuals that want to have a big impact.</p><p><br></p><p><strong>Requirements:</strong></p><ul><li>2+ years of experience with machine learning or deep learning</li><li>A track record of creating content for developers (Tweets, YouTube videos, Blogs, etc)</li><li>Passionate about APIs and developer tools</li><li>Experience engaging with developers on Reddit, Hacker News, Twitter, Stack Overflow, etc.</li></ul><p><br></p><p><strong>Benefits:</strong></p><ul><li>Competitive Salary</li><li>Equity</li><li>100% Remote team</li><li>Unlimited PTO</li><li>Premium Healthcare (100% Covered)</li><li>Dental Care</li><li>$1K budget for your home office setup</li><li>New Macbook Pro (or PC if you prefer)</li><li>3-4x/year company paid team retreats</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-28"
    },
    "company": {
        "name": "AssemblyAI",
        "link": "https://www.linkedin.com/company/assemblyai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}