{
    "job": {
        "title": "Entry Level Software Engineer",
        "industry": [
            "Information Technology and Services"
        ],
        "description": "<p>The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.&nbsp;</p><p>\t</p><p><strong><u>Responsibilities:</u></strong></p><ul><li>Develop, create, and modify general computer application software or specialized programs</li><li>Analyze user needs and develop software solutions</li><li>Design or customize software for client use to optimize operational efficiency</li><li>Improve existing systems by analyzing areas of modification</li><li>Analyze and design databases with application areas</li><li>Coordinate database development with a team or individually</li><li>Maintain systems by monitoring, identifying, and correcting software defects</li><li>Create technical specifications and test plans</li><li>Update knowledge and skills regularly through in-house and external courses, manuals, and new applications</li></ul><p><strong><u>Qualifications</u></strong></p><ul><li>B.S. in Computer Science (CS), Information Technology (IT), Information Systems (IS), Electrical Engineering (EE), Computer Engineering (CE), Informatics, or Software Engineering (SE)</li><li>Knowledge of basic computer science concepts, programming, and Information Systems</li><li>Interest and willingness to travel and relocate</li><li>Previous experience in Java/J2EE Development, C++/C#, .NET, VB/ASP Development and Database experience is preferred.</li></ul><li></li>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13"
    },
    "company": {
        "name": "Tata Consultancy Services",
        "link": "https://in.linkedin.com/company/tata-consultancy-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Texas",
        "region": "United States",
        "postal_code": "76522",
        "street_address": null,
        "latitude": 31.463793,
        "longitude": -99.333275
    }
}