{
    "job": {
        "title": "Data Scientist",
        "industry": [],
        "description": "<p>Lakarya is Hiring for one our Clients</p><p><strong>Position: Data Scientist /Data Analyst</strong></p><p><strong>Location: Highpoint, NC</strong></p><p><strong>Job type: Long term Contract</strong></p><p><strong>Job Description</strong></p><ul><li>Manage administration and supervise the development of logistics policies and programs to ensure they meet the changing conditions in program requirements.</li><li>Prepare and present membership changes to large audience including senior staff using PowerPoint.</li><li>Develop reports using IBM Cognos as part of the migration of a particular customer.</li><li>Coded/Maintain a SAS program including embed SQL written by consultants for use in manual claim forecasting.</li><li>Analyze the existing BO universe and provide the guidelines to migrate and implementation effect of Cognos.</li><li>Develop dashboards and trend reports that keep track of utilization volume, cost, and quality performance.</li><li>Serve as project officer/team leader; provide direction and guidance to contractors and support to DoD personnel.</li><li>Involve in development for highly complicate reports, scorecards and dashboards for a specific business needs and performance improvement.</li><li>Develop routine SAS macros to create tables, graphs and listings for inclusion in reports and maintain existing ones.</li><li>Devise new improve procedure (by use of VBA) to create campus tables that saves time and ensures accuracy.</li></ul><p>Job Types: Full-time, Contract</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05"
    },
    "company": {
        "name": "Lakarya",
        "link": "https://www.linkedin.com/company/lakarya"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Greensboro--Winston-Salem--High Point Area",
        "region": null,
        "postal_code": "27401",
        "street_address": null,
        "latitude": 36.076633,
        "longitude": -79.79478
    }
}