{
    "job": {
        "title": "Senior Software Engineer | Payments | Fintech ",
        "industry": [
            "Investment Banking",
            "Banking",
            "Investment Management"
        ],
        "description": "<p><strong><u>Senior Software Engineer - Core Payments – Leading FinTech – Austin, Texas</u></strong></p><p><br></p><p>Are you an Experienced Software Engineer that wants to make a meaningful impact in an organization?</p><p><br></p><p>Are you interested in working in a banking organization that works more like a tech innovation org compared to a traditional bank?</p><p><br></p><p>Are you looking to work in an Agile environment with a clear career progression?</p><p>&nbsp;</p><p>My Client, a Leading Fintech Organization based in San Francisco, are looking to grow their Core Payments tech teams with both Principal and Senior full-stack software engineers with both Java and JavaScript (ReactJS) in Austin, Texas.</p><p><br></p><p>The ideal person should have the necessary skills and experience to provide technical guidance, estimation of efforts, understanding; and decide upon the optimal technology solution to achieve the desired business needs.</p><p><br></p><p><strong><u>You will ideally have:</u></strong></p><p><br></p><ul><li>5+ years&nbsp;of development experience as a&nbsp;Software Engineer</li><li>Hands-on development experience in&nbsp;<strong>Java, J2EE, Spring Boot</strong>, etc.</li><li>A deep fascination of building elegant, maintainable, well-documented, secure code – Abstracting and refactoring should be a passion, not a chore</li><li>Experience with&nbsp;TDD&nbsp;and&nbsp;CI/CD</li><li>Experience with <strong>JavaScript, React.JS</strong>, HTML, CSS, etc</li><li>Experience with distributed systems and with&nbsp;<strong>Micro-services</strong>&nbsp;architecture.</li></ul><p><br></p><p>This is an excellent opportunity to work with a leading and highly respected Financial Organization, which are going through a vast and fascinating digital transformation.</p><p><br></p><p>They have multiple office locations across the USA and can work on a Hybrid Model, although all interviews are currently fully remote.</p><p><br></p><p>Excellent salary, bonus and benefits on offer!</p><p><br></p><p><strong><em>Send in your details ASAP to find out more and receive a full job specification</em></strong></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05"
    },
    "company": {
        "name": "TDA Creative",
        "link": "https://www.linkedin.com/company/tda-creative"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "Texas Metropolitan Area",
        "postal_code": "78723",
        "street_address": null,
        "latitude": 30.276316,
        "longitude": -97.70931
    }
}