{
    "job": {
        "title": "Principal Software Engineer Developer",
        "industry": [
            "Financial Services",
            "Information Technology and Services",
            "Information Services"
        ],
        "description": "<strong>Job Description<br><br></strong><strong>The Expertise and Skills You Bring<br></strong><ul><li>A Bachelor’s or Master’s degree in Computer Science, Software engineering or related field</li><li>10+ years of full-stack development experience with architecting, designing, developing and maintaining multi-tier internet facing web applications using Angular, Node, Nest, and proper test automation frameworks in a fast-paced Scrum environment</li><li>3+ years of development experience (currently hands-on) in Angular +, Node.js 10+, TypeScript, JSON, HTML, CSS</li><li>1+ years of development experience with NestJS and GraphQL</li><li>Proven experience with monorepo development using Nx</li><li>Proven experience with coding and test automation of front-end SPAs, web components, SSR architectures</li><li>Ownership of the SSDL and technical aspects of software engineering for assigned applications</li><li>Proven experience with DevOps CI/CD practices, TDD, automated security and quality testing, modern test and mock frameworks and service virtualization tools to rapidly deliver, measure, and iterate features to customers while minimizing risk using practices like A/B tests, blue-green deployments, and feature toggles</li><li>Strong communication and influencing skills to facilitate collaboration across technology and business partners without having a direct authority over people, yet still being able to accomplish the needed in a way that would want people to work with you in the future</li><li>Proven experience in mentoring and guiding software engineers in an agile environment</li><li>Experience in working with remote and international team members</li><li>Strong hands-on experience with modern MV*/SPA JavaScript frameworks (Angular, Vue)</li><li>Architecture and Design Skills across multiple stacks (Web, Services Development, Mobile)</li><li>Hands-on experience with API Design &amp; Development and Microservices Architecture (Java, REST, GraphQL, NodeJS) is a plus</li><li>Strong CI/CD skills including full scale security and quality testing, build and deployment automation</li><li>Cloud skills (AWS, Containerization)<br><br></li></ul><strong>The Value You Deliver<br><br></strong>We believe that diversity in background and experience will foster an inclusive and engaging work environment for our employees. This ultimately enables us to deliver a better product for our customers.<br><br>Being technically competent is only telling half the story. We believe that delivering the best possible customer experience requires an artful blend of human ingenuity and technology. While we value smart technologists, we are fanatics about our culture that promotes autonomy and leadership at all levels. People who are great cultural fits demonstrate curiosity to learn, are unafraid to break things, step up and take the lead, take ownership of their projects, and thrive by sharing knowledge.<br><br><strong>The Team<br><br></strong>Come join Fidelity in 2021 as we have our Better Way of Working! Your mission, if you choose to accept it, is to join Client Solutions Technology chapter focused on greater delivery, efficiency, and quality. Our engineering team is innovative, diverse, passionate, and self-driven. We work in a very dynamic agile environment. You will work in a Squad focused on enabling Wealth Management business in Fidelity through Flexible, Scalable platforms and report to a Chapter Leader (your manager), whose primary focus is to help you develop in your career and skills as we drive towards increased automation, continuous delivery with quality. Chapter Leaders drive the “how”: skills &amp; mastery, while your Squad drives the “what”. This is the next evolution of Agile development!<br><br><strong>Certifications<br><br></strong>Company Overview<br><br>At Fidelity Investments, our customers are at the heart of everything we do. As a privately held company with a rich 75-year history, our mission has remained the same since our founding: <em>to strengthen the financial well-being of our clients</em>. We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money.<br><br>Join Us<br><br>At Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning and growth so you can build the career you’ve always imagined. We welcome associates from different backgrounds and with different perspectives to help us innovate and make a difference for our customers and our communities.<br><br>We invite you to <strong>Find Your Fidelity</strong> at fidelitycareers.com.<br><br>Fidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging.<br><br>Fidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 2.<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17"
    },
    "company": {
        "name": "Fidelity Investments",
        "link": "https://www.linkedin.com/company/fidelity-investments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}