{
    "job": {
        "title": "Software Engineer - New Grad",
        "industry": [
            "Electrical/Electronic Manufacturing",
            "Defense & Space",
            "Computer Software"
        ],
        "description": "Anduril is a defense technology company, bringing Silicon Valley talent and funding to the defense sector. Our technology helps our customers solve their toughest challenges by enabling them to make better, more informed decisions in life-and-death situations. We’ve assembled a diverse team of experts in artificial intelligence, computer vision, sensor fusion, optics, and data analysis that are creating software and hardware solutions to radically evolve the capabilities of the United States and our allies. If you are passionate about solving problems that have real impact, come join Anduril and build the future of defense.<br><br><strong> What You'll Do <br></strong><ul><li>Engineers are responsible for the full product lifecycle, including design, implementation, deployment, and maintenance</li><li>Collaborate with cross-functional internal hardware &amp; software teams to incorporate their innovations and vice versa.</li><li>Take feedback to iterate on and improve Anduril’s software systems</li></ul>REQUIRED QUALIFICATIONS<br><ul><li>Prior engineering internship experience, along with academic pursuits &amp; studies in the areas of: Computer Science, Computer/Software Engineering, Mathematics, or Physics.</li><li>Familiarity with algorithms, data structures, storage systems, cloud infrastructure, front-end frameworks, and other technical tools.</li><li>Proficiency in a variety of programming languages such as Go, Java, C++, Python, JavaScript, etc.</li><li>A desire to work on software and applications that have real-world impact.</li><li>U.S. Person status is required as this position needs to access export controlled data</li></ul>PREFERRED QUALIFICATIONS<br><ul><li>Have a bias for action. If you see a problem, you want to solve and fix it.</li><li>Be naturally curious about the technologies and tools you use.</li><li>Have a point-of-view, but are still low-ego.</li></ul>Anduril is an equal-opportunity employer, and we encourage candidates from all backgrounds to apply. If you are someone passionate to work on problems that matter, we’d love to hear from you!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10"
    },
    "company": {
        "name": "Anduril Industries",
        "link": "https://www.linkedin.com/company/andurilindustries"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}