{
    "job": {
        "title": "Senior Software Engineer",
        "industry": [],
        "description": "<p>We are seeking a Senior Software Engineer to help us build our data automation platform targeted at business users from the ground up using public cloud infrastructure and services. Your position requires hands-on development while collaborating with the team in driving the critical technical decisions and infrastructure needed to launch, support, and ramp the product in a fast-paced environment. You enjoy working closely with product and design to align on requirements and priorities to produce a best-in-class product experience. You have a thinker-doer mentality and can think broadly but deep dive into details and help shape the team culture.</p><p><br></p><p><u>Recommended Skills:</u></p><p><br></p><ul><li>Bachelor of Science degree, or equivalent experience with strong coding skills</li><li>Developed and shipped products using Javascript with frontend (React) and backend (Node.js) frameworks</li><li>Hands-on experience with using REST APIs, SQL / NoSQL databases, authentication services, web frameworks, and integrating with 3rd party applications.</li><li>Working Knowledge of cloud platforms, e.g., Azure, GCP or AWS</li><li>Able to confidently make technology decisions and back them up.</li><li>Understanding of scripting languages, e.g., JavaScript, Python, Go, PHP, etc.</li><li>Passion for delivering high-quality software by writing clean code and using test-driven development methodologies; you seek out the root cause when debugging software defects and champion improvements that prevent future issues.</li><li>Works across teams, have great attention to detail and exhibit excellent written and verbal communication skills.</li></ul><p><br></p><p><u>Benefits</u></p><p><u><span class=\"ql-cursor\"></span></u></p><ul><li>MacBook Air/Pro</li><li>Vision, dental, and medical plan choices</li><li>Flexible working hours</li><li>Competitive salary &amp; 401(K)</li><li>Flexible/Personal Time Off</li><li>Employee Stock Purchase Plans, and other financial benefits</li><li>Paid Holidays</li></ul><p><br></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24"
    },
    "company": {
        "name": "Immersa",
        "link": "https://www.linkedin.com/company/immersaco"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}