{
    "job": {
        "title": "Senior Data Scientist",
        "industry": [
            "Biotechnology"
        ],
        "description": "<strong>We are creating a technology centric, R&amp;D incubator in the Biotech space and are looking for a fully remote Senior Data Scientist!!<br><br></strong>This Jobot Job is hosted by Matt Gennari<br><br>Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.<br><br>Salary $140,000 - $180,000 per year<br><br><strong>A Bit About Us<br><br></strong>We are a 20-person Biotechnology startup that is focused on creating an R&amp;D incubator that creates innovative solutions to sustainably feed, clothe and keep health the growing world population. We integrate and create cutting edge and novel advances in synthetic biology, data sciences, and analytical systems and are looking for a Senior Data Scientist who wants to be part of a sustainable and ethical company where<br><br><strong><br><br><strong>Why join us?<br><br></strong></strong><ul><li> Extremely competitive base (Up to $180K depending on experience)</li><li> 10% Bonus every year</li><li> Profit-Sharing</li><li> Full Healthcare Benefits</li><li> Fully Remote</li><li> The chance to get in on the ground floor with a growing startup!<br></li></ul><strong>Job Details<br><br></strong>We are looking for someone to drive the development and implementation of data analysis systems at the intersection of ML and BIology. You will be a part of a team engaged in cutting-edge genetic engineering with a custom computational platform. You will also develop ML algorithms and integrate knowledge of biological models and databases with ML algorithms to provide recommendations for biological engineering.<br><br>If you have a strong background in Python, Machine Learning, and Statistics, please reach out!<br><br>Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-05"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Pleasanton",
        "region": "CA",
        "postal_code": "94588",
        "street_address": null,
        "latitude": 37.658436,
        "longitude": -121.877
    }
}