{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": [
            "Hospital & Health Care"
        ],
        "description": "<p>IDR is partnering with a nationally recognized healthcare company headquartered here in Nashville to fill a <u>100% remote Site Reliability Engineer</u> position. Our client offers an innovative workspace, excellent PTO right out of the gate, casual dress code, and ample opportunities for growth and advancement. Our client has continually been recognized and received awards for customer and employee satisfaction.&nbsp;If you are looking a fast paced, highly innovative organization to work for --- we want to talk to you!</p><p><br></p><p><strong>Position Overview for the Site Reliability Engineer: </strong></p><ul><li>Designs and implements automated systems to provision, configure, and update VMS, containers, and other infrastructure </li><li>Architects, builds, and improves an innovative observability platform that collects and aggregates IT services </li><li>Collaborates with other engineering teams to design scalable and sustainable systems architectures </li><li>Guides and instructs software engineering teams on exposing appropriate data points to provide clear availability and performance </li><li>Perform other duties and responsibilites as required, assigned, or requested </li></ul><p><strong>Required Skills for the Site Reliability Engineer: </strong></p><ul><li>Bachelor's Degree in Computer Science or equivalent work experience </li><li>1-3 Years' experience in Site Reliability Engineering, DevOps Engineering, or Software Engineering </li><li>Works to achieve operational targets, which has impact on the overall achievement of results for the team </li><li>Good communication and interpersonal skills </li></ul><p><strong>What's in it for you?</strong></p><ul><li>Ability to work in a fast paced, collaborative environment</li><li>Full Benefits; Medical, Vision, Dental, and more!</li><li>Opportunity to get in with an industry leading organization</li></ul><p><strong>Why IDR?</strong></p><ul><li>20+ Years of Proven Industry Experience in 4 major markets</li><li>Employee Stock Ownership Program</li><li>Dedicated Engagement Manager who is committed to you and your success</li><li>Medical, Dental, Vision, and Life Insurance</li><li>ClearlyRated’s Best of Staffing® Client and Talent Award winner 8 years in a row</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20"
    },
    "company": {
        "name": "IDR, Inc.",
        "link": "https://www.linkedin.com/company/idr-inc-_2"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}