{
    "job": {
        "title": "Data Scientist",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Internet"
        ],
        "description": "<strong><u>Company<br><br></u></strong>Dandy is a business-in-a-box for dentists. Our vision is to become the operating system for every dental office in America by leading the transition to digital dentistry for the $200 billion industry. Headquartered in New York City, Dandy is backed by the world's leading venture capital investors.<br><br><strong><u>Job Description<br><br></u></strong>Dandy is hiring a xxx<br><br><strong><u>What You'll Do<br><br></u></strong><strong>What We're Looking For<br></strong><ul><li>With the above stated, we are open to candidates of all backgrounds and encourage you to apply if interested! Dandy is committed to cultivating a diverse and inclusive team and none of the above points are 100% required.<br></li></ul><strong>Bonus Points For:<br></strong><ul><li>Time spent at a venture-backed startup during hypergrowth</li><li>Relentlessly positive attitude, strong sense of humor, and the ability to have fun at work<br></li></ul><strong><u>Benefits<br></u></strong><ul><li>Best in class healthcare including medical, dental, and vision</li><li>Competitive salary and equity packages</li><li>Fully stocked kitchen with snacks and coffee</li><li>401k program <br></li></ul>Dandy is proud to be an equal opportunity employer. We are committed to building a diverse and inclusive culture and celebrate authenticity. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, disability, protected veteran status, or any other legally protected characteristics.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-11"
    },
    "company": {
        "name": "Dandy",
        "link": "https://www.linkedin.com/company/dandyofficial"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}