{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": [
            "Information Technology and Services"
        ],
        "description": "<p><strong>Job Title:</strong> Senior Site Reliability Engineer</p><p><strong>Job Location:</strong> 100% Remote</p><p><strong>Job Type:</strong> Permanent</p><p><strong>Salary:</strong> $175K, plus Benefits (and Sign on Bonus)</p><p><br></p><p>Job Overview: Our client is seeking a Senior Site Reliability Engineer for a direct-hire opportunity! This SRE role requires Object Oriented programming skills since the SRE applies full lifecycle software development techniques - production operation from scaling to handle big data analytics to building resilient, reliable infrastructure for multiple data centers and multiple cloud platforms.</p><p><br></p><p>The SRE's are embedded in their perspective product working the full-life-cycle of each product! You will be working closely with them to design, code, test, run and evolve our systems. We work closely with dozens of teams to drive the adoption of modern reliability practices like SLOs, error budget policies, actionable alerts, follow-the-sun on-call, incident retrospectives, chaos testing, with end-to-end ownership. SREs are crucial contributors to nearly every product team that has big traffic, big data, or high availability and performance requirements.</p><p><br></p><p>Responsibilities:</p><ul><li>Design, develop, ship, and motivate the creation of software and systems to increase product reliability and organizational efficiency.</li><li>Guide reliability practices through the entire software development lifecycle through activities like architecture reviews, code reviews, creating platforms and frameworks, capacity planning, and chaos testing.</li><li>Maintain service health through monitoring and follow-the-sun incident response.</li><li>Improve service reliability through blameless post-incident reviews and using c1de to prevent or respond to problem recurrence.</li><li>About You</li><li>Multy - - What cloud platform</li><li>Experience writing code in Java, Go, Shell, Perl, Python, R, Ruby, or a similar language.</li><li>Experience in data structures, algorithms, and software design.</li><li>Ability to debug, optimize code, and automate routine tasks.</li><li>Strong interest in SRE topics like SLOs, resilience, scaling, performance, and more.</li></ul><p><br></p><p>Technology Stack:</p><ul><li>Languages: Java, Python, Go, PHP, R, Ruby</li><li>Apache Projects Used: Hadoop, Kafka, Mahout, Mesos , Tomcat, Lucene, Spark, Ant, Ivy, Storm</li><li>Algorithm’s: Inverted Index, Distributed Systems, Compression, Functional Programming (java 8, etc), Mapreduce</li><li>API’s:, Rest API and Data Extract API, Google API (such as google maps, etc.)</li><li>FrontEnd: JavaScript, HTML, CSS,</li><li>Javascript Libraries: jQuery, (React), (Redux), Google Closure,</li><li>Webapp Technologies: Spring Framework, Bootstrap (Front-End Framework), Django Framework</li><li>Databases: Hbase (Hadoop), MongoDB, MySQL, NoSQL, HDFS (Hadoop Distributed Storage), redis</li><li>Storage Framework: Hadoop</li><li>Data Analytics: Imhotep, Pig,</li><li>Message Broker: RabbitMQ, Resque</li><li>Search Engine: Elasticsearch</li><li>Distributed Caching Platform: Memcached</li><li>Version Control: Git</li><li>Continuous Integration: Jenkins</li><li>Software Containerization Platform: Docker</li><li>Mobile OS: iOS, Android</li><li>Client Technologies: Imhotep, Proctor, Boxcar</li><li>Anomaly Detection: Written in Python (Twitter's AnomalyDetection and BreakoutDetection)</li></ul><p><br></p><p><br></p><p>Thank you,</p><p>Deepak Sharma</p><p>Deepak.sharma@matrixres.com</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23"
    },
    "company": {
        "name": "MATRIX Resources",
        "link": "https://www.linkedin.com/company/matrix-resources"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}