{
    "job": {
        "title": "Software Engineer, Full Stack",
        "industry": [
            "Financial Services"
        ],
        "description": "<strong>Employee Applicant Privacy Notice<br><br></strong><strong><u>Who We Are<br><br></u></strong>Shape a brighter financial future with us.<br><br>Together with our members, we’re changing the way people think about and interact with personal finance.<br><br>We’re a next-generation fintech company using innovative, mobile-first technology to help our 2+ million members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront.<br><br>We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. <strong>Join us to invest in yourself, your career, and the financial world. <br><br></strong><strong>The role<br><br></strong>We are looking for a Full Stack Software Engineer with front-end experience to join our Growth team who will help build a cutting edge technology platform supporting our Growth Referrals, Rewards, and Experimentation solutions.<br><br>On our team, you will be in the middle of it all – implementing new functionality for web and backend, squashing bugs, maintaining the health of our code, and continually growing as an engineer. You will be involved in the entire product lifecycle, from ideation through building, testing, deploying, monitoring and supporting critical systems. You’ll face and solve a wide range of challenges: technical, product, and operational, shaping your personal growth and career along the way.<br><br><strong><u>What You’ll Do<br></u></strong><ul> <li>Delivering resilient and scalable code</li> <li>Owning and ideating on technical solutions for product requirements and user stories with minimal supervision</li> <li>Participating in code and design reviews</li> <li>Generating ideas for new initiatives and technologies</li> <li>Communicating engineering concepts and efforts with outside stakeholders in product marketing, operations, business, legal, and compliance</li> <li>Working in a fast-moving, highly-collaborative environment across multiple offices</li> <br><br></ul><strong><u>What You’ll Need<br></u></strong><ul> <li>Bachelor’s Degree in Computer Science or related field</li> <li>Experience developing Web applications in React or similar technologies</li> <li>2 year programming experience, ideally on a modern stack</li> <li>Our core stack is Java/ Kotlin/ Spring / PostgreSQL/ React/Javascript. Familiarity with any OOP language and an understanding of relational databases is a great start</li> <li>Experience developing backend application in Java (Kotlin is a plus)</li> <li>Experience working in a collaborative coding environment, refining designs together, working through code reviews and managing pull requests.</li> <li>Agile Development Experience</li> <li>API Design experience</li> <li>Willingness to roll up your sleeves, collaborate with others, and get stuff done</li> <li>Strong sense of responsibility; driving a project from inception to completion</li> <li>Affinity for solving problems and diving deep into the details</li> <br><br></ul><strong><u>Why You’ll Love Working Here<br></u></strong><ul> <li>Competitive salary packages and bonuses</li> <li>Comprehensive medical, dental, vision and life insurance benefits</li> <li>Generous vacation and holidays</li> <li>Paid parental leave for eligible employees</li> <li>401(k) and education on retirement planning</li> <li>Tuition reimbursement on approved programs</li> <li>Monthly contribution up to $200 to help you pay off your student loans</li> <li>Great health &amp; well-being benefits including: telehealth parental support, subsidized gym program</li> <li>Employer paid lunch program (except for remote employees)</li> <li>Fully stocked kitchen (snacks and drinks)</li> </ul><li>These benefits are only applicable to full time employees<br><br></li>SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law.<br><br>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05"
    },
    "company": {
        "name": "SoFi",
        "link": "https://www.linkedin.com/company/sofi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}