{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": [
            "Staffing and Recruiting"
        ],
        "description": "<p>This role is starting 100% onsite in Stamford, CT! </p><p>Duration: 6 month contract (possible extensions) </p><p><br></p><p>Must-haves </p><p>-6+ years of experience as a Data Engineer and/or Machine learning Engineer </p><p>-Expert Python and SQL skills </p><p>-Experience with version control systems like Github</p><p><strong>&nbsp;</strong></p><p>Plusses </p><p>-AWS </p><p><strong>&nbsp;</strong></p><p>Day-to-Day </p><p>Insight Global is looking for a Machine Learning Engineer for one of the leading telecom providers in the Nation. This Engineer will spend 75% of their time building data pipelines and automating machine learning models, 15% working with data scientists to understand the requirements, and 5% working with the product manager to keep track of deadlines. This Engineer's main goal is to productionalize and automate the data science team's machine learning model. They want to build an automated universal model to prevent data scientists from having to build the model over and over again. Here is an example of what the machine learning model does: Whenever customers face an issue with the internet, they call tech support to resolve the issue. Whenever issue cannot be resolved over the phone, the company will send out a tech to the customer to fix the problem (they call this \"truck roll\") The machine learning model created by the team's data scientists predicts how many/which customers are going to call tech support so that they can proactively work on the issue to prevent the customer from calling or prevent having to do a truck roll.&nbsp;</p>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-12"
    },
    "company": {
        "name": "Insight Global",
        "link": "https://www.linkedin.com/company/insight-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Stamford",
        "region": "CT",
        "postal_code": "06928",
        "street_address": null,
        "latitude": 41.051926,
        "longitude": -73.539474
    }
}