{
    "job": {
        "title": "Marketing Analyst",
        "industry": [
            "Automotive"
        ],
        "description": "<p>This role will support the execution and growth of Vroom’s product-feed based acquisition channels, orchestrating a mix of proprietary and third party tools.&nbsp; This role is integral to the team and the company, as many of Vroom’s largest partnerships depend on product-feeds and third-party site merchandising. This position will work across a spectrum of external partners and internal stakeholders, including product, data, brand marketing, digital marketing, and supply.</p><p><br></p><p>Responsibilities</p><ul><li>Ensure high visibility for Vroom’s inventory across a broad spectrum of acquisition channels, via management over a suite of data-feed oriented tools</li><li>Create, deploy, and measure feed-based optimization tests</li><li>Monitor dashboards, tracking product feed health</li><li>Project manage copy and creative implementation through the spectrum of external partners</li><li>Support partnership development, onboarding, and ad-hoc marketing analysis through research, data collection, and data validation</li><li>Create, manage, and deploy website UTM tracking codes and phone numbers across the marketing organization</li></ul><p><br></p><p>Requirements</p><ul><li>Demonstrated strength in deductive reasoning, logic, numbers, and problem-solving skills</li><li>Highly sophisticated communication skills (oral and written)</li><li>Positive attitude and presentable demeanor with an ability to work collaboratively in a rapidly changing environment</li><li>Strong team player</li><li>High attention to detail</li><li>Strong work ethic, drive and stamina</li><li>Ability to work independently with intense and consistent focus</li><li>Strong organization and time management skills</li></ul><p></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Vroom",
        "link": "https://www.linkedin.com/company/vroom"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}