{
    "job": {
        "title": "Data Scientist",
        "industry": [],
        "description": "<p>The ideal candidate's favorite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the right answers.&nbsp;</p><p>&nbsp;</p><p><strong>Responsibilities</strong></p><ul><li>Analyze raw data: assessing quality, cleansing, structuring for downstream processing</li><li>Design accurate and scalable prediction algorithms</li><li>Collaborate with engineering team to bring analytical prototypes to production</li><li>Generate actionable insights for business improvements</li><li>Quickly prototype a working modeling tool and cost computation of running a ML service added to a product</li><li>Work with Product to understand user needs and iterate on the customer pain points</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree or equivalent experience in quantitive field (Statistics, Mathematics, Computer Science, Engineering, etc.)</li><li>At least 1 - 2 years' of experience in quantitative analytics or data modeling</li><li>Deep understanding of predictive modeling, machine-learning, clustering and classification techniques, and algorithms</li><li>Fluency in a programming language (Python, C,C++, Java, SQL)</li><li>Experience working in healthcare and financial systems a PLUS</li><li>Familiarity with Big Data frameworks and visualization tools (Cassandra, Hadoop, Spark, Tableau)</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09"
    },
    "company": {
        "name": "uGuru Data Sciences",
        "link": "https://www.linkedin.com/company/uguru-data-sciences"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Bellevue",
        "region": "WA",
        "postal_code": "98007",
        "street_address": null,
        "latitude": 47.6137,
        "longitude": -122.19093
    }
}