{
    "job": {
        "title": "Software Engineer, Mid",
        "industry": [
            "Information Technology and Services",
            "Defense & Space",
            "Computer Software"
        ],
        "description": "<strong>Job Number: R0112289<br><br></strong>Software Engineer, Mid<br><br><strong><u>The Challenge<br><br></u></strong>Are you looking for an opportunity to not just develop software, but to help build a system that will have a positive impact? As a full-stack developer, you can solve a problem with a complete end-to-end solution in a fast-paced, agile environment. We’re looking for a developer with the skills needed to build mission-critical software from vision to production-ready system.<br><br>We have an opportunity for you to develop your Digital skills and establish your new career. You’ll join a rigorous training program that combines skills assessments, a comprehensive curriculum, functional mentorship, a capstone Digital challenge, and support to place you on your first digital project. Equipped with the foundational Digital skills to accelerate your career, you’ll join a team and apply those skills to support our clients’ critical missions.<br><br>Empower change with us.<br><br><strong><u>You Have<br><br></u></strong><li>Experience with development languages, including Java</li><li>Knowledge of database schema design and SQL</li><li>Knowledge of the Software Development Life Cycle</li><li>Knowledge of Agile fundamentals</li><li>Top Secret clearance</li><li>HS diploma or GED<br><br></li><strong><u>Nice If You Have<br><br></u></strong><li>2+ years of experience in a technical environment</li><li>Ability to possess a thirst for knowledge<br><br></li><strong><u>Clearance<br><br></u></strong>Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Top Secret clearance is required.<br><br><strong><u>Build Your Career<br><br></u></strong>A challenging and dynamic work environment isn’t all we have to offer. When you join Booz Allen, you can expect:<br><ul><li>access to experts in virtually every field</li><li>a culture that focuses on supporting our employees</li><li>opportunities that provide stability while offering variety<br><br></li></ul>You’ll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We’ll help you develop the career you want, as you chart your own course for success.<br><br>We’re an EOE that empowers our people—no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic—to fearlessly drive change.<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20"
    },
    "company": {
        "name": "Booz Allen Hamilton",
        "link": "https://www.linkedin.com/company/booz-allen-hamilton"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "McLean",
        "region": "VA",
        "postal_code": "22101",
        "street_address": null,
        "latitude": 38.93759,
        "longitude": -77.18378
    }
}