{
    "job": {
        "title": "Staff Software Engineer",
        "industry": [
            "Computer & Network Security",
            "Computer Software"
        ],
        "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!<br><br><em>We're committed to bringing passion and customer focus to the business.<br><br></em><strong>The Role <br><br></strong>We are looking for a seasoned professional to lead, design &amp; develop our flagship spam detection products. You get to work with some of the largest threat intelligence data in the cyber security and craft peta byte scale solutions to help protect some of the most targeted people, especially in fortune 1000 companies. You’ll build hybrid systems that take the best of rules based and machine learning based approaches in real “real time” and process billions of messages every day. A few seconds could make all the difference between a security breach and a blocked message. In succeeding with Proofpoint, you help make the internet a safer place for everyone.<br><br><strong>Your day-to-day <br></strong><ul><li>You have solid understanding of algorithms &amp; data structures along with their runtime complexities.</li><li>You are confident in building and troubleshooting highly performant and multithreaded applications at scale</li><li>You understand the complexities and tradeoffs for building systems with 99.99 and 99.999% availability.</li><li>Comfortable working with cloud platforms like AWS or GCP, especially in a hybrid Private/Public cloud model</li><li>Good working knowledge of design and stability patterns</li><li>Provide technical leadership and up level to other members on the team</li><li>Demonstrate technical leadership and mentor Junior engineer as needed.</li><li>Partner with senior management on technical strategy and roadmap</li><li>Work closely with data scientists to integrate machine learning models in production<br></li></ul><strong><u>What You Bring To The Team<br></u></strong><ul><li>Bachelor’s Degree or higher in a quantitative discipline or other relevant field</li><li>10+ experience in working with large scale distributed systems</li><li>Experience with one or more of popular programming languages Go/C++/Java/Python is required</li><li>Has intellectual curiosity and stays abreast with current technologies</li><li>High accountability and a track record of delivering game changing products with quality.</li><li>Deep customer focus Always start the with customer and work backwards</li><li>Understand lean software development practices and embrace data informed decisions.</li><li>Challenges status quo and looks for continuous improvement in systems and processes.<br></li></ul><em>If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!<br><br></em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18"
    },
    "company": {
        "name": "Proofpoint",
        "link": "https://www.linkedin.com/company/proofpoint"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Carson City",
        "region": "NV",
        "postal_code": "89721",
        "street_address": null,
        "latitude": 39.16458,
        "longitude": -119.76692
    }
}