{
    "job": {
        "title": "Data & Applied Scientist",
        "industry": [
            "Computer Hardware",
            "Computer Software",
            "Information Technology and Services"
        ],
        "description": "What if your job description were: make tomorrow better? That is the essence of roles within our Microsoft Web Experiences Team (WebXT). <br><br> <br><br>Every day, we bring an insatiable curiosity to the table, challenging ourselves to reimagine what is and what can be. We drive machine intelligence, help shape the future, and empower billions of people around the globe. <br><br> <br><br>We attract new users and change how people think about Microsoft, News, Search, and Advertising. We have a long road ahead, and we need your help! Our products Bing, Content, and Advertising are the beating heart of Microsoft AI.<br><br> <br><br>Join us to keep optimizing and growing our Online Advertising business, one of the fastest-growing businesses on the Internet today, while delighting users with useful ads. Or derive intelligence from MSN, Bing, Web data to delight sports fans and bring the best news to our users. Or make it easy for employees to discover their enterprise content from various data sources exposed through searches on the browser for improved productivity.<br><br> <br><br>Our Data and Applied Scientist roles provide an opportunity to research and apply state of the art machine learning technology to various businesses involving Search, Content, and Advertising.<br><br><strong>Interviews for the Data &amp; Applied Scientist will be conducted in partnership with Microsoft’s HBCU Connect event. By applying to this role, you’ll be assessed for multiple, identical positions on several teams.<br><br></strong><strong><u>Responsibilities<br></u></strong><ul><li>Design, prototype, and build Machine Learning Models to derive actionable intelligence for our products: MSN, Bing, Advertising.</li><li>Analyze and take decisions based on complex and ambiguous (big) data points.</li><li>Work closely with our PM, design, and privacy teams to define feature specifications and build the next generation of products.</li><li>Contribute to creating knowledge around user/query intent understanding, document/ad understanding, user targeting, relevance modeling, user response prediction, using large scale machine learning algorithms</li><li>Experimentation infrastructure, including tools for configuring and launching experiments, dashboard, live marketplace monitoring, and diagnosis. </li><li>Work with science and engineering team to architect and develop operational models that run at scale</li><li>Partner with other teams to identify and explore opportunities for product improvement<br></li></ul><strong><u>Qualifications<br><br></u></strong><strong>Required Qualifications:<br></strong><ul><li>1+ years of industry experience designing, developing, and shipping software or developing models for machine learning.</li><li>A minimum of a Bachelors degree in Computer Science, or a related field, or equivalent alternative education, skills, and/or practical IT work experience is required.<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li>Experience in at least one deep learning framework such as PyTorch, TensorFlow, etc.</li><li>Strong coding abilities in C#, C++, Java, R, or Python.</li><li>Familiarity with distributed data processing/analysis and modeling paradigms, such as Map-Reduce.</li><li>Being able to tackle vaguely formulated problems while understanding the underlying business notion.</li><li>Great problem solving and analytical skills.</li><li>Passionate, self-motivated.</li><li>Effective communication skills, both verbal and written.<br></li></ul>Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.<br><br>Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Microsoft",
        "link": "https://www.linkedin.com/company/microsoft"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Redmond",
        "region": "WA",
        "postal_code": "98073",
        "street_address": null,
        "latitude": 47.67491,
        "longitude": -122.12399
    }
}