{
    "job": {
        "title": "Senior Mechanical Engineer (Hospital/Laboratory Facilities)",
        "industry": [
            "Construction",
            "Civil Engineering",
            "Transportation/Trucking/Railroad"
        ],
        "description": "ATS Job ID- R118186, Job Location- US-VA-Centreville<br><br><strong><u>Minimum Clearance Required To Start<br><br></u></strong>Not Applicable/None<br><br><strong><u>Job Description<br><br></u></strong>Parsons is an industry leader in delivering technology driven solutions to promote safer, healthier and sustainable world class infrastructure to communities throughout the world. Our landmark projects and capital improvement programs support global initiatives in healthcare, infrastructure, water, energy, power, renewables, environmental, and education. We are hiring colleagues with an entrepreneurial spirit who thrive on professional challenges in a high energy environment.<br><br>We are hiring Senior Mechanical Engineers with hospital/laboratory facility condition assessment and design experience. In this role, you will put your HVAC, plumbing, and piping systems and equipment survey, assessment, and design experience to good use for our clients, making design, performance, repair, and replacement recommendations that improve healthcare environments.<br><br>As a Senior Mechanical Engineer, you will perform onsite inspections of existing hospital and laboratory facilities and compose detailed narrative reports on the engineering systems and provide conceptual design for recommended new construction and system replacement projects. In addition, you will use Parsons and other client-directed online tools to record information and produce cost estimates for the proposed projects. Responsibilities will include working on professional teams to perform facility assessments and provide consulting support for infrastructure master planning assignments.<br><br><strong><u>Key Responsibilities<br></u></strong><ul><li>Conduct onsite inspections of HVAC and plumbing systems and equipment, as well as review design drawings, equipment specifications, calculations, and other documents for both large and small assessment projects.</li><li>Assess existing HVAC and plumbing systems and equipment for safety, condition, age, capacity, and design compliance with applicable standards, codes, and regulations.</li><li>Plan, direct, and supervise the assessment work of other engineers and architects.</li><li>Assist with preparing client presentations and proposal responses.<br><br></li></ul><strong><u>Requirements<br><br></u></strong>Successful candidates will have a strong familiarity with:<br><ul><li>AIA Guidelines for Design and Construction of Healthcare Facilities</li><li>NFPA 99 Standard for Healthcare Facilities</li><li>CDC Guidelines for Environmental Infection Control in Health-Care Facilities</li><li>Joint Commission Standards</li><li>Office of Statewide Health Planning and Development (OSHPD)</li><li>Title 24 Building Energy Efficiency Standards (CA)</li><li>ASHRAE Std 62.1 Ventilation for Acceptable Indoor Air Quality</li><li>ASHRAE 170 – Ventilation for Healthcare Facilities</li><li>RSMeans CostWorks Estimating Tool</li><li>Autodesk Revit BIM software and unified modeling environment<br><br></li></ul><strong><u>Successful Candidates Must Also Have<br></u></strong><ul><li>Willingness to travel to client offices and jobsites is expected as well as the ability to perform site and facility walk downs as required to conduct condition assessments.</li><li>Strong written and verbal communication skills.<br><br></li></ul><strong><u>Required Education/ Professional Registration<br></u></strong><ul><li>BS in Mechanical Engineering</li><li>Registered Engineer with 10+ years of post-graduate professional mechanical engineering and design experience for hospitals and laboratory facilities.</li><li>ASHRAE Healthcare Facility Design Professional Certification is also preferred.<br><br></li></ul>Benefits for this position include: medical, dental, vision, paid time off, Employee Stock Ownership Plan (ESOP) and 401K.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15"
    },
    "company": {
        "name": "Parsons Corporation",
        "link": "https://www.linkedin.com/company/parsons"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Centreville",
        "region": "VA",
        "postal_code": "20122",
        "street_address": null,
        "latitude": 38.840027,
        "longitude": -77.423164
    }
}