{
    "job": {
        "title": "Software Engineer - Frontend",
        "industry": [
            "Computer Software"
        ],
        "description": "<p>Who Are We?</p><p>MemberSuite, Inc. is an enterprise Software Service (SaaS) company based in Atlanta, GA. With over 20&nbsp;modules, our MemberSuite platform powers the back office processes for more than 100 medium and large associations and non-profits, providing order processing, member self-service, and e-marketing.</p><p><br></p><p>For the past few years, we have focused on increasing the horsepower of our product and now believe we are ready for the appropriate facelift to make our UI match our platform’s capabilities. We are looking&nbsp;for an experienced Software Engineer to led the rebuild of our platform’s User Interface to support and fuel our growth in the market.</p><p>&nbsp;</p><p>What You’ll Do</p><ul><li>Design and implement the fundamentals of a UI framework to support future needs</li><li>Collaborate on the UI design and UX with our team to produce a strong market toolset</li><li>Demonstrate strong communication skills to collaborate as full software team to move the platform forward</li><li>Lead the front end team to share the responsibilities of the development and plan</li><li>Mentor engineers early in their career to develop their skills</li><li>Design and implement a testing environment to ensure reliability and confidence</li></ul><p>&nbsp;</p><p>What We’re Looking For:</p><ul><li>4+ years of experience producing and working with high-end web interfaces</li><li>Strong background in UI design, methodologies and development</li><li>Experienced in web-based technologies, including HTML code, CSS layout, AngularJS, JavaScript/jQuery</li><li>Knowledge in programming and working with APIs and Restful Web Services</li><li>Write automated test suites</li><li>Work with product managers and designers to define the scope of each new feature / product</li><li>Good communication. Both written and face-to-face communication is a key part of building a great product.</li><li>A Team mentality. This role requires you to work and collaborate well with other engineers, designers, and those from other teams</li><li>Passion for learning new technologies, and is quick to understand and use them</li><li>Driven by results and delivering a high-quality product to our customers</li><li>PLUS: Hands on experience with .NET / C#</li></ul><p>&nbsp;</p><p>What We Are Offering</p><ul><li>Paid Vacation and Flexible Work Environment</li><li>Meaningful work on creative and flexible tools used in the hands of real users</li><li>Access to 401K, Life, Short Term, Long Term and Disability Insurance Plans</li><li>Casual dress work environment</li><li>Flexible Work Hours</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10"
    },
    "company": {
        "name": "MemberSuite, Inc.",
        "link": "https://www.linkedin.com/company/membersuite-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}