{
    "job": {
        "title": "Software Engineer",
        "industry": [],
        "description": "<p>OPPORTUNITY:&nbsp;</p><p>Clip Automation is looking for a hands-on Software Engineer responsible for design, development, testing, and deploying our enterprise software on the cloud. If you are a highly organized, software-savvy individual with experience in fast-paced, startup-to high-growth-phase technology companies, let’s talk!&nbsp;&nbsp;</p><p><br></p><p>This is an opportunity to be a part of the exciting early stages of a Silicon Valley-based startup that has massive growth and venture potential. Founded by former Apple engineers, we help companies drive innovation and unlock efficiencies by digitizing and automating manufacturing operations. We provide cloud and edge platforms that leverage AI, ML and IOT.&nbsp;McKinsey projects that Manufacturing and Healthcare can save $2.3 trillion over the next 10 years using a productivity-driven model.</p><p><br></p><p>We are looking for a collaborative self-starter who is passionate about solving complex problems and building disruptive software in a relatively undefined market.&nbsp;&nbsp;</p><p><br></p><p>This role is based in Palo Alto, CA but is fully remote until further notice.&nbsp;Candidates based in the SF Bay Area are highly preferred as you will be working on-site with work from home flexibility post-pandemic.</p><p><br></p><p>DUTIES / RESPONSIBILITIES:</p><p><br></p><p>The essential functions include, but are not limited to the following:</p><ul><li>Full development life-cycle design from project requirement to deployment.</li><li>You will produce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration.</li><li>You will develop multi-tier scalable, high-volume performing, and reliable applications that operate 24x7.</li><li>Own and manage the cloud infrastructure and deployments for Clip&nbsp;</li><li>Containerize existing applications&nbsp;&nbsp;</li><li>Drive innovation and bring new technologies to make deployment faster and robust</li><li>Build infrastructure to facilitate rapid deployments to production</li><li>Documenting findings and recommendations for improvement</li><li>Work with onshore and offshore development teams to resolve problems fast&nbsp;</li></ul><p>&nbsp;&nbsp;</p><p>REQUIRED SKILLS / ABILITIES:</p><p>&nbsp;</p><ul><li>Bachelor's degree in Computer Science or related technical discipline</li><li>2+ years of Software Development experience, ideally in a growth-stage environment</li><li>Experience developing applications using Python,Java, OpenCV, Flask, RabbitMQ, Kafka, MySQL and Postgres</li><li>Experience in deploying AWS services: EC2, ECS, EKS, S3, Lambda,Cognito, IAM, RDS, VPC, Elastic Search, API/IP/NAT Gateway, and CloudWatch</li><li>Strong Experience with Unix/Linux</li><li>Experience with virtualization and containerization platforms (Docker), container orchestration tools (Kubernetes).</li><li>Experience with Agile development processes. Jira, Bitbucket is a&nbsp;plus</li></ul><p><br></p><p>Travel:&nbsp;Domestic and International.&nbsp;As required by business needs.&nbsp;&nbsp;</p><p>&nbsp;</p><p>At Clip we offer a competitive benefits package that includes Health, Dental, Vision, Life Insurance, 401(k) and Unlimited PTO.</p><p>&nbsp;</p><p>Clip is an equal opportunity employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.</p><p><br></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09"
    },
    "company": {
        "name": "Clip Automation",
        "link": "https://www.linkedin.com/company/clip-automation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}