{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<p><strong>Software Engineer</strong></p><p><strong>West Chester, PA (Temporarily Remote)</strong></p><p><strong>Contract-to-Hire</strong></p><p><strong>$35 -$40/hr Depending on Experience</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p><p>We are seeking to hire a Software Engineer to be responsible for planning and designing new software and web applications. You will edit new and existing applications, test and debug defined software components, and document all development activity. You will work with guidance from senior-level engineers on designs and implementation.</p><p><br></p><p>If you feel that describes you, keep reading and apply!</p><p><br></p><p><strong>Responsibilities&nbsp;</strong></p><ul><li>Analyzes and determines integration needs.</li><li>Evaluates and plans software designs, test results and technical manuals.</li><li>Reviews literature, patents and current practices relevant to the solution of assigned projects.</li><li>Programs new software, web applications and supports new applications under development and the customization of current applications.</li><li>Edits and reviews technical requirements documentation.</li><li>Works with Quality Assurance team to determine if applications fit specification and technical requirements.</li><li>Displays knowledge of engineering methodologies, concepts, skills and their application in the area of specified engineering specialty.</li><li>Displays knowledge of and ability to apply, process design and redesign skills.</li><li>Displays in-depth knowledge of and ability to apply, project management skills.</li><li>Consistent exercise of independent judgment and discretion in matters of significance.</li></ul><p><br></p><p><strong>Core Qualifications&nbsp;</strong></p><ul><li>Typically requires 1-3 years of professional work experience</li><li>Bachelor's Degree in Computer Science, Engineering, or related field</li><li>Experience and a solid understanding of the core Java platform and Spring Framework&nbsp;</li><li>Experience in designing, building, testing, and deploying software solutions in an agile environment</li><li>Experience developing within an Agile environment&nbsp;&nbsp;</li></ul><p><br></p><p><strong>What’s In It For You?</strong></p><ul><li>You will be exposed to new technologies in an enterprise environment</li><li>You will be trained and mentored by senior technologists</li><li>You will go through a program aimed around professional development</li></ul><p><br></p><p><em>Eight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws.</em></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10"
    },
    "company": {
        "name": "Brooksource",
        "link": "https://www.linkedin.com/company/brooksource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "West Chester",
        "region": "PA",
        "postal_code": "19381",
        "street_address": null,
        "latitude": 39.96048,
        "longitude": -75.60522
    }
}