{
    "job": {
        "title": "Software Engineer, Integration Development - Austin, TX",
        "industry": [
            "Marketing and Advertising",
            "Online Media",
            "Internet"
        ],
        "description": "LockerDome is an ad platform with a brain, designed specifically for performance-based advertising. The brain behind the platform is Neo, an in-house AI, which uses machine learning to process billions of data points and make intelligent decisions at lightning speed. Learn more at lockerdome.com.<br><br>As a Software Engineer, Integration Development on the Engineering &amp; Product team, you will work on advertiser and publisher integrations as well as related infrastructure and tools.<br><br>This position reports to our Austin-based Principal Engineer. Candidates residing in (or near) Austin, TX are preferred.<br><br><strong><u>Your Skills Should Include<br></u></strong><ul><li> Proficiency with of JavaScript and Node.js</li><li> Proficiency with web development and the web development landscape</li><li> Ability to learn new skills and information sets quickly</li><li> Ability to solve unique or complex problems and provide actionable guidance</li><li> Strong debugging skills</li><li> High attention to detail</li><li> Strong verbal and written communication skills</li><li> At least 2 years of web development experience<br></li></ul><strong><u>Responsibilities<br></u></strong><ul><li> Work closely with LockerDome's data and sales teams to provide support for client-facing integration needs</li><li> Implement and maintain infrastructure related to advertiser and publisher integrations</li><li> Implement and maintain tools that help teams at LockerDome analyze the potential and current status of publisher and advertiser integrations</li><li> Expand upon and update documentation related to technologies we work with when integrating with advertisers and publishers<br></li></ul><strong><u>Work From Anywhere<br><br></u></strong>We know world-class talent lives all over the country, so we’re proud to offer employees the flexibility to work remotely from anywhere in the U.S. Whether it’s your living room, an Airbnb, or one of LockerDome’s hubs in St. Louis or Austin, every employee can choose a work environment that best suits their lifestyle or mood.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-12"
    },
    "company": {
        "name": "LockerDome",
        "link": "https://www.linkedin.com/company/lockerdome"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "St Louis",
        "region": "MO",
        "postal_code": "63121",
        "street_address": null,
        "latitude": 38.635357,
        "longitude": -90.20099
    }
}