{
    "job": {
        "title": "Data Scientist",
        "industry": [],
        "description": "<p><strong><u>Help Create the Future of Our World's Buildings</u></strong></p><p><br></p><p><strong>ABOUT ONBOARD&nbsp;</strong></p><p>The real estate industry’s lack of data interoperability remains a persistent bottleneck to widespread adoption of intelligent building software. Software developers, data scientists and analysts use Onboard’s software to eliminate this barrier, and quickly acquire data for their smart building applications. It’s our mission to provide easy access to building data, and power the future of digital building services. Onboard’s innovative platform uses machine learning and deep learning to rapidly classify and integrate various data streams, enabling data use-cases across energy efficiency, tenant comfort, security, maintenance, among others.&nbsp;</p><p>Onboard is a bootstrapped business headquartered in Somerville, MA, and is the recipient of several awards from the US Department of Energy, Massachusetts Clean Energy Center and Accel VT. Onboard was founded in 2018, and the founding team has experience from seed stage to acquisition, across hardware and software products.&nbsp;&nbsp;</p><p><br></p><p><strong>ABOUT THE ROLE</strong></p><p>In your first week, you can expect to develop and deploy a scraper to compile data from the web. In your first month, you will employ machine learning techniques to extract data from documents and refine our existing machine learning products. In your first year, you will implement, evaluate and productize deep learning models from a variety of IoT data sources, and contribute to technical literature and intellectual property reporting.&nbsp;</p><p><br></p><p><strong>Qualifications</strong></p><ul><li>Examples of prior success, achievements or work products in the field of ML and AI&nbsp;</li><li>Experience with deep learning frameworks such as Keras, PyTorch, TensorFlow, Theano, MXNet&nbsp;</li><li>Proficient with Python, R and data visualization tools&nbsp;</li><li>A collaborative team member who is comfortable with ambiguity and eager to contribute beyond their expertise, in other areas of the business&nbsp;</li><li>A self-directed researcher who can independently develop hypotheses, design experiments, set and meet milestones, evaluate results and clearly communicate outcomes to a diverse team&nbsp;</li><li>An MS or PHD in Computer Science, Engineering, Applied Mathematics, or Physics&nbsp;</li></ul><p><br></p><p><strong>Compensation and Wellness</strong></p><ul><li>Ranges: $100,000 - $120,000 | 1% - 2% stock option plan&nbsp;</li><li>Health insurance, 401K retirement plan&nbsp;</li><li>4 weeks paid time off, up to 24 hours paid time off for volunteering&nbsp;</li><li>Greentown co-working office and remote work capable&nbsp;</li></ul><p><br></p><p><strong>INTERVIEW PROCESS</strong></p><p><br></p><ul><li>Email your resume to careers@onboarddata.io</li><li>20 minute phone screen</li><li>60 minute cultural Zoom fit Interview</li><li>Compensated take-home programming challenge&nbsp;</li><li>90+ minute Technical &amp; Design Zoom Interview&nbsp;</li><li>We ask for two references, which can be provided at any time&nbsp;</li></ul><p><br></p><p>We Look Forward to Hearing from You!</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05"
    },
    "company": {
        "name": "Onboard",
        "link": "https://www.linkedin.com/company/onboard-data"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Somerville",
        "region": "MA",
        "postal_code": "02143",
        "street_address": null,
        "latitude": 42.389122,
        "longitude": -71.097145
    }
}