{
    "job": {
        "title": "Senior Software Engineer - Payments",
        "industry": [
            "Internet"
        ],
        "description": "Description:<br><p>Paysign is looking for an experienced expert-level software engineer to join our team in a critical<br><br></p><p>role. This position is responsible for building, maintaining, and troubleshooting core payments<br><br></p><p>transaction systems, APIs, and data, primarily using core Java technologies. In this role, you<br><br></p><p>will be designing and building new APIs for the core systems, supporting existing APIs, as well<br><br></p><p>as taking on ownership of code enhancements and projects related to these systems. Our<br><br></p><p>systems are high performing and highly available; therefore, you must have deep experience in<br><br></p><p>building and maintaining these kinds of world-class systems. We are looking for solid and experienced people ready to join a highly talented and focused engineering organization. Experience in the payments and/or financial transaction processing domains is required.<br><br></p><p><br><br><br></p><p><strong>Essential Functions<br><br></strong></p><ul><li>Be the expert on our core back-end systems (financial transaction processing)</li><li>Design, build, test, and support new and existing APIs for the core systems</li><li>Design, build, test, and support new/existing functionality in core systems</li><li>Building additional tools and applications as needed to support operations</li><li>Define, design, and build new code and systems for future capabilities</li><li>Troubleshoot and debug core applications</li><li>Assist with operational support for core systems</li></ul>.<br><br>Requirements:<br><ul><li>Expert level Java Programmer</li><li>Deep understanding/experience with Payments/FinTech software, protocols, and processes</li><li>Proficient in other programming languages and tools (preferably C#, Go, Python, etc.)</li><li>Deep understanding of concurrency and transactions</li><li>Hands-on experience with high-volume transactional systems and clustered applications</li><li>Expert in reading, understanding, and internalizing existing codebases</li><li>Proficiency with database technologies (SQL, ORM)</li><li>Experience with both REST and SOAP API design and implementations</li><li>Commitment to testing at all levels of system engineering</li><li>A mindset of Operational Excellence</li><li>Excellent written, verbal, and interpersonal skills</li></ul><p><strong>Education/Experience<br><br></strong></p><ul><li>Bachelor's degree in a technical discipline such as computer science, information systems or related field, or equivalent related experience.</li></ul><p>Job Type: Full-time, on-site<br><br></p><p><br><br><br></p><p>PM20<br><br></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23"
    },
    "company": {
        "name": "Paysign, Inc.",
        "link": "https://www.linkedin.com/company/paysign"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Henderson",
        "region": "NV",
        "postal_code": "89009",
        "street_address": null,
        "latitude": 36.034096,
        "longitude": -114.98445
    }
}