{
    "job": {
        "title": "Data Scientist - Remote",
        "industry": [
            "Pharmaceuticals",
            "Biotechnology",
            "Medical Devices"
        ],
        "description": "<p><br><strong>*This is a remote opportunity.</strong> </p><p><br><strong> The Opportunity  </strong></p><p>This is an exciting time to join Roche Diagnostics! You will help Roche continue to progress through the data maturity model using data science methods and principles to generate deeper insights from a great variety of internal and external data sources. To achieve this, you will identify needs, lead the design and implementation of analytical solutions, provide advice and consulting support to our key business stakeholders and demonstrate value by executing proof-of-concept initiatives and prototyping analytical solutions to answer business questions.</p><p>As a Data Scientist, you will position data science as a key competency within the enterprise and be responsible for creating value from data assets using advanced analytics capabilities including data science, machine learning, and artificial intelligence methodologies to identify critical business risk and opportunities for Roche.  </p><p>You have an overall understanding of the key challenges in our industry. You have experience in the areas of analytics, data transformation, and data science. You are passionate about applying state-of-the-art analytical methods, as well as cutting edge machine learning algorithms to find solutions to complex business problems.  </p><p> <br><strong>What you’ll be working on </strong> </p><ul><li><p>Identify high-impact data science use cases, develop and implement innovative solutions to drive business impact and develop state-of-the-art analytical capabilities to address identified needs. </p></li><li><p>Evaluate, drive and implement solutions from concept to minimum viable product and final product </p></li><li><p>Apply analytical and statistical methods to solve identified use cases in an agile manner using multiple data sources and analytical tools </p></li><li><p>Collaborate within cross-functional teams to develop solutions, gain alignment and deliver impactful business insights; engage necessary stakeholders to enable better decision-making </p></li><li><p>Interpret and communicate analytics results clearly and concisely to audiences with varying backgrounds and degrees of technical understanding. </p></li><li><p>Take an enterprise mindset, linking individual responsibilities with the broader organization; focus on outcomes that provide most business value </p></li><li><p>Partner with data science experts around the world within Roche to share best-in-class solutions and drive collaborative approaches towards data science challenges.</p></li></ul><p> <br><strong>Who you are </strong> </p><ul><li><p>You have a Bachelor’s degree in Computer Science, Statistics, Bioinformatics, Mathematics or equivalent field. </p></li><li><p>You have at least 2 years of commercial/industry experience, working in a hands-on capacity as a Data Scientist. At least 4 years of experience is preferred. </p></li></ul><p> <br><strong>Preferred Qualifications </strong> </p><ul><li><p>Ability to work independently, prioritize within an interdisciplinary environment that includes (data) scientists, analysts, business stakeholders and consultants</p></li><li><p>Excellent communication and effective problem-solving skills; track record in serving a variety of diverse customers and projects </p></li><li><p>Willingness to guide and inspire business stakeholders, data scientists and other colleagues along the journey into the world of data science.</p></li></ul><p>CO applicants are not eligible<br></p><strong>Roche is an equal opportunity employer</strong> and strictly prohibits unlawful discrimination based upon an individual’s race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, mental/physical disability, medical condition, marital status, veteran status, or any other characteristic protected by law.If you have a disability and need an accommodation in connection with the on-line application process, please email us at  US.Accommodation@roche.com  .<br><br>Roche is an equal opportunity employer and strictly prohibits unlawful discrimination based upon an individual's race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, mental/physical disability, medical condition, marital status, veteran status, or any other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09"
    },
    "company": {
        "name": "Roche",
        "link": "https://ch.linkedin.com/company/roche"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Indianapolis",
        "region": "IN",
        "postal_code": "46203",
        "street_address": null,
        "latitude": 39.76845,
        "longitude": -86.15621
    }
}