{
    "job": {
        "title": "Data Analytics Engineer",
        "industry": [
            "Marketing and Advertising",
            "Internet",
            "Retail"
        ],
        "description": "Analytics Engineer who will be responsible for building and maintaining complex systems for the purpose of aggregating, visualizing and interpreting critical business data sets.<br><br><strong><u>What Your Day Will Look Like<br></u></strong><ul><li>Drive the design, development, and maintenance of innovative and scalable intelligence solutions across the organization, with the highest standards of analytical rigor and data integrity.</li><li>Solicit input from business partners in marketing to define problems and propose solutions including supporting overall data strategies and partnership pipelines</li><li>Develop domain expertise and drive major contributions to our data and research roadmap. Leverage our analytics tools to uncover deep business insights and trends.</li><li>Build upon and document our common data framework so that all data can be connected, clean, and ready for analysis.</li><li>Help to define and improve our internal standards for style, maintainability, and best practices for a high-scale data infrastructure. Write clean, maintainable and well-documented code to support our data processes.</li><li>Translate ambiguous business problem statements into actionable analytical solutions.</li><li>Manage large scale data requests and projects to define requirements, manage timelines, and coordinate activities with other involved team members.</li><li>Proactively identify and implement solutions to reduce manual data entry wherever possible.</li><li>Strong verbal/written communication &amp; data presentation skills, including an ability to effectively communicate with business leaders and technical teams<br></li></ul>IDEAL CANDIDATES WILL HAVE<br><ul><li>Bachelor’s Degree in quantitative field and/or equivalent work experience or education</li><li>Expert SQL knowledge (5+years), ability to write efficient and optimized code</li><li>Experience (3+years) with Modern scripting languages (e.g. Python)</li><li>Experience with Data visualization and dashboarding tools (Tableau, Salesforce, Looker, etc)</li><li>Proven ability to solve complex quantitative business challenges.</li><li>Cloud data pipelines (e.g Fivetran, Stitch)</li><li>Google Cloud ecosystem</li><li>Positive attitude</li><li>Entrepreneurial mindset (able to work independently as well as with a team)</li><li>Intellectual curiosity</li><li>Strong interpersonal and communication skills</li><li>High level of accuracy and attention to detail<br></li></ul>Powered by JazzHR<br><br>YjkGjViumZ",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-03"
    },
    "company": {
        "name": "310 Nutrition",
        "link": "https://www.linkedin.com/company/310-nutrition"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}