{
    "job": {
        "title": "UXDesign Researcher (multiple locations, listed in description)",
        "industry": [
            "Banking",
            "Financial Services"
        ],
        "description": "<p><strong>*Positions will be located in Earth City (St. Louis) MO, Minneapolis, San Francisco, New York City, Atlanta, Charlotte, Chicago, Cincinnati or Dallas and will require working in office in a hybrid model in Jan 2022</strong></p><p><br></p><p>U.S. Bank is expanding the User Experience Design (UXDesign) team in support of our business transformation to a human centric experience. This is no “business as usual” group. In order to succeed, we need people who have high energy and aren’t afraid to dive in. <strong>We have multiple opportunities open for UXDesign Researcher and Senior Researchers. </strong>This is a great opportunity to bring brilliant digital experiences to our customers in helping to ensure U.S. Bank is central to our customers wherever they go!</p><p>&nbsp;</p><p>Responsibilities include:</p><p><br></p><ul><li>Conducts and delivers UXDesign research work that meets or exceeds the stated business goals and which is clearly and objectively measured and reported to prove our return on design investment.</li><li>Leads and crafts UXDesign research to ensure excellence in research, facilitation, artifacts, presentation skills, and distilling actionable insights for partners.</li><li>Partners effectively with other UXDesign disciplines, business line clients, product and channel management, marketing, analytics, delivery PMO, Information Technology and other teams to strengthen relationships and understand the business while delivering solid research.</li><li>Derives measurable objectives against which UX research work will be evaluated for success.</li></ul><p> </p><p><strong> </strong></p><p><br></p><p><strong>Basic Qualifications</strong></p><p>- Bachelor’s degree, with an emphasis on UX, design research, psychology, social science or another relevant field preferred, or equivalent experience</p><p>- Three to five years of UX design research experience</p><p>-Five to seven years of UX design research experience<strong> (for Senior Researcher)</strong></p><p> </p><p>Preferred Skills/Experience</p><p>- Familiar with a variety of research methodologies, when to apply them, and when to make tradeoffs</p><p>- Ability to deliver impactful and clear UX design research in a way that drives and directs better product/project outcomes</p><p>- Effective presentation, verbal and written communication skills, and ability to facilitate collaborative sessions</p><p>- Familiar with agile project management and how UX research functions within it</p><p>- Demonstrated analytical, decision-making and problem-solving skills</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05"
    },
    "company": {
        "name": "U.S. Bank",
        "link": "https://www.linkedin.com/company/us-bank"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Earth City",
        "region": "MO",
        "postal_code": "63045",
        "street_address": null,
        "latitude": 38.768604,
        "longitude": -90.46715
    }
}