{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<strong>Site Reliability Engineer - Unicorn startup w/ Revenue<br><br></strong>This Jobot Job is hosted by Adam Bennett<br><br>Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.<br><br><strong>A Bit About Us<br><br></strong>We’re a software company that has built a PaaS product that enables large enterprises to automate business decisions! We have a long list of current clients and have a line out the door of companies who want to integrate our platform into their supply chain, inventory, sales, and operation applications!<br><br><strong><br><br><strong>Why join us?<br><br><br></strong></strong>We’re at an inflection point. We’re scaling our teams and potentially doubling our company in size! We’re currently over 300 people. We have a culture-first organization and the leader of the DevOps / SRE team wants to see everyone succeed. We’re looking for engineers to help us scale! We’re an AWS/ Azure shop and rely heavily on Kubernetes for scale.<br><br><strong>Job Details<br><br></strong>Must have Senior experience with deploying and maintaining Kubernetes.<br><br>Ideally, you have Sr. level experience with a scripting language to scale infrastructure.<br><br>Senior experience supporting cloud applications in AWS or Azure.<br><br>Monitoring applications are a really big “nice to have”<br><br>Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-22"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}