{
    "job": {
        "title": "C++ Software Engineer/Software Architect",
        "industry": [
            "Semiconductors",
            "Computer Software",
            "Computer Hardware"
        ],
        "description": "<strong>At Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. If you share our passion for innovation, we want to meet you. <br><br></strong>The Simpleware team at Synopsys (Exeter, UK) develops state of the art software for the visualisation and analysis of 3D images (e.g., CT/MRI images) enabling engineers and researchers around the world to take their scan data to the next level (data analysis, link to CAD and simulation packages). Our customers range from international blue-chip corporations, research institutions to universities in fields as varied as medical (implants design, cardiovascular applications), materials analysis and industrial manufacturing.<br><br>For more information on the Simpleware team, please see http://www.synopsys.com/simpleware.html .<br><br>As a C++ software architect, you will be in charge of the design of existing and future applications developed by the team. You will also be involved in the implementation of new software features.<br><br><strong><u>Responsibilities And Duties<br></u></strong><ul><li>Work with the R&amp;D Manager to ensure the overall software architecture enables the timely implementation of new features and products. </li><li>Work within a team of experienced software developers, considering their opinions and making architectural decisions for the team to ensure the consistent quality of designs. </li><li>Develop relationships with members of the local support and test team, for requirements capture and issue resolution. </li><li>Create working prototypes (proofs of concepts) at varying degrees of fidelity. </li><li>Maintain and develop knowledge of current and new technologies, evaluating and integrating new technologies where appropriate. </li><li>Assist other developers in expanding and improving specific aspects of their technical skillset. </li><li>Review and provide feedback on the early-stage implementation of new features including identification of opportunities for inter-feature collaboration. </li><li>Implement new features whilst demonstrating expert design and development skills. </li><li>Identify existing design limitations and resolve these through refactoring. </li><li>Ensure that best practices are adhered to throughout the development team. <br></li></ul><strong><u>Required<br></u></strong><ul><li>A degree in Computer Science, Software engineering, Applied mathematics, or similar, preferably a first or 2:1. </li><li>Expert knowledge and experience of C++, preferably C++17 or later. </li><li>A strong desire to learn and explore new technologies. </li><li>Self-motivation and the ability to work independently whilst being a team player and keeping an eye on the team’s goals. </li><li>The ability to communicate effectively with a range of people in spoken and written English. <br></li></ul><strong>Desirable <br></strong><ul><li>Visual C++ </li><li>GCC </li><li>Git and GitLab </li><li>Linux </li><li>CMake </li><li>Catch2 </li><li>Qt or wxWidgets </li><li>C# </li><li>Python </li><li>Image processing algorithms </li><li>VTK </li><li>ITK </li><li>Keras/Tensorflow </li><li>DICOM <br></li></ul><strong><u>Other Employment Information<br></u></strong><ul><li>Location: based in Exeter, UK. </li><li>Remuneration: very attractive, competitive package. </li><li>Duration: permanent employment contract. <br></li></ul><strong><u>Additional Information About Exeter<br><br></u></strong>Exeter is a university city with excellent shopping and options for eating out, and is only 25 minutes from the sea and Dartmoor National Park. Exeter also has direct rail links to London and major cities in the UK and benefits from direct flights to a number of European cities.<br><br><strong><u>Additional Information About The Work Environment<br><br></u></strong>You will be joining the Simpleware development team, a team with diverse expertise, experience and interests in software development, and will enjoy a creative and international work environment.<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14"
    },
    "company": {
        "name": "Synopsys Inc",
        "link": "https://www.linkedin.com/company/synopsys"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Great Valley",
        "region": "NY",
        "postal_code": "14741",
        "street_address": null,
        "latitude": 42.21436,
        "longitude": -78.63654
    }
}