{
    "job": {
        "title": "C++ Developer",
        "industry": [],
        "description": "Job Title : Software Engineer C++<br>Location: Salt Lake City , UT<br>Job Type: Contract<br><br>Job Description <br>Software Engineer -C++ Linux . Experience in Python, Shell scripting. Nice to have experience in Java, GWT, and QT. <br><br>Roles & Responsibilities: <br>Participate in requirement analysis, design, coding, and testing (manual as well as automation) <br>Ability to understand/learn architecture and design of existing applications developed mainly using C++ <br>Take ownership of assigned jobs that are part of new feature implementation, bugfixes and enhancement activities <br>Technical communication with internal/external stake holders and collaboration with global team will be part of job. <br><br>Required Skills (Technical Competency): <br>3-5 years of experience in design and development of C++ software applications and frameworks in Windows /Linux. <br>Experience in requirement analysis, design development, coding, code review and unit testing. <br>Hands on software development experience – strong C++ programming skills. <br>Experience in Object Oriented design and multi-threading methodologies. <br>Experience analysing, debugging issues with multi-threaded process using debugger <br>Ability to write effective and reusable code according to best practices <br>Experience inworking with Agile methodology in project execution <br><br>Desired Skills: <br>Experience in Python, Shell scripting. <br>Nice to have experience in Java, GWT, and QT. <br>Familiar with Healthcare domain standard like DICOM and IHE. <br>Ability to explore large code base and understand architecture and design <br>Ability to deliver without much supervision from lead/managers <br>Familiar with tools like WinSCP, Eclipse, Putty, Rally, Collaborator, SVN, Git <br><br>If you are interested kindly apply through the below link:<br>https://bit.ly/3wCDEba<br><br>Recruiter Details:<br>Mohamed sheik<br>(302) 310-5458<br>sheikmd_us@falconsmartit.com<br><br>Find all current job openings at our Career Page<br>https://www.falconsmartit.com/FalconCareer.html<br><br>Follow us on LinkedIn for Job Opportunities<br>https://www.linkedin.com/company/falconsmartit/",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-15"
    },
    "company": {
        "name": "Falcon Smart IT (FalconSmartIT)",
        "link": "https://uk.linkedin.com/company/falconsmartit"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake City",
        "region": "UT",
        "postal_code": "84101",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}