{
    "job": {
        "title": "Senior Software Engineer - Pandora",
        "industry": [
            "Entertainment",
            "Broadcast Media"
        ],
        "description": "SiriusXM and Pandora have joined together to create the leading audio entertainment company in the U.S. Together, we are uniquely positioned to lead a new era of audio entertainment by delivering the most compelling subscription and ad-supported audio experiences to millions of listeners -- in the car, at home and on the go. Our talent, content, technology and innovation continue to be at the forefront, and we want you to be a part of it! Check out our current openings below and at www.siriusxm.com/careers .<br><br><strong><u>Position Summary<br><br></u></strong>SiriusXM is seeking a Senior Software Engineer to join our Metadata Delivery Team. Our team focuses on analyzing talk and music content using machine learning methods driven by our science and analyst teams. We are responsible for making this highly data available at listener scale, using a hybrid cloud approach.<br><br><strong><u>Duties And Responsibilities<br></u></strong><ul><li> Coding in Java, Scala, or Python. </li><li> Mentor team members on engineering best practices. </li><li> Analyze requirements and technical specifications, and implement assigned development tasks using various technologies. </li><li> Be familiar with the overall software stack and the software components. </li></ul><strong> Supervisory Responsibilities: <br></strong><ul><li> None. </li></ul><strong> Minimum Qualifications: <br></strong><ul><li> BS in Computer Science or equivalent </li><li> 5+ years of Software Developer/Software Engineer experience. </li></ul><strong> Requirements and General Skills: <br></strong><ul><li> Good public speaking and presentation skills. </li><li> Interpersonal skills and ability to interact and work with staff at all levels. </li><li> Excellent written and verbal communication skills. </li><li> Ability to work independently and in a team environment. </li><li> Ability to pay attention to details and be organized. </li><li> Ability to project professionalism over the phone and in person. </li><li> Ability to handle multiple tasks in a fast-paced environment. </li><li> Commitment to “internal client” and customer service principles. </li><li> Willingness to take initiative and to follow through on projects. </li><li> Creative writing ability. </li><li> Excellent time management skills, with the ability to prioritize and multi-task, and work under shifting deadlines in a fast-paced environment. </li><li> Must have legal right to work in the U.S. </li></ul><strong> Technical Skills: <br></strong><ul><li> Thorough knowledge of a modern software development process will be required. </li><li> The role will demand an understanding in modern testing and deployment best practices. </li><li> Knowledge of data structures and run time efficiencies will play a key role in contributing to our team’s codebase. <br></li></ul><em>More details about our company benefits can be found </em> <em>here</em> <em>!<br><br></em><strong><em>Our goal at SiriusXM+Pandora is to provide and maintain a work environment that fosters mutual respect, professionalism and cooperation. SiriusXM+Pandora is an equal opportunity employer that does not discriminate on the basis of actual or perceived race, creed, color, religion, national origin, ancestry, alienage or citizenship status, age, disability or handicap, sex, gender identity, marital status, familial status, veteran status, sexual orientation or any other characteristic protected by applicable federal, state or local laws.<br><br></em></strong><em>The requirements and duties described above may be modified or waived by the Company in its sole discretion without notice.</em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08"
    },
    "company": {
        "name": "Pandora",
        "link": "https://www.linkedin.com/company/pandora"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Oakland",
        "region": "CA",
        "postal_code": "94612",
        "street_address": null,
        "latitude": 37.80483,
        "longitude": -122.27248
    }
}