{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": [
            "Information Technology and Services"
        ],
        "description": "<p>A global platform provider based in Berlin, Germany is seeking a <strong>Site Reliability Engineer</strong> to help bolster&nbsp;and support their cloud-based service offering. They're looking for someone with experience in <strong>Linux, CI/CD pipelines and some coding.</strong></p><p>&nbsp;</p><p><strong>Requirements:</strong></p><ul><li>A solid background and working experience in Software Development and/or Linux Systems Administration role</li><li>Strong interpersonal, written and verbal communication skills</li><li>Available to participate in a scheduled on-call rotation</li><li>Proficient as a Linux Systems Engineer, Linux Administrator, Software Developer, Software Engineer with experience managing large scale Web Services infrastructure</li><li>Development experience in one or more of the following programming languages: Linux, Python, Bash, Go, Java, C++, or Rust</li></ul><p><br></p><p><strong>In addition, experience with one or more of the following would be beneficial:</strong></p><ul><li>Distributed data storage at scale (Hadoop, Ceph)</li><li>NoSQL at scale (MongoDB clusters, sharded Redis, Cassandra)</li><li>Data Aggregation technologies. (ElasticSearch, Kafka)</li><li>Scaling and managing traditional RDBMS (PostgreSQL, MySQL) with High Availability</li><li>Monitoring &amp; Alerting (Prometheus, Grafana), and Incident Management toolsets</li><li>Virtual infrastructure and/or container hosting (deployment and management) at scale</li></ul><p><br></p><p>This position is remote, but once Covid restrictions lift, they will look at a hybrid working model, and they would like candidates who are based near Berlin to pop in for meetings from time to time and catch-ups.</p><p><br></p><p><strong>Paying between $130 to $140k + Bonus + Benefits </strong></p><p><br></p><p><strong>Apply now to be considered and for more information!</strong></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06"
    },
    "company": {
        "name": "Apollo Solutions",
        "link": "https://uk.linkedin.com/company/apollo-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}