{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Internet",
            "Computer Software"
        ],
        "description": "<p><strong>The problem</strong></p><p><br></p><p>Every year, billions of dollars are set aside by your local, state, and federal representatives to make it easier for anybody to build a small business and turn their dream into reality.</p><p><br></p><p>But while governments might be great at governing, they’re terrible at marketing. These billions sit unclaimed, waiting for founders to discover them. We want to fix that, and we need your help.</p><p><br></p><p><strong>The opportunity</strong></p><p><br></p><p>MainStreet is looking for a Software Engineer to help us build out and influence the design for our front end web properties. You’ll have an opportunity to lead design and development of new features on top of the current onboarding and company portal, helping us to structure our components in a re-usable manner. Additionally, you will work closely with the design team to balance launch timelines and product perfection – we ship often so you won’t have to wait weeks to see your work in production</p><p><br></p><p><strong>What you'll do</strong></p><p><br></p><ul><li>Be a core member of a multidisciplinary team (Engineering, Product, and Design) focused on shipping impactful products and features for our customers.&nbsp;</li><li>Build clean, well tested, high quality front end and back end code</li><li>Borrow from your experience to help us uplevel our team’s technology and processes as we scale and iterate rapidly</li><li>Be a steward of core security and design principles</li></ul><p><br></p><p><strong>What we're looking for</strong></p><p><br></p><ul><li>2+ years experience building and maintaining production software in a full stack role</li><li>Experience optimizing React in production systems for performance and developer experience</li><li>Someone who can own and drive technical decisions with a grounding in solving problems for our customers and business</li><li>Experience working with backend services and APIs</li><li>Someone that thrives in a highly collaborative and fast paced environment</li><li>Experience operating cross functionally with Engineering, Product, and Design teams</li><li>A willingness to learn on the job and take on tasks as needed</li><li>Excellent communication skills</li><li>Ability to work independently and communicate over the phone and with video chat software, such as Zoom</li><li>Bonus if you have:&nbsp;Used Express and/or Typescript in production systemExperience hosting and monitoring a production React ApplicationPassion for startups, finance, accounting, and taxes, or all of the aboveExperience using a state management such as Context / MobX / Redux</li></ul><p><br></p><p><strong>Compensation</strong></p><p><strong><span class=\"ql-cursor\"></span></strong></p><p>- Base salary range for this position is $100,000 - $185,000 and is based upon years of experience that is commensurate with the level of the position in addition to location</p><p>- Bonus that is commensurate with the level of the position</p><p>- Robust equity program with significant upside potential</p><p>- Benefits including medical, dental, vision, disability, life, 401k plus additional perks to make your work from home life better</p><p><br></p><p><strong>About MainStreet</strong></p><p><br></p><p><em>What we do</em></p><p><br></p><p>We make these tax credits easy as butter. MainStreet pairs companies &amp; employees with hundreds of local, state, and federal tax programs. Then we do all the paperwork to get companies what they’re owed in minutes, vs the dozens of hours it would otherwise take.</p><p><br></p><p>The average company gets $51,040… in the first year. In cash.&nbsp;</p><p><br></p><p>We just&nbsp;announced our $60M Series A, led by SignalFire. We’re backed by an incredible community of partners, operators, and founders, including Ryan Hoover (Product Hunt founder), Ashton Kutcher’s Sound Ventures, Des Traynor (Intercom cofounder), Gradient (a Google Venture Fund), Ron Conway’s fund SV Angel, and Tusk Ventures.&nbsp;</p><p><br></p><p><em>How we think about diversity</em></p><p><br></p><p>We try to make sure the diversity of our customers is reflected in the team that serves them. Because when we include people of all races, genders, sexual orientations, ages, and identities — we end up building a better experience for everyone who uses MainStreet.</p><p><br></p><ul><li>We know we need to be intentional in our hiring practices in order to overcome systemic biases we may be blind to. So, if your lived experience has given you a unique perspective on business, startups, or any other aspect of our business – even if you don’t meet all the requirements – please still apply and let us know so we can make sure your application gets the attention it deserves.</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01"
    },
    "company": {
        "name": "MainStreet",
        "link": "https://www.linkedin.com/company/workonmainstreet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}