{
    "job": {
        "title": "Software Engineer, New Grad 2021",
        "industry": [
            "Computer Software",
            "Internet",
            "Financial Services"
        ],
        "description": "Blend helps lenders maximize their digital agility. Our digital lending platform is used by Wells Fargo, U.S. Bank, and other leading financial institutions to increase customer acquisition, improve productivity, and accelerate the delivery of any banking product across every channel. We process more than $3.5 billion in mortgages and consumer loans daily, helping millions of consumers get into homes and gain access to the capital they need to lead better lives.<br><br>Blend is looking for talented software engineers to join our diverse and fast-growing engineering team. As a software engineer, you’ll work throughout the stack, from large-scale data processing to web UI. Specifically, you will be responsible for building new features and functionality enabling our company to deliver mission-critical software to major mortgage lenders. If you have a strong understanding of CS fundamentals, and are excited by a fast-paced, collaborative work environment, we want to hear from you!<br><br><strong><u>Who You Are<br></u></strong><ul><li>Currently enrolled in an accredited university graduating in 2021</li><li>Excellent coding, problem solving, and debugging skills</li><li>Solid understanding of computer science fundamentals</li><li>Excellent communication skills<br></li></ul>Bonus Points!<br><ul><li>Prior industry experience as a software engineering intern (domain knowledge in enterprise software or home lending not required)</li><li>Experience at a rapid-growth startup</li><li>Experience with JavaScript, Angular.js, Node.js, Go, and Python</li><li>Web app development experience</li><li>Experience building native mobile apps<br></li></ul><strong><u>Benefits And Perks<br></u></strong><ul><li>Meaningful equity and a 401(k) plan</li><li>Comprehensive health benefits </li><li>Wellness benefits covering a variety of wellness activities, fitness classes, fitness equipment and more </li><li>Stipends for work from home office set up, internet, and meals </li><li>Company-wide mental health days </li><li>Weekly remote all hands</li><li>Up to 15 days accrued vacation per year</li><li>16 weeks of paid parental leave<br></li></ul>Blend is an equal opportunity employer that values diversity, inclusion and belonging. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status disability status, or any other characteristic protected by law. We will consider for employment all qualified applicants with arrest and conviction records in a manner consistent with applicable laws.<br><br>Notice at Collection for California Applicants<br><br>If you have a disability and you wish to discuss potential accommodations related to applying for employment, please contact Blend at (650) 550-4810 or hraccessibility@blend.com.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-09"
    },
    "company": {
        "name": "Blend",
        "link": "https://www.linkedin.com/company/blend-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}