{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": [
            "Staffing and Recruiting"
        ],
        "description": "<p><strong>GlobalSource IT</strong> has a <strong>Direct Client</strong> in the<strong> Chicago, IL </strong>area that is in the need of some strong <strong>Machine Learning Engineers</strong> for their applications team. They are a Microsoft-based shop and are looking to constantly improve upon their development efforts using TensorFlow/Keras frameworks. This role would look to work with the Data and Applications teams to help create data analysis solutions for customer data as well as best practices models for each area. Other technologies would include .Net Stack, C#, Python, SQL, Azure, Hadoop/NoSQL, and data modeling. These roles can be from Engineer to Architect level of experience. They are also open to <strong>6+ Month Contracts</strong> or <strong>Contract to Hire</strong> options, and are remote roles if not local to Chicago. </p><p><br></p><ul><li>Must have 3+ years of experience in Machine Learning Engineers roles to create best practice Data Models/Analytic solutions</li><li>Strong experience with either TensorFlow or Keras frameworks for Machine Learning</li><li>Hands-on work with Python, R, or C# along with .Net Stack applications for development</li><li>Ability to work with multiple lines of business and data sets to create best practices or recommend best models for prediction/forecasting efforts</li></ul><p><br></p><p><strong><em>*** If you're interested in this opportunity please send your Updated Resume (WORD) and Expected Rate (Remote) to the attached email or jasonz@globalsourceit.com ***</em></strong></p>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-11"
    },
    "company": {
        "name": "GlobalSource IT",
        "link": "https://www.linkedin.com/company/globalsource-it"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}