{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Computer Software"
        ],
        "description": "<strong><u>About The Role<br><br></u></strong>Lambda is growing! Come work at a profitable startup where we’re building powerful research computers and software for Machine Learning and Artificial Intelligence experts around the world.<br><br>We're looking for Software Engineers to work across a variety of projects as we build new products and fine-tune our engineering processes, including our e-Commerce platform, internal systems for complex server manufacturing execution, and beyond. Our team is small so you'll have impact across many facets of our software development evolution.<br><br>What You’ll Do<br><ul> <li>Implement and maintain new features used by both external and internal customers.</li> <li>Uphold Lambda's high standards in security, software architecture, engineering, and privacy.</li> <li>Work along the entire stack including Database, ORM, Frontend, Backend, API integration, HTML/CSS, Javascript, system administration.</li> <br></ul>Experience that's great to have<br><ul> <li>Extremely comfortable in a UNIX shell.</li> <li>Able to quickly pick up and learn new systems, APIs, languages, and tools.</li> <li>Self-directed in your learning and execution attitude. </li> <li>Know how to prioritize your time and how to make polish vs. launch trade-offs.</li> <li>Internal desire to implement and uphold industry best practices in security.</li> <li>Experience shipping: whether that's a game title, web app, or open-source software package.</li> <li>Bachelors’ degree in an engineering or scientific field preferred</li> <br></ul>Example projects<br><ul> <li>Add a new feature to our computer configuration platform.</li> <li>Implement a new feature in our internal manufacturing execution system to help us improve company-wide manufacturing throughput.</li> <li>Add dashboards to help our team better understand and execute on company metrics &amp; summary statistics. ## Quick Company Highlights </li> <li>Our research papers have been accepted into the top machine learning and graphics conferences, including ICCV, SIGGRAPH Asia, NeurIPS, and ACM Transactions on Graphics (TOG).</li> <li>Profitable and growing 50% quarter over quarter.</li> <li>We’re backed by investors including Gradient Ventures, Google’s AI-focused venture fund.</li> <li>Headquartered in the Dogpatch and a short walk from the 22nd Street Caltrain station in SF.</li> <br></ul>Our Benefits<br><ul> <li>Generous cash &amp; equity compensation</li> <li>Health, vision, and dental coverage for you and your dependents</li> <li>401k Plan</li> <li>Paid Time Off</li> <li>Commuter benefits</li> <li>Daily catered lunch</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28"
    },
    "company": {
        "name": "Lambda Labs",
        "link": "https://ba.linkedin.com/company/lambda-labs-ba"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}