{
    "job": {
        "title": "Software Engineer - Frontend",
        "industry": [
            "Marketing and Advertising",
            "Computer Software",
            "Internet"
        ],
        "description": "Squarespace is seeking talented JavaScript engineers with strong design sensibilities and a desire to create interfaces that are a pleasure to use.<br><br>The Frontend team at Squarespace is responsible for building one of the most advanced interfaces on the web. With it, our customers are able to easily create beautiful interactive websites and stores. If you are a Frontend Engineer who strives to push the envelope with what is possible in a web browser, we want to hear from you! This role will report to the Product Engineering Team Lead in our New York City headquarters.<br><br><strong><u>Responsibilities<br></u></strong><ul> <li>Design and build new features into the Squarespace interface</li> <li>Collaborate with other engineers and designers to deliver strong customer-focused experiences</li> <li>Keep our product up to date with the latest frontend technologies such as React and ES2015+</li> <li>Practice disciplined software engineering (e.g. automated testing, code reviews, and writing beautiful, pragmatic code)</li> <li>Actively contribute to team and company standards</li> <br><br></ul><strong><u>Qualifications<br></u></strong><ul> <li>Proficient in JavaScript</li> <li>Have solid knowledge of the DOM, HTML and CSS3</li> <li>Have experience with Single Page Application development</li> <li>Keep up to date with the newest technologies</li> <li>Develop features and create fulfilling user experiences</li> <li>A strong understanding of, and practical experience with, web application development</li> <li>A sincere commitment to crafting readable and reliable code</li> <li>BS or MS in Computer Science or related or equivalent industry experience</li> <li>2+ years of industry experience </li> <br><br></ul><strong><u>About Squarespace<br><br></u></strong>Squarespace empowers people with creative ideas to succeed. By blending elegant design and sophisticated engineering, we empower millions of people — from individuals and local artists to entrepreneurs shaping the world’s most iconic businesses — to share their stories with the world. Squarespace’s team of more than 800 is headquartered in downtown New York City, with offices in Dublin, Los Angeles and Portland. For more information, visit www.squarespace.com/about.<br><br><strong>PERKS <br></strong><ul> <li>Health insurance with 100% premium covered for you and your dependent children</li> <li>Flexible vacation &amp; paid time off</li> <li>Up to 20 weeks of paid family leave</li> <li>Equity plan for all employees</li> <li>Retirement benefits with employer match</li> <li>Fertility and adoption benefits</li> <li>Free lunch and snacks at all offices</li> <li>Education reimbursement</li> <li>Dog-friendly workplace in New York office</li> <li>Commuter benefit in the form of reduced tax (Ireland) and pretax (US)</li> <br></ul><em>Today, more than a million people around the globe use Squarespace to share different perspectives and experiences with the world. Not only do we embrace and celebrate the diversity of our customer base, but we also strive for the same in our employees. At Squarespace, we are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace.</em>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14"
    },
    "company": {
        "name": "Squarespace",
        "link": "https://www.linkedin.com/company/squarespace"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}