{
    "job": {
        "title": "Data Scientist",
        "industry": [
            "Internet",
            "Computer Software",
            "Financial Services"
        ],
        "description": "<p>Our client is a global multi-strategy hedge fund looking to hire brilliant PhD quantitative researchers for its quantitative strategies trading team.</p><p><br></p><p><strong>The Role</strong></p><p><br></p><p>As a quant on the team, you will be working alongside experienced PhD quant traders, data analysts and seasoned software engineers.&nbsp; The environment is collegiate and collaborative.&nbsp;</p><p><br></p><p>You will enjoy a full-lifecycle research role where you will apply your observation skills and research expertise to identify and build predictive models for trading the global financial markets.</p><p><br></p><p>You will be involved in researching both new systematic trading strategies and analyzing existing strategies to identify potential improvements.</p><p><br></p><p><strong>Skills &amp; Experience:</strong></p><p><br></p><p>&gt;<strong> </strong>No Finance Industry experience is required.</p><p>&gt; PhD in Science, Math, Engineering or other quantitative field.</p><p>&gt; 0 - 4 years Post PhD experience from any Industry.</p><p>&gt; Research expertise in analysing and finding signals / patterns in high dimensional datasets.</p><p>&gt; Strong programming skills in Python or C++.</p><p>&gt; Ability to express ideas mathematically and algorithmically.</p><p>&gt; Willingness to seek guidance and learn new skills.</p><p>&gt; Intellectually curious, extraordinary mental flexibility and a high tolerance for ambiguity.</p><p><br></p><p><strong><u>Please apply via this posting</u></strong></p><p><br></p><p><strong>**Please Note: We are a niche recruitment firm specializing in the quantitative trading and Fintech Industry. We have been retained by our client to identify, interview and introduce suitable candidates for this position**&nbsp;&nbsp;&nbsp;</strong></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19"
    },
    "company": {
        "name": "maven",
        "link": "https://www.linkedin.com/company/maven-alpha"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Greater Chicago Area",
        "region": null,
        "postal_code": "60618",
        "street_address": null,
        "latitude": 41.948055,
        "longitude": -87.655754
    }
}