{
    "job": {
        "title": "Remote Sr. Software Engineer - Go or Java, React",
        "industry": [
            "Accounting"
        ],
        "description": "If you are a Remote Sr. Software Engineer - Go or Java, React with experience, please read on!<br><br>Top Reasons to Work with Us<br><br>4.7/5 Stars on Glassdoor<br>Fantastic culture of growth collaboration<br>Great technologies<br>Mission driven<br>Competitive salary &amp; benefits<br>Remote!<br><br>What You Will Be Doing<br><br>Design software apps and features in Golang, React and React-native<br><br>Implement solutions quickly and efficiently<br><br>Lead by demonstrating good coding practices<br><br>Build testing and reporting features throughout the process to deliver great quality and easily maintainable software<br><br>Collaborate &amp; Coordinate with product, data, revenue and company stakeholders to design market winning products<br><br>Develop and collect metrics to drive continuous improvement of existing products<br><br>As needed, mentor/lead small developer teams, providing mentorship and fostering a culture of growth for junior developers<br><br>What You Need for this Position<br><ul><li> Go</li><li> Java</li><li> applications</li><li> SQL</li><li> Golang</li><li> REACT<br></li></ul>So, if you are a Remote Sr. Software Engineer - Go or Java, React with experience, please apply today!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Maria.Reyes@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : MR7-1639176 -- in the email subject line for your application to be considered.***<br></li></ul>Maria Reyes - Executive Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20398",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}