{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Marketing and Advertising",
            "Computer Software",
            "Internet"
        ],
        "description": "Amify is a two-time Inc 500 award winner Amazon-as-a-Service (AaaS) provider that offers brands an end-to-end Amazon solution that maximizes sales and profitability. Amify’s data-driven, full-service solution includes strategy, advertising, creative, management and operations for brand protection, content enhancement, sales acceleration and inventory management. We are uniquely positioned to help our brands achieve greater sales margins through the Amazon ecommerce platform. Amify has partnered with over 1,000 brands of all sizes to manage over $100 million in sales on Amazon.<br><br>We are seeking a Software Engineer who will contribute to the delivery of a wide variety of software projects across Amify’s entire technology stack, from operational systems such as Salesforce, to database and reporting platforms, and custom-built web apps and services.<br><br><strong>Responsibilities<br></strong><ul><li>Deliver high-quality, architecturally sound code extending and building upon Amify’s current technology</li><li>Work to extend and leverage Amify’s technology stack, including Snowflake, AWS, Fivetran, dbt and Looker</li><li>Deliver solutions large and small across a wide range of projects and initiatives</li><li>Participate in architecture, coding, and delivery of developed systems</li><li>Participate in iterative interaction with customers, from pre-coding requirements to post-delivery feedback<br></li></ul><strong>Technical Requirements<br></strong><ul><li>Demonstrated skill delivering software on deadlines</li><li>Demonstrated skill in at least one enterprise programming language such as C, C++, JavaScript/node.js, Java, Python, C#, Rust, Go, Scala, Clojure, etc.</li><li>Demonstrated skill in at least one scripting language such as JavaScript, Unix shell/bash/zsh/etc, Python, PL/SQL, or similar.</li><li>Fluent in software engineering lifecycle and knows how to implement and apply principles to a wide range of problem spaces</li><li>Demonstrated skill in SQL and enterprise-capable databases, e.g. Snowflake,</li><li>Postgres, Oracle, MySQL<br></li></ul><strong>Qualifications<br></strong><ul><li>3+ years of relevant professional experience</li><li>2+ years cloud software engineering experience</li><li>Proven delivery experience on a multi-functional team delivering web, mobile, distributed, enterprise business applications</li><li>Willingness to work cross-functionally in a vibrant, dynamic startup environment</li><li>Trustworthy, Team-Oriented, Transparent</li><li>Excellent written and verbal skills<br></li></ul><strong>What You’ll Get Out Of It<br></strong><ul><li>Enjoy a fun, fast-growing entrepreneurial company</li><li>Be part of a highly collaborative learning culture- share knowledge, be inclusive, learn and grow together. Embrace teamwork!</li><li>Knowing your ideas are heard and matter. Think big!</li><li>You get to own your job and be recognized for your contributions</li><li>Work with smart and creative people</li><li>We want all the experience and expertise you have to offer, but we won’t burn you out. We offer unlimited PTO plus over 10 holidays</li><li>It’s okay to make mistakes because we’re human. Let’s learn from them. Be transparent!</li><li>We recognize you as an individual- no presumptions or judgment. Be the extraordinary you!</li><li>Have “skin in the game” through our employee stock options plan</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05"
    },
    "company": {
        "name": "Amify",
        "link": "https://www.linkedin.com/company/amify"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Arlington",
        "region": "VA",
        "postal_code": "22210",
        "street_address": null,
        "latitude": 38.890762,
        "longitude": -77.084755
    }
}