{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<strong>NLP (Natural Language Processing) Machine Learning Engineer needed for AI/Security Platform as a Service software company in Lehi, Utah - Full-time, full benefits, great compensation<br><br></strong>This Jobot Job is hosted by Patrick Murray<br><br>Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.<br><br><strong>A Bit About Us<br><br></strong>Based in the Salt Lake City area, we are an established and ever-growing AI/Documentation Security Platform as a Service company that was established in 1999. We have grown to over 250+ employees Worldwide and are a recognized leader in in Cloud security and management.<br><br>We are currently looking for a strong Machine Learning Engineer with NLP experience to join our growing AI team. The Machine Learning Developer / AI Engineer will design and implement Natural Language Processing algorithms and deploy them into production at scale. It is a pivotal role for our company and product!<br><br>If this sounds interesting, please apply today!<br><br><strong><br><br><strong>Why join us?<br><br></strong></strong><ul><li> Competitive Base Salary</li><li> Extremely Competitive Benefits Package</li><li> Flexible Work Schedules</li><li> Accelerated Career Growth</li><li> Excellent PTO</li><li> Steady, Stable, Growing Company</li><li> Modern Environment</li><li> State of the Art Technology<br></li></ul><strong>Job Details<br><br></strong>What you need to be successful<br><ul><li> PhD/MS in Computer Science, Information Retrieval, Machine Learning, Natural Language Processing or a related discipline</li><li> 3-8+ years of experience</li><li> A solid foundation in computer science, with strong competencies in data structures, algorithms, and software design.</li><li> Industry experience of building and producing innovative end-to-end Machine Learning systems</li><li> Excellent programming skills in Python, experience using API Flask (REST) in production environment</li><li> Excellent written and spoken communication skills<br></li></ul>Ideally what you've done<br><ul><li> Experience in development of large-scale NLP systems in a large industrial or government environment</li><li> Experience with developing microservices with Docker and Kubernetes to serve machine learning models</li><li> Experience with Azure/Google Cloud Platform / Amazon Web Services</li><li> Experience with Flask, Apache Spark, Apache Kafka, Redis is a plus<br></li></ul>Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-07"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake City",
        "region": "UT",
        "postal_code": "84101",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}