{
    "job": {
        "title": "Principal Scientist / Associate Director, Molecular Biology",
        "industry": [
            "Biotechnology"
        ],
        "description": "We invent and create multi domain proteins for cell and gene therapies (including genome editors and CARs). By coupling synthetic biology with data science and machine learning, we are able to generate high-scale protein libraries for high-throughput screening and analysis!<br><br>This position is based in San Francisco, CA. We are actively looking to hire a Principal Scientist / Associate Director, Molecular Biology! This person will help contribute towards building out and deploying our high-throughput methods to characterize and develop cutting edge therapies for immuno-oncology.<br><br>Top Reasons to Work with Us<br><ul><li>Recent partnerships</li><li>Great location in SSF</li><li>Competitive compensation</li><li>Industry leading executive team</li><li>Become one of the early stage employees of our fast growing company</li><li>Opportunity for growth<br></li></ul>What You Will Be Doing<br><ul><li>Execute and troubleshoot molecular biology projects</li><li>Work with the team to understand ongoing gene editing and cell engineering projects</li><li>Maintain a detailed ENL</li><li>Collaborate with software engineers to develop design &amp; analysis methodologies and pipeline</li><li>Participate in team meetings<br></li></ul>What You Need for this Position<br><ul><li>PhD with 6-8+ years of experience in industry</li><li>Hands on experience with CRISPR, DNA libraries in a mammalian/primary cell environment highly preferred</li><li>Experience building out libraries (assigning and assembling methods to create the libraries)</li><li>Experience with...</li><li>Mammalian Cell Culture</li><li>Molecular Cloning</li><li>Cell Transfection</li><li>Plasmid DNA prep</li><li>Flow cytometry</li><li>High-throughput screening<br></li></ul>So, if you are a Principal Scientist / Associate Director, Molecular Biology with experience, please apply today!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Sean.Jenkins@cybercoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SJ7-1649079 -- in the email subject line for your application to be considered.***<br></li></ul>Sean Jenkins - Executive Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "South San Francisco",
        "region": "CA",
        "postal_code": "94083",
        "street_address": null,
        "latitude": 37.65568,
        "longitude": -122.41248
    }
}