{
    "job": {
        "title": "Site-Reliability Engineer (100% remote)",
        "industry": [
            "Nonprofit Organization Management",
            "Education Management",
            "Maritime"
        ],
        "description": "<strong>Job Title: </strong><strong>Site-Reliability Engineer<br><br></strong><strong>Location: 100% Remote<br><br>Duration: 5 months - Possibility to extend<br><br></strong><strong><u>Job Overview<br><br></u></strong>This person will be working with Site Reliability Engineering group. This role may require weekend work based on business needs (deployment, maintenance support, or critical issues).<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Troubleshoots highly complex, intricate technical problems to ensure optimal service levels; works on multiple incidents and/or projects simultaneously</li><li> Is viewed as an invaluable resource in the technical and operational aspects of one or more IT disciplines</li><li>I s consulted as a subject-matter expert in areas of technology and technical operations</li><li> Acts as a point of escalation in complex, critical instances and leads and directs the efforts of more junior staff during high-impact outages.</li><li> Utilizes tools to verify and validate that proper thresholds and infrastructure/application information are represented and set appropriately</li><li> Investigate incidents and and finds resolutions to insure future stability of infrastructure and data working with geographically dispersed teams</li><li> Leverages experience and knowledge to proactively engage in root-cause analysis and preventative projects</li><li> Provides technical expertise in cross-functional and intra-departmental efforts<br></li></ul><strong><u>Essential Requirements<br></u></strong><ul><li> Strong familiarity with Kafka, Mongo DB, Oracle DB support and scripting.</li><li> Familiarity with monitoring and analyzing tools like New Relic and Splunk.</li><li> Must be comfortable to quickly diagnose and identify root cause to resolve critical issues across multiple platforms.</li><li> Strong communication, documentation and organizational skills.</li><li> Must be driven to ensure the needed cooperation is obtained from associated/involved teams.</li><li> BS degree in computer science or related engineering degree.</li><li> 3+ years working in Site Reliability, IT Ops, DevOps or similar functions.</li><li> 3+ years of hands-on experience with private/public cloud computing, including infrastructure, storage, and data management.</li><li> 3+ years of experience in general programming .Net Core and/or Java.</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-11"
    },
    "company": {
        "name": "Spectraforce Technologies",
        "link": "https://www.linkedin.com/company/spectraforce"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}