{
    "job": {
        "title": "Machine Learning Engineer (REMOTE)",
        "industry": [
            "Information Technology and Services"
        ],
        "description": "<p><strong>Machine Learning Engineer</strong></p><p><strong>Fortune 500 client, McLean; VA or Dallas; TX or OPEN TO FULLY REMOTE</strong></p><p><strong>6-12 months with extension</strong></p><p><br></p><p><strong><u>Overview:</u></strong></p><ol><li>The client's iLab is currently looking for Machine Learning Engineers in its Innovation Labs – Tech Strategy team. In this position, you will be responsible for taking on new initiatives to design, build, and deploy machine learning models in a client solution-oriented environment.&nbsp;</li><li>As a member of our team, you will make an immediate impact on building and expanding current technology platforms across AWS and GCP.</li></ol><p><strong><u>What you will do:</u></strong></p><ul><li>Work within an agile team that includes members with cross-functional skills</li><li>Collaborate closely with other functional teams to design, build, test, and deploy AI solutions to address market needs</li><li>Design and implement Machine Learning algorithms and models into software solutions for our enterprise customers by using common machine learning frameworks, including establishing and training machine learning and deep learning models at scale for computer vision (image recognition, object detection, image generation), machine translation, language modeling, rankings and recommendations, speech recognition, etc.</li><li>Design, build, and implement cloud native applications using the GCP and AWS services, event streaming technologies, and various open source frameworks</li><li>Build distributed, scalable, and reliable data pipelines that ingest and process data at scale and in real-time to feed machine learning algorithms</li><li>Incorporate real-time data streams to produce highly predictive features in our models</li><li>Write understandable, testable, and secure code with an eye towards quality and maintainability.</li></ul><p><strong><u>What we are looking for:</u></strong></p><ul><li>3 - 5 years of Machine Learning/Artificial Intelligence Engineering experience&nbsp;</li><li>Experience with Machine Learning - Frameworks TensorFrow &amp; XGBoost, scikit-learn, Pytorch and ONNX.&nbsp;</li><li>In addition, I am also looking for experience with programming languages (Python, Java, Go, etc.).&nbsp;</li><li>Experience with Big Data and/0r Data Lake experience.</li><li>Must have GCP or AWS background&nbsp;</li></ul><li></li>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-12"
    },
    "company": {
        "name": "Technology Ventures",
        "link": "https://www.linkedin.com/company/technology-ventures"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20398",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}