{
    "job": {
        "title": "OSP / Field Tech",
        "industry": [
            "Telecommunications"
        ],
        "description": "<p><strong><u>Overview:</u></strong></p><p>NB+C is a leading wireless Site Development firm that provides services to all the major wireless carriers. We are seeking motivated professionals to join our innovative, fast-paced and dynamic team environment. NB+C is totally committed to bringing the brightest and most determined minds to projects while providing employees with a supportive and collaborative professional environment.</p><p>&nbsp;</p><p>We work hard to ensure that our employees are provided with a great benefits package including health coverage, 401K, flex spending, life insurance, short-term and long-term disability, and PTO.&nbsp;&nbsp;</p><p><br></p><p><strong>Job Responsibilities: </strong></p><ul><li>Responsible for fielding varying types of information and data from numerous environments, including public rights of way along roads, the interior space of buildings, and throughout private campuses, such as offices or universities, and is generally assigned more complex or advanced projects/investigations</li><li>Gathers data using digital cameras, observations and notes/reports, GPS enabled data collectors, and other measuring devices, and trains less experienced staff on use and maintenance</li><li>Uses various technologies and applications, including phone, email, and web-based applications including Google Earth/ArcGIS or equivalent, to effectively compile data from the field or to modify/adjust preliminary plans</li><li>Uses face-to-face communication to accurately and efficiently convey information to CAD Designers, Engineers, Project Managers, other contractors, or clients</li><li>Maintains field equipment, vehicles, timesheets, and work reports in an organized, accurate, and professional manner</li><li>Provides scheduling, status reporting, and other documents as necessary and coordinates the same information with less experienced staff</li><li>Works in handholes, accesses duct systems, and traverses landscapes that range from city streets to steep, unpaved rights of way, which may include duct rodding and roping, locating and marking of underground ducts/cables, sticking/measuring utility poles, or other physical activities </li><li>Safely and properly train less experienced staff on workplace safety, industry information, and technology as well as best practices</li></ul><p><br></p><p><strong><u>Qualifications</u></strong></p><ul><li>Self-Starter with solid work ethic and computer/technology literacy</li><li>The ability to determine and accurately report on field conditions of moderate complexity with a disciplined and tenacious approach to investigation</li><li>Knowledge of basic construction and safety, OSHA 30 preferred</li><li>3 years of direct or equivalent telecom experience such as telecom construction technician, utility locate technician, OSP Engineering, etc.</li><li>Effective communication skills</li><li>Desire and ability to develop leadership skills</li><li>Solid analytical or diagnostic skills, the ability to reason and investigate, and to clarify information regarding unknown or obscure conditions</li><li>Safe driving history and clean license history</li><li>The ability to travel regionally, with overnight travel up 50%</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Network Building + Consulting",
        "link": "https://www.linkedin.com/company/network-building-consulting"
    },
    "education": {
        "required_credential": "associate degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Blue Bell",
        "region": "PA",
        "postal_code": "19424",
        "street_address": null,
        "latitude": 40.146606,
        "longitude": -75.27131
    }
}