{
    "job": {
        "title": "Data Scientist",
        "industry": [],
        "description": "<p>The Data Scientist will be joining a team of extremely passionate data scientists, product managers, and engineers who share a common interest in tackling some of the most difficult data science and machine learning problems today. The Data Scientist will be responsible for designing and building data products that provide intelligence on real-estate metrics and systems for improving the quality and information density from third party data sources.</p><p><br></p><p>With the data products and machine learning systems you design, Markerr will arm influential decision-makers at leading real estate investment organizations with critical information they need to make smart, data-driven decisions. Along the way, you will help advance the current work in artificial intelligence and predictive modeling, having the opportunity to design major parts of the process for creating and improving data science pipelines. Our technologies and data power the insights for financial services and corporations.</p><p><br></p><p>The compensation package includes a competitive salary and incentive structure, generous benefits, and valuable business experiences, challenges, and excitement of contributing to the success of a fast-growing technology startup company.</p><p><br></p><p>Ideal candidates are those who are excited by big data challenges and enjoy using new technologies to make large data sets feel small.</p><p><br></p><p>This position reports to the Director of Engineering.</p><p><br></p><p><strong>Responsibilities:</strong></p><ul><li>Identify the best ML framework and Algorithms for data products&nbsp;</li><li>Test and incubate new models</li><li>Measure model drift and accuracy</li><li>Create model design specifications for engineers to deploy into production&nbsp;</li></ul><p><br></p><p><strong>Requirements:</strong></p><ul><li>Masters in Data Science or Comparable Experience&nbsp;</li><li>2+ years experience building and deploying ML models</li><li>Fluency in technical skills</li><li>Fluent in SQL and at least one programming language used with ML</li><li>Results driven attitude with a strong desire to build data platforms that enable Markerr’s insights across a massive and diverse set of data</li><li>Flexibility and willingness to adapt to the changing demands of a fast-paced, startup environment</li><li>Highly self-motivated and results oriented</li><li>Strong written and verbal English communication skills&nbsp;</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-13"
    },
    "company": {
        "name": "Markerr",
        "link": "https://www.linkedin.com/company/markerr"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}