{
    "job": {
        "title": "Data Scientist",
        "industry": [
            "Marketing and Advertising",
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<strong><u>About Datadog<br><br></u></strong>We're on a mission to build the best platform in the world for engineers to understand and scale their systems, applications, and teams. We operate at high scale—trillions of data points per day—providing always-on alerting, metrics visualization, logs, and application tracing for tens of thousands of companies. Our engineering culture values pragmatism, honesty, and simplicity to solve hard problems the right way.<br><br><strong><u>The Opportunity<br><br></u></strong>You will have a fantastic team of data engineers to support you, a collaborative environment to encourage your work, and the best technologies for performing data science at high scale in your toolkit.<br><br><strong><u>You Will<br></u></strong><ul> <li>Present the latest academic research papers to your team.</li> <li>Research and benchmark the latest algorithms that can be used for our particular use-cases.</li> <li>Apply machine learning algorithms and statistical techniques to build new product features.</li> <li>Deploy a new feature to production, instantly affecting customers with your work.</li> <li>Mentor other data scientists on your team.</li> <li>Explore and find meaning in extremely high volumes of data.</li> <li>Investigate and fix a production issue from a service your team owns.</li> <br><br></ul><strong><u>Requirements<br></u></strong><ul> <li>You have 2 + years professional experience</li> <li>You are fluent with SQL / relational algebra.</li> <li>You have mastered working with data in a language such as Python, R, or Julia.</li> <li>You’ve done data science at high scale with tools like Hadoop and Spark.</li> <li>You have backend programming experience in one or more languages.</li> <li>You have significant experience applying machine learning to real business problems.</li> <li>You want to work in a fast, high-growth startup environment and thrive on autonomy.</li> <li>You care about code simplicity and performance.</li> <li>You have a BS/MS/PhD in a scientific field or equivalent experience.</li> <li>You can explain complex ideas and algorithms in understandable ways.</li> <br><br></ul><strong><u>Bonus Points<br></u></strong><ul> <li>You’ve written production data pipelines.</li> <li>You’re familiar with time series analysis.</li> <br><br></ul><strong><u>Equal Opportunity At Datadog<br><br></u></strong>Datadog is an Affirmative Action and Equal Opportunity Employer and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.<br><br><strong><u>Your Privacy<br><br></u></strong>Any information you submit to Datadog as part of your application will be processed in accordance with Datadog’s Applicant and Candidate Privacy Notice.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06"
    },
    "company": {
        "name": "Datadog",
        "link": "https://www.linkedin.com/company/datadog"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10001",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}