{
    "job": {
        "title": "Data Scientist",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Hospital & Health Care"
        ],
        "description": "Founded in 2015 by neuroscientists and technologists Drs. David Eagleman and Yael Katz, BrainCheck helps reduce the human and economic toll of cognitive impairment and dementia through its interactive cognitive assessment and care management technology. We have traction with over 400 primary care and neurology practices as well as several brand-name health systems and payers. Our dynamic team is based in Houston and Austin, Texas.<br><br>Data Scientist<br><br>This is a unique opportunity to join a dynamic team in a fast-growing company and gain extensive experience and knowledge working in the R&amp;D team as we grow our team and expand our capacity. The ideal candidate will have a Masters or PhD with excellent statistical and data analytical skills, who is willing to embrace new challenges, is highly organized and motivated. We are committed to providing experience-based learning, multidimensional assignments, targeted training, and continual coaching and development.<br><br>Your charge<br><ul><li>Design, build and interpret statistical methods to address selected research hypotheses for clinical studies. </li><li>Design, build and maintain advanced machine learning/deep learning algorithms and analytics methods to support products and business needs.</li><li>Create insightful visualizations that can help a non-technical audience make informed decisions based on complex datasets.</li><li>Participate in ad hoc projects and tasks as needed. </li><li>Prepare research reports for presentation, and assist with preparation of manuscripts for publication. <br><br></li></ul><strong><u>About You<br></u></strong><ul><li>Master’s degree or higher in a quantitative field (Data Science, Biostatistics, Computer Science, Software Engineering, Operations Research, Applied Math, Statistics or related)</li><li>Knowledge of a wide range of statistics and machine learning techniques</li><li>1+ years of experience manipulating data sets and building statistical/machine learning models.</li><li>Fluency in statistical programming languages. Python is required (3+ experience) and R is also preferred. </li><li>An analytical and independent thinker with strong quantitative skills, who uses data to (ask and) answer questions.</li><li>An adept communicator, able to collaborate across the company and lead through influence. </li><li>Creative problem solver, quick learner and comfortable experimenting with new approaches. </li><li>Detail-oriented, multi-tasker. Able to effectively self-manage across multiple priorities. </li><li>You’re gritty, scrappy and hungry to change healthcare and the world</li><li>You thirst for knowledge and the application of it in practical settings</li><li>You’re humble enough to accept feedback and ask for help</li><li>You’re a self-starter and comfortable with ambiguity and a fast-paced environment </li><li>Competitive compensation consisting of cash and equity<br><br></li></ul><strong><u>Bonus Qualifications<br></u></strong><ul><li>Prior research or clinical study experience especially in Neuropsychology</li><li>Prior experience in healthcare industry</li><li>Knowledge and familiarity with clinical trials and experimental designs</li><li>Knowledge of deep learning techniques<br></li></ul>Powered by JazzHR<br><br>njPiCTMfDP",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-21"
    },
    "company": {
        "name": "BrainCheck",
        "link": "https://www.linkedin.com/company/braincheck"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}