{
    "job": {
        "title": "Embedded Systems Engineer (C++)",
        "industry": [
            "Restaurants",
            "Food & Beverages",
            "Food Production"
        ],
        "description": "Role: Embedded Systems Engineer (C++)<br>Work location: SouthField, MI<br>Duration: Long Term (Possible 3 months CTH)<br><br>&quot; \\&quot;System Engineer- Hardware -Key Responsibilities<br>• Discuss customers' AFC requirements and cascade them to the internal subject matter experts: System, Program Manager and Hardware/software design team.<br>• Confirm the team is committed and has concrete action plan to close any gap. Gather all necessary evidences to close all open items within pre-defined quality scope and time.<br>• Analyze applicable AFC industry standards (ASPICE, ISO 26262, ISO/SAE 21434..) to deliver the work package with the highest standard and quality targets.<br>• Develop and maintain well-defined engineer process to achieve in-house and customer driven AFC targets.<br>• Collaborate with internal stakeholders to achieve internal and external audits process targets.<br>• Collaborate with program management to identify customer AFC deliverable dates for assigned projects, confirm other internal stakeholders have closed or have action plan to close any open items within the time agreed.<br>• Regularly collaborate with DENSO local and global AFC team to align on DENSO's internal and customers' quality guidelines/requirements.<br>• Develop process flow documentation and milestone tracking tools; establish file sharing database.<br>• Identify and implement AFC best practice/lesson-learned.<br>• Prepare training materials for System and Product design team members, as well as customer.<br>• Support any relevant tasks as assigned<br><br>Please send Candidates with this information. If not sent, contractor will be rejected.<br><br>Legal name (First Name, Middle name and Last Name):<br>Location (City and State):<br>Relocate?<br>Rate:<br>Availability:<br>Phone #:<br>Mobile#:<br>LinkedIn ID:<br>Email address:<br>Visa type:<br>Visa Expiration Date:<br>Hiring Status:<br><br><strong><span><span><span>Disclaimer:&nbsp;<br>E-Solutions provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. We especially invite women, minorities, veterans, and individuals with disabilities to apply. EEO/AA/M/F/Vet/Disability.<br></span></span></span></strong>&nbsp;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-10-05"
    },
    "company": {
        "name": "E-Solutions",
        "link": "https://www.linkedin.com/company/e-solutions-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Southfield",
        "region": "MI",
        "postal_code": "48037",
        "street_address": null,
        "latitude": 42.480198,
        "longitude": -83.241
    }
}