{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Venture Capital & Private Equity"
        ],
        "description": "<p>Human Capital is a venture firm for engineers.&nbsp;We believe great engineers build great companies, and we invest in founders and startups that share that mindset.&nbsp;</p><p><br></p><p>In the last 5 years, that mantra has led us to invest in 10 companies before they became unicorns, including Snowflake, Anduril, Livongo, and Brex (where we wrote the first check). We have over $500M AUM and we've built a network of over 5,000 incredible, driven, ambitious engineers.</p><p><br></p><p>Now we're looking for fullstack engineers to help us build our next chapter.</p><p><br></p><p><strong>THE ROLE</strong></p><p>You’ll join a team of ~5, and partner across the company to build products and systems to maximize impact for our community: engineers, portfolio companies and investors. You’ll report to our Head of Engineering, and have a tangible impact on our culture and business. If you’re passionate about people, entrepreneurship, venture, and tech, we’d love to talk.</p><p>&nbsp;</p><p><strong>YOUR PAST</strong></p><ul><li>Ideally 2+ years of industry experience</li><li>Experience building and scaling web apps to broad audiences</li><li>Knowledge of databases, APIs, and foundation in data science</li><li>Comfortable with cloud technologies and continuous deployment</li><li>Full stack mentality - comfortable with frontend or backend</li><li>Participated in projects with technical and nontechnical stakeholders</li><li>Enjoy a fast-paced startup environment</li></ul><p>&nbsp;</p><p><strong>YOUR MINDSET</strong></p><ul><li>You thrive in ambiguity and can get going without a spec</li><li>You enjoy working directly with end users</li><li>You’re scrappy and have an entrepreneurial mindset</li><li>You’re data-driven in your decision making</li><li>You’re eager to make products that can impact the trajectory of early startups</li><li>You love learning about venture capital, finance, and emerging tech companies</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27"
    },
    "company": {
        "name": "Human Capital",
        "link": "https://www.linkedin.com/company/humandotcapital"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}