{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Construction",
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "Are you looking for a place to invest in your future? Then consider a job at TechFlow, where we provide opportunities for individuals to explore, learn and develop their careers while being part of an exciting team of professionals.<br><br>Here are some experiences you may have at TechFlow<br><br><li> Work with best-of-breed technologies</li><li> Have fun while being part of a professional team</li><li> Work in a challenging and dynamic environment</li><li> Work in a supportive learning atmosphere where opportunities for training and advancement are provided.<br><br></li>TechFlow is looking for multiple Software Engineers to design, develop and install software solutions. Software Engineer responsibilities include gathering user requirements, defining system functionality, and writing code in various languages, like Java, Ruby on Rails, or .NET programming languages (e.g. C++ or JScript.NET.) The ideal candidates are familiar with the software development life cycle (SDLC) from preliminary system analysis to tests and deployment. Ultimately, the role of the Software Engineer is to build high-quality, innovative, and fully performing software that complies with coding standards and technical design.<br>Key Responsibilities<br><ul> <li>Execute full software development life cycle (SDLC)</li> <li>Develop flowcharts, layouts, and documentation to identify requirements and solutions</li> <li>Write well-designed, testable code</li> <li>Produce specifications and determine operational feasibility</li> <li>Integrate software components into a fully functional software system</li> <li>Develop software verification plans and quality assurance procedures</li> <li>Document and maintain software functionality</li> <li>Troubleshoot, debug and upgrade existing systems</li> <li>Deploy programs and evaluate user feedback</li> <li>Comply with project plans and industry standards</li> <li>Ensure software is updated with the latest features</li> <br><br></ul><strong><u>Requirements<br></u></strong><ul> <li>Proven work experience as a Software Engineer or Software Developer</li> <li>Experience designing interactive applications</li> <li>Ability to develop software in Java, Ruby on Rails, C++, or other programming languages</li> <li>Excellent knowledge of relational databases, SQL, and ORM technologies (JPA2, Hibernate)</li> <li>Experience developing web applications using at least one popular web framework (JSF, Wicket, GWT, Spring MVC)</li> <li>Experience with test-driven development</li> <li>Proficiency in software engineering tools</li> <li>Ability to document requirements and specifications</li> <li>Bachelor's degree is preferred.</li> <li>General equivalency guidelines for education, certifications, and experience is provided below; however, these guidelines do not immediately qualify someone at a particular level. Skill levels for an individual are based upon a combination of education, training, and experience, e.g., someone may have 20 years of professional experience; however, they may only be qualified as Full Performance based upon the expertise needed to perform the work within that category. General professional years of experience may be substituted for specialized years of experience at a ratio of three (3) years of general experience within an occupation for one (1) year of specialized experience. Relevant certifications will be considered equivalent to three (3) months of specialized experience. An Associate’s degree in Computer Science, Information Systems, Engineering, Business, or a scientific or technical discipline related to the specific skill will be considered equivalent to eighteen (18) months of specialized experience. A Bachelor’s degree in Computer Science, Information Systems, Engineering, Business, or a scientific or technical discipline related to the specific skill will be considered equivalent to three (3) years specialized experience (total equivalency is not cumulative when combined with an Associate’s degree). A Master’s degree in Computer Science, Information Systems, Engineering, Business, or a scientific or technical discipline related to the specific skill will be considered equivalent to two (2) years specialized experience (up to a total of five (5) years when combined with a Bachelor’s). A Doctorate in Computer Science, Information Systems, Engineering, Business, or a scientific or technical discipline related to the specific skill will be considered equivalent to two (2) years of specialized experience (up to a total of seven (7) years when combined with a Master’s and a Bachelor’s). </li> <li>Active TS/SCI with poly</li> <br><br></ul><strong><u>Desired Qualifications<br></u></strong><ul><li>BSc degree in Computer Science, Engineering or relevant field<br></li></ul>#techflow<br><br><u><strong>Benefits<br><br></strong></u>TechFlow, Inc is 100% employee-owned. Come make a difference in a job that contributes to your future and helps us build an agile workplace!<br><ul> <li>Employee stock ownership plan (ESOP) – Pride in being an employee-owner and annual employer contribution (per plan guidelines)</li> <li>401k plan with Roth option.<br><ul> <li>Eligibility for an employer match.</li> <li>Immediate vesting</li> </ul> </li> <li>Paid time off</li> <li>Holidays – 10 paid holidays per year</li> <li>Comprehensive medical, dental, and vision plans</li> <li>Company-paid Life &amp; AD&amp;D insurance plan</li> <li>Employee Assistance Program</li> <li>Wellness Resources</li> <li>Company-paid training and development program</li> <li>Voluntary benefits include<br><ul> <li>Life &amp; AD&amp;D Insurance for employee, spouse, and children</li> <li>Short-term and long-term disability (per plan guidelines)</li> <li>Legal Shield and Identity Theft protection plans</li> <li>Pet Insurance</li></ul></li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-17"
    },
    "company": {
        "name": "TechFlow, Inc.",
        "link": "https://www.linkedin.com/company/techflow-inc."
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Herndon",
        "region": "VA",
        "postal_code": "22092",
        "street_address": null,
        "latitude": 38.96973,
        "longitude": -77.38387
    }
}