{
    "job": {
        "title": "Financial Information eXchange (FIX) Engineer",
        "industry": [
            "Capital Markets",
            "Banking",
            "Financial Services"
        ],
        "description": "<p>Optima is a fast-growing I.T. software and services firm based in New Jersey which specializes in providing Financial Process Automation and IT Consulting Services to enterprise customers across North America.&nbsp;</p><p><br></p><p>Currently, we are seeking a <strong>FIX Engineer</strong> to join our client, a fortune 500 financial services company on a <strong>fulltime permanent basis</strong>. Client is willing to sponsor the right candidate.</p><p><br></p><p><strong>Responsibilities:</strong></p><ul><li>Analyze data processing problems for electronic data processing systems. </li><li>Support and maintain FIX connections for electronic trading for Equities and rolling program for new client connections. </li><li>Direct support of FIX systems and Order Routing Infrastructure.</li><li>Analyze and research new functionalities.</li><li>Provide management support for FIX infrastructure to identify problems before clients are affected. Perform testing of QA environment for clients. Liaise with vendors regarding FIX specifications and configurations supported. Configure UAT FIX systems and complete tests. </li><li>Certify, Configure and Support FIX connections to clients for the purpose of Electronic Trading.</li><li>Testing with Clients in UAT environment where needed. Configure the UAT FIX systems and complete emergency tests.</li><li>Analyze, identify issues, and coordinate resolution to production issues.</li><li>Escalate issues when required to ensure timely resolution and track to closure.</li><li>Ability to handle stressful situations and be able to multi-task.</li><li>Consistently demonstrates integrity, fairness, and professional conduct.</li><li>Attentive to controls and addresses risk.</li><li>Liaise with external Order Management System (OMS) vendors, Network Vendors and Electronic Trading Desk to ensure priorities are defined and issues are tracked. </li><li>Support all DMA and Algorithmic trading flow across multiple asset classes</li><li>Work closely with Business, external client/vendor, network and dev teams.&nbsp;</li><li>Weekend work will be required on need basis. </li></ul><p><br></p><p><strong>Skills Required:</strong></p><ul><li>Strong FIX, SQL, Unix, Python/Perl Scripting, Automation experience</li><li>SQL, UNIX and any scripting skills</li><li>Good knowledge on incident reports and problem management.</li><li>User training, troubleshooting, development of support procedures, system testing, and implementation.</li><li>Exposure and experience with automation tools like Ayehu. </li><li>Knowledge and experience with Python, Perl.</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15"
    },
    "company": {
        "name": " Optima Global Solutions Inc.",
        "link": "https://www.linkedin.com/company/optima-global-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}