{
    "job": {
        "title": "DevOps Engineer - REMOTE",
        "industry": [
            "Internet"
        ],
        "description": "<strong><u>Company Description<br><br></u></strong>Medable's mission is to get effective therapies to patients faster. We provide an end-to-end, cloud-based platform with a flexible suite of tools that allows patients, healthcare providers, clinical research organizations and pharmaceutical sponsors to work together as a team in clinical trials. Our solutions enable more efficient clinical research, more effective healthcare delivery, and more accurate precision and predictive medicine. Our target audiences are patients, providers, principal investigators, and innovators who work in healthcare and life sciences.<br><br>Our vision is to accelerate the path to human discovery and medical cures. We are passionate about driving innovation and empowering consumers. We are proactive, collaborative, self-motivated learners, committed, bold and tenacious. We are dedicated to making this world a healthier place.<br><br><strong><u>Job Description<br></u></strong><ul><li>Develop a roadmap to the Engineering team for the Application and Infrastructure monitoring and availability</li><li>Identify innovative ways to research logs to uncover and report defects as well as to validate the Application</li><li>Incorporate best practices for the High Availability and Reliability of the Application &amp; Infrastructure</li><li>Meet the compliance requirements for the Software development process </li><li>Continuously improve the monitoring process to meet Service level Objectives</li><li>Participate and optimize the On-call rotation process</li><li>Implement tools and Develop Automation scripts for the smooth CI/CD of the software releases</li><li>Identify critical metrics to monitor and alert on the issues with software Applications</li><li>Use Tools to Apply data modeling and predictive analysis to anticipate issues</li><li>Work closely with the teams to resolve production issues and perform root cause analysis of the incidents</li><li>Document solutions, SRE architectural patterns, and best practices</li><li>Other duties as assigned<br></li></ul><strong><u>Qualifications<br></u></strong><ul><li>5+ years of experience in managing SRE operations in a complex Production environment</li><li>Experience with Automation using Python/Go programming or equivalent</li><li>Experience with YAML, JSON, bash shell scripting, and Linux command-line utilities</li><li>Experience in working with any of the configuration management tools: Ansible, Chef, Puppet, Salt</li><li>Experience working with CI/CD tools such as Jenkins, Gitlab or equivalent and Artifactory, Fastlane for both web and Mobile Platforms </li><li>Knowledge of working with Infrastructure-as-Code tools such as Terraform, CloudFormation, Google Cloud Deployment Manager</li><li>Experience working with Docker and Kubernetes monitoring and debugging</li><li>Experience with Monitoring solutions such as Datadog, Prometheus, Grafana or equivalent, etc.</li><li>Experience working with Log management using Tools</li><li>Experience with implementing Security Best practices</li><li>Solid troubleshooting experience in a large scale production environment</li><li>Expertise in AWS and GCP cloud Infrastructure and the related services <br></li></ul>Additional Information<br><br>All your information will be kept confidential according to EEO guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27"
    },
    "company": {
        "name": "Medable, Inc",
        "link": "https://www.linkedin.com/company/medable-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}