{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": [
            "Information Technology and Services",
            "Defense & Space",
            "Computer Software"
        ],
        "description": "<strong><strong>Join our team dedicated to developing and executing innovative solutions in support of customer mission success. Novetta is committed to cultivating a diverse, inclusive workplace culture, embracing our differences and perspectives to build a stronger, more successful company.<br><br></strong></strong><strong>Job Description: <br><br></strong>Novetta is seeking a Machine Learning Engineer to collaborate with a team of machine learning researchers and software developers to develop novel, customer ready solutions for challenging mission use cases.<br><br><strong>Responsibilities include:<br><br></strong><ul> <li>Contribute to projects spanning multiple subject areas such as NLP, Cloud, Image, and Video Analysis</li> <li>Apply state-of-the-art machine learning techniques, methods, and platforms</li> <li>Build scalable, state-of-the-art cloud-based data processing solutions</li> <li>Author presentations that clearly communicate data analytics and machine learning concepts to both technical and non-technical audiences</li> <br></ul><strong>Basic Qualifications:<br><br></strong><ul> <li>Experience or coursework programming (such as with Python, R, Java, or other programming languages)</li> <li>Experience or coursework with machine learning and statistics</li> <li>Ability to work both independently and collaboratively</li> <li>Strong written and verbal communication skills</li> <br></ul><strong>Desired Skills:<br><br></strong><ul> <li>High levels of curiosity and drive to solve hard problems</li> <br></ul><strong>Security Clearance:<br><br></strong><ul> <li>Candidates must be eligible for a US government security clearance.</li> <br><br></ul><strong>Novetta, from complexity to clarity.<br><br></strong><em>Novetta delivers highly scalable advanced analytics and secure technology solutions to address challenges of national and global significance. Focused on mission success, Novetta pioneers disruptive technologies </em><em>in machine learning, data analytics, full-spectrum cyber, cloud engineering, open source analytics, and multi-INT fusion</em><em> for </em><em>Defense, Intelligence Community, and Federal Law Enforcement customers. Novetta is headquartered in McLean, VA with over 1,300 employees across the U.S.<br><br></em><strong>Our culture is shaped by a commitment to our core values:<br><br></strong><strong>Integrity <li> We hold ourselves accountable to the highest standards of integrity and ethics.<br><br><strong>Customer Success <li> We strive daily to exceed expectations and achieve customer mission success.<br><br><strong>Employee Focus <li> We invest in our employees' professional development and training, respecting individuality, and fostering a culture of diversity and inclusion.<br><br><strong>Innovation <li> We know that discovering new and innovative ways to solve problems is critical to our success and makes us a great company.<br><br><strong>Excellence in Execution <li> We take pride in flawless execution as we build a company that is best in class.<br><br><strong>Earn a REFERRAL BONUS for the qualified people you know. <br><br></strong>For more details or to submit a referral, visit bit.ly/NovettaReferrals.<br><br><strong>Novetta is an equal opportunity/affirmative action employer.<br><br></strong>All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.</li></strong></li></strong></li></strong></li></strong></li></strong>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-16"
    },
    "company": {
        "name": "Novetta",
        "link": "https://www.linkedin.com/company/novetta"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Herndon",
        "region": "VA",
        "postal_code": "22092",
        "street_address": null,
        "latitude": 38.96973,
        "longitude": -77.38387
    }
}