{
    "job": {
        "title": "Tier-3 Support Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Internet"
        ],
        "description": "Cybereason gives organizations the upper hand by taking an entirely new approach to cybersecurity with AI Hunting, the first AI-powered technology that answers the question “Am I under attack?” proactively, without manual effort.<br><br>We are a company that wins as one. We are daring, always evolving, and never give up. Most importantly we accept our employees for who they are and embrace people that may not fit the typical mold #UBU.<br><br>We are looking for a bright Technical Support Tier 3 Engineer who will provide enterprise level technical support for our customers. As a part of the ongoing job, the ideal candidate will perform customer support tasks for Cybereason’s innovative hunting platform.<br><br><strong><u>What You'll Do<br></u></strong><ul> <li>Be part of the customer support team of the company and report to support manager</li> </ul><ul> <li>Handle incoming supports calls/emails of existing and onboarding customers under defined SLA’s</li> </ul><ul> <li>Finding creative solutions, possess out of the box thinking to unique problems, and capable of thriving under pressure</li> <li>The position requires acting as the technical focal point for customers, investigating and analyzing complex customer scenarios and providing innovative solutions for their needs</li> <li>Collaborate with Product team and R&amp;D scrum teams to ensure Cybereason’s hunting platform are designed for supportability</li> <li>Maintain a list of known issues, workarounds, and planned fixes</li> <br><br></ul><strong><u>What We're Looking For<br></u></strong><ul> <li>Experience as a Tier 2/3 Technical Support - at least 2 years</li> <li>Proven experience with Linux, Bash and Python</li> <li>Databases (MySQL, Mongo) - Advantage</li> <li>Technical understanding and troubleshooting experience in web products and environments</li> <li>Strong client-focus and collaborative work style. Ability to understand and explain technical information</li> <li>Available to shift work 24/6.</li> </ul><ul> <li>Thrives under pressure</li> <li>Be the technical focal point for customers</li> <li>Collaborative work style</li> <li>Ability to understand and explain technical information</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03"
    },
    "company": {
        "name": "Cybereason",
        "link": "https://www.linkedin.com/company/cybereason"
    },
    "education": {
        "required_credential": "associate degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}