{
    "job": {
        "title": "Senior Project Manager",
        "industry": [
            "Electrical/Electronic Manufacturing",
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<strong><u>Overview<br><br></u></strong>We continue to experience rapid growth as we invest in resources and create new opportunities, as a result, we have exciting opportunities for a <strong> Sr. Software Engineering Project Manager </strong> to join our PMO team in <strong> Rockleigh, NJ 07647. <br><br></strong>Seeking a talented and experienced Sr. Software Engineering Project Manager to make a difference and be part of a collaborative team that works to build innovative products. In this position, you will be responsible for managing large and small technical programs across various software groups within the organization. The ideal candidate will have a proven track record of successfully planning and executing complex product development programs from concept to launch.<br><br><strong><u>Responsibilities<br></u></strong><ul><li> Work cross-functionality to plan and track software. </li><li> Create development schedule, identify critical path, and maintain throughout execution. </li><li> Ensure excellent inter-team coordination and communication. </li><li> Understand complex technical items and abstract issues/risks into actionable items </li><li> Effectively and consistently communicate overall program status to teams and executives. <br><br></li></ul><strong><u>Qualifications<br></u></strong><ul><li><ul><li> A minimum of Bachelor’s degree in Engineering, Computer Science or related technical field is preferred<br></li><li> Ideal candidate will have combined experience of at least 10 years within the software or high-tech electronics industry in the capacity of either a software developer or design engineer and later as a development manager or project manager/lead. </li><li> Well-versed and proven success utilizing Agile and waterfall project management principles </li><li> Must be a proven leader of teams and development projects </li><li> A minimum of 5 years of Project Management experience is required. </li><li> Effective working across the full software lifecycle and across engineering disciplines and product lines is required </li><li> Technical depth and demonstrated experience in software development, including object oriented design and development is required </li><li> Software / Systems integration experience, including interface definition, system configuration, and leading system execution is required </li><li> Working knowledge of software engineering processes and development lifecycles is required. </li><li> Excellent communication, presentation, organizational and leadership skills is required </li><li> Motivated, team-oriented individual with strong problem-solving abilities is required </li><li> MS Engineering Management and/or PMP certification a plus <br></li></ul><strong> EOE/M/F/D/V <br><br></strong><strong><u>Benefits<br><br></u></strong>At Crestron Electronics, we offer a competitive total compensation package including medical, Dental, Vision, Life Insurance and Short Term Disability. 401K with company contribution, Paid Vacation, Holidays and more!<br><br>We have new onsite state of the art fitness and wellness centers at our Headquarters in Rockleigh, NJ.<br><br><strong> Must be able to work in the US without sponsorship <br><br></strong><strong> <li>No Solicitation* <br><br>Any agency submittal to any and all employees of Crestron Electronics, Inc by any method of communication will be deemed, the sole property of Crestron Electronics Inc. <br><br></li><strong>Options<br><br></strong>Apply for this job online Apply<br><br>Share<br><br>Email this job to a friend Refer<br><br>Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.<br><br>Share on your newsfeed<br><br>EOE/M/F/D/V</strong></li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22"
    },
    "company": {
        "name": "Crestron Electronics",
        "link": "https://www.linkedin.com/company/crestron"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Rockleigh",
        "region": "NJ",
        "postal_code": "07647",
        "street_address": null,
        "latitude": 41.00443,
        "longitude": -73.92993
    }
}