{
    "job": {
        "title": "Embedded Software Engineer",
        "industry": [
            "Telecommunications"
        ],
        "description": "<p>As a Software Engineer, you will work with a premier team developing and deploying new technologies on a next-generation satellite network. </p><p><br></p><p>The groundbreaking satellite network is redefining what is possible with satellite-based internet service requiring you to innovate, design, and develop in the world of secure software-defined satellite communication.</p><p><br></p><p>Viasat’s unique position as a service provider and equipment manufacturer allows you to experience the whole life cycle of networking software development – all the way from design to deployment.</p><p><br></p><p><strong>Requirements</strong></p><ul><li>5+ years of software engineering experience with coding and debugging skills in C, and C++ on Linux</li><li>Experience with encryption and authentication software</li><li>Experience with OpenSSL crypto libraries</li><li>Experience with bash and Python scripting in Linux</li><li>Possess a DevOps approach</li><li>Up to 20% travel to Carlsbad, CA if not currently in the area</li></ul><p><br></p><p><strong>Preferences</strong></p><ul><li>Deep knowledge of OS features like Multi-threading, synchronization, memory management, and networking on Linux or Linux-like Operating systems</li><li>Experience with Linux device driver design, development, and test, in addition to kernel crypto module</li><li>Experience with implementing REST APIs and working with JSON (preferably in C or C++)</li><li>Experience configuring/debugging embedded HTTP(S) servers</li><li>Background in data structures and algorithm design</li><li>Proficient in software development tools, source code control environment</li><li>Experience designing and implementing networking protocols at the phy, mac, transport, and application layers</li><li>Experience working in an Agile / Scrum development environment</li><li>Experience with modern updates to the C++ language (C++14)</li><li>Experience with ARM53 CPUs</li><li>Experience with ARM TrustZone</li><li>Experience with TLS protocols</li></ul><p></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23"
    },
    "company": {
        "name": "Viasat Inc.",
        "link": "https://www.linkedin.com/company/viasat"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}