{
    "job": {
        "title": "Senior Software Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software"
        ],
        "description": "<p>X by 2 is a consulting firm specialized in business and technology transformation for healthcare and insurance clients. We enable our clients to achieve their most strategic business goals by aligning people, processes and technology across their enterprise. Careers with X by 2 offer rapid growth, constant learning, and the immediate chance to make an impact.</p><p><br></p><p>We're looking for people that have been playing senior software design and software development roles but seek accelerated opportunities to take on more technical leadership roles. The ideal candidate has a passion for technology and the desire to take on new challenges with various technologies.</p><p><br></p><ul><li>Play senior developer roles in designing, developing, testing and rolling&nbsp;out&nbsp;core business applications and data/analytics solutions&nbsp;for insurance and healthcare clients.</li><li>Quickly learn to use new tools, technologies and platforms across various technology stacks as needed for the client/project.</li><li>Mentor and perform design reviews and code reviews for fellow developers on the team.</li><li>Collaborate with fellow Developers, Technical Leads and Architects on architecture, design and development.</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Experience designing and developing enterprise class business applications, integration solutions and/or data solutions using technologies such as Java/J2EE, .NET, JavaScript and SQL</li><li>Experience guiding and mentoring junior developers</li><li>Strong problem-solving skills</li><li>Excellent verbal communication, written communication and interpersonal communication skills</li><li>Willingness to travel on an occasional basis, as local and possibly out-of-state travel is required.&nbsp;<strong><em>Due to COVID, this position is currently remote.</em></strong></li><li>Bachelor’s degree in Computer Science, Information Systems or related is preferred.</li></ul><p><br></p><p><strong>Our Philosophies</strong></p><ul><li>Agile approach – emphasis on good people, continuous delivery of value, close collaboration with clients</li><li>Learning and reuse by leveraging patterns and frameworks</li><li>Deliver results by playing key leadership roles on capable teams focused on full life-cycle from discovery and planning through implementation and launch</li><li>No technology bias and no affiliations with vendors – we use the technologies and approaches that make sense for our clients</li><li>Constant learning – adding modern technologies, frameworks, tools and products to our tool belt</li></ul><p><br></p><p><strong>Work Environment and Culture</strong></p><ul><li>Be surrounded by smart talented people with shared values of continually challenging, investing in, and stretching themselves to new levels</li><li>Collaborate with seasoned architects to solve problems and to challenge assumptions</li><li>Work in small teams with opportunities for rapid growth and accelerated responsibilities driven purely by individual performance</li><li>Everyone has a voice and is always encouraged to engage in shaping the company by sharing their interests, ideas, and feedback</li></ul><p><br></p><p><strong>Benefits and Perks</strong></p><ul><li>Health, Vision, Dental, Life, Disability</li><li>401(k) with employer match</li><li>Annual reviews, raises, and promotions&nbsp;</li><li>Programs: Professional Development, Wellness, Professional Dress Allowance</li><li>Discretionary Points and Travel Points redeemable for cash or additional time off</li><li>Company sponsored social events for employees and families</li><li>Work-Life Balance: flexible hours, vacation days, sick days, personal days, holidays</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05"
    },
    "company": {
        "name": "X BY 2",
        "link": "https://www.linkedin.com/company/xby2"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Farmington",
        "region": "MI",
        "postal_code": "48331",
        "street_address": null,
        "latitude": 42.509872,
        "longitude": -83.40804
    }
}