{
    "job": {
        "title": "Data Scientist",
        "industry": [],
        "description": "<p><strong>Turnt Gaming&nbsp;</strong>is a technology company that is changing how the world plays games. Combining blockchain based gaming with live entertainment, we believe the combination of gaming and live interaction is the next entertainment revolution. </p><p>&nbsp;</p><p>As a company, we are looking for dreamers who think big. We want people passionate about blockchain and how it can affect gaming. We want people who are ambitious and want to build something meaningful and cutting edge.&nbsp;</p><p><br></p><p>The ideal candidate's favorite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the right answers.&nbsp;</p><p>&nbsp;</p><p><strong>Responsibilities</strong></p><ul><li>Analyze raw data: assessing quality, cleansing, structuring for downstream processing</li><li>Spearhead the creation of game economy, leveling systems, game mechanics, and blockchain tokenomics</li><li>Design accurate and scalable prediction algorithms</li><li>Build machine learning/AI based data feeds for live prediction platforms</li><li>Collaborate with engineering team to bring  prototypes to production</li><li>Setup up reporting tools and structure for</li><li>Generate actionable insights for business improvements</li></ul><p><br></p><p><strong>Qualifications</strong></p><ul><li>Bachelor's degree or equivalent experience in quantative field (Statistics, Mathematics, Computer Science, Engineering, etc.)</li><li>At least 5 years' of experience in quantitative analytics or data modeling</li><li>Deep understanding of predictive modeling, machine-learning, clustering and classification techniques, and algorithms</li><li>Understanding of decision tree modeling and game theory </li><li>Fluency in a programming language (Python, C,C++, Java, SQL)</li><li>Familiarity with Big Data frameworks and visualization tools</li><li>Experience with game economy or block chain economics preferred</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17"
    },
    "company": {
        "name": "Turnt Gaming ",
        "link": "https://www.linkedin.com/company/turnt-gaming"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Greater Seattle Area",
        "region": null,
        "postal_code": "98109",
        "street_address": null,
        "latitude": 47.591396,
        "longitude": -122.33279
    }
}