{
    "job": {
        "title": "Data Scientist",
        "industry": [
            "Consumer Services"
        ],
        "description": "<p>Ledgent Technology in Atlanta is actively looking for a Data Scientist with experience in SQL, R and Python for a permanent position with our client in the Gwinnett area!</p><p><br></p><p><strong><u>CANDIDATES MUST BE LOCAL TO THE METRO ATLANTA AREA TO BE CONSIDERED FOR THIS OPPORTUNITY.</u></strong></p><p><br></p><p>The Financial Data Scientist will provide ongoing analytical, modeling, and data mining for our client.&nbsp;This position will develop solutions and relevant analysis with assistance from the VP, Financial Analysis &amp; Planning and other senior financial analysts to solve financial information problems and requests. This position partners closely with Finance, Accounting, and Operations to utilize datamining skills, financial modeling, and Adaptive Insights planning tool to provide relevant and timely financial analysis, profitability analysis, and strategy business insights for the Company.</p><p><br></p><p>This position must be able to work with series data and perform data analysis, which means a solid background in statistics, operations, and predictive analytics. <strong>Fluency in R and Python, as well as SQL and NoSQL to retrieve the data from datasets is expected..</strong></p><p>&nbsp;</p><p><br></p><p>Major Duties/Responsibilities:</p><p><strong><u>&nbsp;</u></strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Develop, build and maintain complex financial models</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Assists in developing annual plan and quarterly forecasts within Adaptive Planning Tool including financial modeling of income, expenses, receivables, debt, and losses using established drivers and metrics.&nbsp;</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Having wide-range experience, he/she uses professional concepts and company objectives to resolve complex issues in creative and effective ways.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Manage Adaptive integration with internal and external systems, including NetSuite general ledger system for actuals and operational data from QlikView and SQL queries of our loan originations and servicing systems</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Develops successful solutions to resolve operational requests for product or branch analysis, business ratios, and key performance indicators.</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Implementation and maintenance of monthly datasets within a consolidated database for management reporting and product analysis</p><p><br></p><p><strong>&nbsp;</strong></p><p><strong>BASIC REQUIREMENTS:</strong></p><p><strong>&nbsp;</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Bachelor’s Degree in a related discipline in Quantitative Analysis, Computer Science, Statistics, or Engineering, Finance, or Economics required)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Minimum 4-5 years professional work experience in data mining, or statistical modeling</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Fluency with data, analytics, and visualization technologies (e.g. SQL, Python, Tableau)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Advanced proficiency in Microsoft Excel, and familiarity with BI tools</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Self-motivated with the ability to deliver quality results while managing shifting priorities</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Expert in creating and maintaining complex financial models and working extensively with large messy data sets, dealing with missing fields, and identifying outliers</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Expertise in set up and implementation of dashboards or key performance metrics</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Interpersonal skills necessary to interact effectively with a variety of individuals</p><p><br></p><p><strong>&nbsp;&nbsp;</strong></p><p><strong>PREFERRED QUALIFICATIONS:</strong></p><p><strong>&nbsp;</strong></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience in use of NetSuite ERP software or comparable general ledger system (cloud-based software)</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Experience in Adaptive Insights/Workday planning tool and forecasting/budget preferred</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Master’s degree in a quantitative field such as Decision Science, Data Science, Mathematics, Statistics, Computer Science, Operations Research, Engineering, Finance, or Economics Experience</p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3+ years working in the financial services industry</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13"
    },
    "company": {
        "name": "Ledgent Technology",
        "link": "https://www.linkedin.com/company/ledgent-technology"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Duluth",
        "region": "GA",
        "postal_code": "30199",
        "street_address": null,
        "latitude": 34.003796,
        "longitude": -84.14555
    }
}