{
    "job": {
        "title": "Sr/Lead Software Engineer - Python, NLP, ML (REMOTE)",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Financial Services"
        ],
        "description": "If you are a Sr/Lead Software Engineer coming from a strong Python + NLP/ML background, looking for full remote, please read on!<br><br>Located in San Mateo, California - we are a VC-funded company disrupting a $15B market and using A.I. to mine unstructured data. Our founders include some of the top Big Data startup veterans with excellent track records.<br><br>These all will be full time offering base pay + generous equity + full benefits + full remote.<br><br>What You Will Be Doing<br><ul><li> We are looking for a Sr. Software Engineer itching to solve large, real world problems by applying NLP/ML techniques on unstructured Enterprise data - e.g., emails, call transcripts, and documents.</li><li> You will be responsible for design and development of enterprise grade features and micro-services involving information retrieval, text mining, classifier models, and recommender systems.</li><li> The role also requires proficient understanding of computer programming fundamentals and solid knowledge of Python and structural programming languages such as Java.</li><li> Our application is designed to run both on-prem and SaaS, hence understanding of docker based microservices is required.<br></li></ul>What You Need for this Position<br><ul><li> 7+ years experience in software development, of which 4+ years are in Python, Flask or Django, Restful Frameworks, information retrieval processing with Pandas, and NLP frameworks--including but not limited to Stanford Core NLP, NLTK, and Scikit-learn</li><li> Experience implementing modern ML classifier models and recommender systems (e.g., Bayesian Adaptive Method)</li><li> Proficiency in development stacks including SQL and NoSQL, JSON formats, Restful Services</li><li> Comfortable running Docker containers for sandbox development and during code integration</li><li> Experience with Linux, Java, Spring, Elastic Search, Postgres, Cassandra, and AWS EC2 systems is an added plus<br></li></ul>What's In It for You<br><ul><li> Competitive base pay</li><li> Equity</li><li> Full benefits package</li><li> HUGE room for career growth!<br></li></ul>So, if you are a Sr/Lead Software Engineer looking for a challenge, please apply today!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Bobby.June@Optello.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : BJ1-1639072 -- in the email subject line for your application to be considered.***<br></li></ul>Bobby June - Recruiting Manager - Optello<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>Optello is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Mateo",
        "region": "CA",
        "postal_code": "94406",
        "street_address": null,
        "latitude": 37.54715,
        "longitude": -122.3144
    }
}