{
    "job": {
        "title": "Machine Learning Engineer - Marketing",
        "industry": [
            "Marketing and Advertising"
        ],
        "description": "<p>A leading tech company in Boston is looking for experienced Data Scientists to join their team. As a lead Data Scientist here, you will enhance customer experience and drive business. You will work on customer facing data problems and develop Machine Learning models put into production.<br><br></p><p> <br><br></p><p>You will:<br><br></p><p>Work across teams to drive algorithmic decision making<br><br></p><p>Build and extend Machine Learning frameworks for scalable model training and deployment<br><br></p><p>Serve as a technical leader for members of your team<br><br></p><p> <br><br></p><p>About you:<br><br></p><p>5+ years in industry as a Data Scientist, Machine Learning Engineer, or Software Developer<br><br></p><p>Advanced degree in a quantitative field<br><br></p><p>Strong Python programming<br><br></p><p>Ability to build and deploy advanced Machine Learning software<br><br></p><p>Strong communication skills - ability to communicate with business leaders<br><br></p><p>Interest in deploying machine learning models as a scalable service<br><br></p><p> <br><br></p><p>If this sounds like you, please apply to learn more! References will be collected upon contact<br><br></p><p>Sthree US is acting as an Employment Agency in relation to this vacancy.<br><br><br></p><p> <br><br></p><br><br><p><strong>EOE Statement: </strong>Specialist Staffing Group is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.<br><br></p><br><p> <br><br></p><br><p><span><em><strong>To find out more about Huxley please visit www.huxley.com<br><br></strong></em></span></p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-16"
    },
    "company": {
        "name": "Huxley",
        "link": "https://uk.linkedin.com/company/huxley"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}