{
    "job": {
        "title": "Software Engineer",
        "industry": [
            "Computer Software",
            "Venture Capital & Private Equity"
        ],
        "description": "<p><strong><u>About Us</u></strong></p><p>Sweat Equity Ventures is a VC firm with a new model of investing meant to massively accelerate momentum and value. We supercharge founding teams with world-class talent in go-to market, business &amp; product strategy, pricing, sales, operations and recruiting. Our experts have built teams, driven growth, priced new SaaS offerings, and built monetization for generational companies such as MongoDB, LinkedIn, Salesforce, Uber, Facebook and others.</p><p><br></p><p><strong><u>Job Opportunity</u></strong></p><p>We are looking for backend and frontend software engineers (new grad to mid-level) to hire full-time within one of our startups. </p><p><br></p><p>Our team focuses on forming and scaling technology startups innovating in areas such as GovTech, Blockchain, Education, Productivity, Zero Code Platforms, Collaboration, Security, FinTech, Machine Learning, Internet of Things, etc. These companies range from early stage to growth stage startups.</p><p><br></p><p>These are FTE positions with our portfolio companies which range in industry and size. The roles are onsite at locations such as San Francisco, Los Angeles, and New York.</p><p><br></p><p><strong><u>Responsibilities</u></strong></p><ul><li><span>Work in a highly collaborative, fast-paced startup environment&nbsp;</span></li><li><span>Develop and ship backend or frontend features into production</span></li><li><span>Own projects from the ground up</span></li><li>Sample technologies include Typescript, React.js, Vue.js, Node.js, GraphQL, Swift, Web Assembly, Kubernetes, Docker, AWS (varies based on the company and role)</li></ul><p><br></p><p><strong><u>Application Process</u></strong></p><p>We will contact individuals as soon as we identify a potential match. Once contacted, a member of our team will explain our VC recruiting model, get to know you better, and share relevant startup opportunities within our portfolio with you.</p>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06"
    },
    "company": {
        "name": "Sweat Equity Ventures",
        "link": "https://www.linkedin.com/company/sweatequityventures"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}