{
    "job": {
        "title": "Computer Science Co-op",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Automotive"
        ],
        "description": "<strong><u>Overview<br><br></u></strong>Hunter Engineering Company is a global leader in the development and manufacturing of computer based automotive service equipment. We are in search of an enthusiastic and self-motivated sophomore, junior, or senior with a major or minor in a field of study cohesive with Computer Science/Computer Engineering.<br><br><strong><u>Job Summary<br><br></u></strong>This position will focus on exposing an aspiring software engineer to the total software evolution process from planning to deployment. Our goal is to provide an experience that will be an important, effective first step in the career of a future software engineer.<br><br><strong><u> TIME FRAME : January 2022 – May/August 2022 <br><br></u></strong><strong><u>Responsibilities<br><br></u></strong>The individual will be involved in a variety of projects which may include:<br><ul><li> Developing web frontends with frameworks such as React</li><li> Designing functional tests to be automated in a browser</li><li> Unit testing methodologies</li><li> Practice and experiences deploying resources to production</li><li> Development of Azure serverless functions</li><li> Research and prototype using new 3rd party libraries</li><li> Developing web based APIs in C# ASP.NET<br></li></ul><strong><u>Co-Op Gains Experience In<br></u></strong><ul><li> Cloud based development (Azure)</li><li> Varity of open source and Microsoft technologies</li><li> General software development practices such as unit testing, design patterns and clean code.</li><li> Developing software in an agile environment, including user story development, Agile planning, code reviews and self-evaluation.<br></li></ul><strong><u>What To Expect<br><br></u></strong>It will be our intent and purpose to provide the individual with real world experience, which includes assisting in the progression of a product from concept stage to production. The work done by co-ops in this position is applied to actual Hunter products. The work is normally very individualized even if you are working in a larger group. We host many co-ops annually. Our goal is to provide an experience that will be an important, effective first step in the career of a future engineer.<br><br><strong><u>Also Visit Our Website For Testimonials From Previous Co-ops<br><br></u></strong>https://www.hunter.com/about-us/careers/co-op/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27"
    },
    "company": {
        "name": "Hunter Engineering Company",
        "link": "https://www.linkedin.com/company/hunter-engineering"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Bridgeton",
        "region": "MO",
        "postal_code": "63044",
        "street_address": null,
        "latitude": 38.755707,
        "longitude": -90.4183
    }
}