{
    "job": {
        "title": "Data Strategy Data Scientist",
        "industry": [
            "Banking",
            "Financial Services",
            "Investment Banking"
        ],
        "description": "<p>Jefferies is seeking a Data Scientist to join the Data Strategy team within Equity Research.</p><p><strong><u>Responsibilities Will Include</u></strong></p><ul><li>Work closely with Head of Data Strategy in creation of fundamental models, design of data tools, coordination with global sector team, evaluation of external alternative data vendors and ad-hoc research projects.</li><li>Interact with key data partners to communicate business cases, company drivers and other KPI's relevant to fundamental stock evaluation.</li><li>Query, transform, combine and expand datasets to assist teams in knowledge extraction.</li><li>Interface with data vendors, internal research teams, internal sales and trading personnel, and external institutional investors.</li><li>Conceive and executing on differentiated research projects across sectors and data types. </li></ul><p><strong><u>Key Qualifications</u></strong></p><ul><li>4+ years of experience within consulting, data research, data science or similar roles.</li><li>Advanced STEM degree such as data science, computer science, engineering or statistics preferred</li><li>Prior experience in a strategic, quantitative or risk role is desirable.</li><li>Deep knowledge of data science programming languages is required (such as R, Python, SQL, Scala)</li><li>Knowledge of cloud computing environments is helpful.</li><li>Knowledge of fundamental financial modeling is not a must but helpful.</li><li>Keen interest in the “data economy” within financial services.</li><li>Motivated, intelligent, curious, hard-working, team player</li></ul>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Jefferies",
        "link": "https://www.linkedin.com/company/jefferies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}