{
    "job": {
        "title": "Senior Java Software Engineer",
        "industry": [],
        "description": "<br><p><strong>Senior Java Developer with MicroServices</strong></p><p><strong>12+ Months Contract</strong></p><p><strong>St. Louis, MO</strong></p><p><br></p><p>Open only for H1B , GC, USC</p><p><br></p><p><strong>****Strictly No OPT / CPT / H4 / TN Visa****</strong></p><p><br></p><p><strong>Qualifications:</strong></p><p>Minimum 9+&nbsp;years of IT software Development experience especially in Core Java concepts and Advanced Java, Multi-Threading collections/Exceptions.</p><p>Development of applications using Java/J2EE, Microservices,Spring, Spring Boot, Hibernate, Pivotal cloud foundry</p><p>Strong experience in Spring-boot, Microservices is required.</p><p>Strong Java developer with very good understanding of micro services.</p><p>Grasp of software engineering skills in modular design, data structures, algorithms</p><p>Deep knowledge and hands on experience with modern applications like spring boot, Angular.</p><p>Experience building and operating critical production systems</p><p>Solid understanding of modern API design and Restful principles</p><p>Fluent with git (preferred) or other SCM system</p><p>Write well designed and testable code</p><p>Strong Experience in automation and build tools like Maven, Ant and Gradle.</p><p>Bachelor's degree in computer science engineering or a related discipline, or equivalent work experience.</p><p>Experience in software development design and implementation of large scale distributed systems and web services building complex software that is testable and designed for extensibility.</p><p>Good understanding of building, deploying, and maintaining critical applications in a cloud based environment.</p><p>Work extensively with open source software capable to modify or extend code maintained as part of an open source project.</p><p>Employ both Object Orientated development skills and Systems Engineering skills</p><p><br></p>",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "Confidential",
        "link": "https://www.linkedin.com/company/confidentialcompany"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "St Louis",
        "region": "MO",
        "postal_code": "63121",
        "street_address": null,
        "latitude": 38.635357,
        "longitude": -90.20099
    }
}