{
    "job": {
        "title": "Associate Scientist - Polysaccharide Process Development",
        "industry": [
            "Biotechnology"
        ],
        "description": "If you are a Associate Scientist with Polysaccharide Process Development experience, please read on!<br><br>We are a publicly-traded vaccine company with multiple strong therapeutic candidates in our pipeline. Our team is composed of high EQ and high IQ scientists who want to make the world a better place. We offer competitive pay, comprehensive benefits and equity.<br><br>Top Reasons to Work with Us<br><ul><li> Be part of cutting-edge, meaningful research</li><li> Make a difference in the world</li><li> Earn a competitive salary</li><li> Great Location</li><li> Awesome manager<br></li></ul>What You Will Be Doing<br><br>As the Associate Scientist in Polysaccharide Process Development, you will be responsible for developing process in fermentation, microbiology, biopharma and vaccines. You will have the opportunity to learn new processes. You will spend 60% + of your time in the lab. You will work with the team to design/perform experiments and present data internally.<br><br>What You Need for this Position<br><br>Master degree - 0 + years experience<br><br>Bachelors degree - 1 + years experience<br><br>Prior experience working with bioreactors for fermentation experiments<br><br>What's In It for You<br><ul><li> Competitive Salary</li><li> Comprehensive Benefits</li><li> Equity in the company</li><li> Opportunity to be part of meaningful research at a fast-growing company<br></li></ul>So, if you are a Associate Scientist with Polysaccharide Process Development experience, please apply today!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Alexander.Charles@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : AC11-1645708 -- in the email subject line for your application to be considered.***<br></li></ul>Alexander Charles - Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Foster City",
        "region": "CA",
        "postal_code": "94029",
        "street_address": null,
        "latitude": 37.561882,
        "longitude": -122.26644
    }
}