{
    "job": {
        "title": "PLC Engineer - PLC Engineer, Controls Engineering",
        "industry": [
            "Mechanical or Industrial Engineering"
        ],
        "description": "If you are a PLC Engineer with experience, please read on!<br><br>Operating for over 30 years, we are the industry leading robot automation engineering, manufacturing company. Our headquarters is located in Michigan with over 100 highly trained/ experienced automation and controls engineers. We work diligently and collaboratively with clients to provide with the highest level of automation systems worldwide.<br><br>We service over 600 clients and we are rapidly growing! Due to our successful growth we are looking for a PLC/Controls Engineer to join our team!<br><br>What You Need for this Position<br><ul><li> PLC Engineer</li><li> Controls Engineering</li><li> Controls Engineer</li><li> Hardware Design</li><li> Software Design</li><li> PLC Programming</li><li> General Motors</li><li> GCCS certification</li><li> GCCH certification<br></li></ul>What's In It for You<br><br>We offer a very competitive base<br>Strong bonus structure<br>Full benefits<br>PTO<br>401k<br><br>So, if you are a PLC Engineer with experience, please apply today!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Wendy.Alvarado@CyberCoders.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : WA1-1621835 -- in the email subject line for your application to be considered.***<br></li></ul>Wendy Alvarado - Sr. Executive Recruiter - CyberCoders<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>CyberCoders, Inc is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Kalamazoo Charter Township",
        "region": "MI",
        "postal_code": "49012",
        "street_address": null,
        "latitude": 42.307133,
        "longitude": -85.6288
    }
}