{
    "job": {
        "title": "Lead/Principal Software Engineer, Tableau Prototyping team",
        "industry": [
            "Computer Software",
            "Information Technology and Services",
            "Internet"
        ],
        "description": "<em>To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.<br><br></em><strong> Job Category </strong>Products and Technology<strong> Job Details <br><br></strong><strong><u>What You’ll Be Doing…<br><br></u></strong>Tableau’s Prototype Engineering team designs and develops prototypes of early ideas that could lead to new features, functionality, or even products with a goal of quickly proving out ideas before we take them to production. We’re looking for generalists who love to tackle complex issues and excel working on ambiguous problems! Join us to leverage your creativity and experience to imagine and create new capabilities or products that change how our customers analyze, manage, model, and engage with their data.<br><br><strong> Some o </strong><strong> f your responsibilities include… <br></strong><ul><li> Collaborating with designers, researchers, and engineers to come up with new ideas and ways to implement them </li><li> Participating and contributing in brainstorming, design and architecture sessions </li><li> Design ing and develop ing software which demonstrates how new concepts can be built and how they can provide customer value </li><li> Documenting and sharing your findings with a broad audience in mind </li><li> Mentor ing others to help them develop their technical and leadership skills <br></li></ul><strong><u>Who You Are…<br></u></strong><ul><li> Technically Savvy. You have 7+ years of real experience designing and delivering user-focused software. You’re familiar with more than one of C++, Java, and JavaScript. </li><li> Flexible. You must feel comfortable stretching yourself into environments and programming languages you might not be as familiar with and can work from the user-facing interface to the backend, wherever it lives. You aren’t limited to C++, Java, and JavaScript. </li><li> Team Player. You enjoy collaborating with, learning from, and teaching other folks from multiple disciplines. You’re comfortable with ambiguous and rapidly changing projects. </li><li> Thorough. Even in the early phases of a project, your code just works; it’s robust, performant, scalable, and well-tested. </li><li> Communicator. Whether your project was successful or not, you can share the lessons you’ve learned with the broader organization. </li><li> Intellectually Curious. You seek to continuously expand your areas of expertise, learn new ways to do things , and understand why things are the way they are. </li><li> Educated. You have at least a bachelor’s degree (or the equivalent) in computer science or another relevant field. </li><li> You are a Recruiter! Tableau hires company builders and, in this role, you will be asked to be on the constant lookout for the best talent to bring onboard to help us continue to build one of the best companies in the world! <br></li></ul><strong> Accommodations <br><br></strong>If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.<br><br><strong> Posting Statement <br><br></strong>At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.<br><br><u>Salesforce.com</u> and <u>Salesforce.org</u> are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. <u>Salesforce.com</u> and <u>Salesforce.org</u> do not accept unsolicited headhunter and agency resumes. <u>Salesforce.com</u> and <u>Salesforce.org</u> will not pay any third-party agency or company that does not have a signed agreement with <u>Salesforce.com</u> or <u>Salesforce.org</u> .<br><br>Salesforce welcomes all.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17"
    },
    "company": {
        "name": "Salesforce",
        "link": "https://www.linkedin.com/company/salesforce"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}