{
    "job": {
        "title": "Solution Architect",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Financial Services"
        ],
        "description": "<ul><li>Must Have Active Security Clearance***<br></li></ul>Our client is seeking a corporate Solution Architect to serve as the technical lead for carrying out solutioning activities in support of their business development.<br><br>The ideal candidate will be responsible for researching, identifying, and tailoring technical capabilities that will be integrated into proposals and pre-sales presentations.The Solution Architect will be responsible for coordinating with business development, IT leadership, and proposal leadership to identify technical resources required to support pre-proposal and proposal activities to include developing and/or contributing to basis of estimates, technical and staffing solutions, win themes, technical proposal writing, workflows, and graphics ideas.<br><br><strong>Requirements:<br></strong><ul><li>Bachelor's Degree in Information Systems/technical discipline.</li><li>Ten years of federal IT experience with at least 5 years as a solutions architect.</li><li>ITIL background or experience working in an ITIL framework-based project</li><li>Required demonstrated experience providing innovative solutions in cloud, cybersecurity, DevOps, and IT services.</li><li>Proven track record of supporting the capture of new business and developing leading-edge technical solutions for potential and existing customers</li><li>Ability to analyze and understand business and technical requirements</li><li>Ability to develop and present technical proposals</li><li>Demonstrated leadership in leading and facilitating technical solutions</li><li>Experience in Enterprise IT environments including Public Cloud/FedRAMP Cloud platforms</li><li>Experience in Federal cybersecurity compliance and FISMA and NIST 800-53 security controls and requirements</li><li>Ability to design technical solutions for complex IT Services projects</li><li>Ability to create Basis of Estimates (BOEs to determine level of effort for technical and delivery activities)</li><li>AWS Certified Solutions Architect – Associate</li><li>Microsoft Certified: Azure Fundamentals<br><br></li></ul><strong><u>Required Experience<br><br></u></strong><strong>Preferred Experience/Capabilities:<br></strong><ul><li>Experience in DevOps environments or work within Agile frameworks</li><li>Previous experience leading or supporting large IT projects or programs</li><li>ITIL Practitioner certification</li><li>Active Security clearance</li><li>AWS Certified Solutions Architect – Professional</li><li>Microsoft Certified Azure Solutions Architect Expert<br></li></ul>Powered by JazzHR<br><br>yjSHCdwn9x",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01"
    },
    "company": {
        "name": "Hamdan Resources",
        "link": "https://www.linkedin.com/company/hamdan-resources"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Vienna",
        "region": "VA",
        "postal_code": "22184",
        "street_address": null,
        "latitude": 38.903484,
        "longitude": -77.26282
    }
}