{
    "job": {
        "title": "Associate Data Scientist",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Financial Services"
        ],
        "description": "The Investigation and Special Programs team at Chainalysis are world-class problem solvers adept at covert analysis and conducting complex investigations. Our job is to help our customers with the biggest and toughest investigations while, along the way, making the world a safer place.<br><br>Data scientists are really good at turning raw data into actionable insights. We measure success by the value your work brings to government agencies, cryptocurrency businesses and financial institutions to help stop illicit use of cryptocurrency.<br><br><strong>In one year you’ll know you were successful if…<br></strong><ul><li> Provided valuable insights directly to customers through the use of data analytics improving their user experience and deepening existing relationships</li><li> Anticipated customer needs and developed solutions for them while identifying opportunities for product improvements </li><li> Become a master of our rich datasets allowing visibility into our data both internally and externally</li><li> Have successfully balanced ad-hoc requests in addition to ongoing projects and can quantify the impact of your work</li><li> Built a strong relationship with our Product, Engineering, and Data teams to ensure our analytics align with the needs of our customers</li><li> Designed and launched new innovative solutions to ever expanding customer and company use cases<br></li></ul><strong><u>A Background Like This Helps<br></u></strong><ul><li> Security clearance (not required, but preferred)</li><li> Prior experience using data analytics to solve real world problems, often requiring the ability to communicate well to technical and non-technical audiences</li><li> Deep conceptual understanding of data science allowing you to identify the best model for a given project coupled with a strong technical skill set allowing you to then build it </li><li> You are adamant about data ethics and integrity</li><li> You are passionate about data and sharing that with others </li><li>Insatiable curiosity about cryptocurrencies and the growing blockchain ecosystem.<br></li></ul>At Chainalysis, we help government agencies, cryptocurrency businesses, and financial institutions track and investigate illicit activity on the blockchain, allowing them to engage confidently with cryptocurrency. We take care of our people with great benefits, professional development opportunities, and fun.<br><br><strong>You belong here. <br><br></strong>At Chainalysis, we believe that diversity of experience and thought makes us stronger. With both customers and employees around the world, we are committed to ensuring our team reflects the unique communities around us. Some of the ways we’re ensuring we keep learning are an internal Diversity Committee, Days of Reflection throughout the year including International Women’s Day, Juneteenth, Harvey Milk Day, and International Migrant’s Day, and a commitment to continue revisiting and reevaluating our diversity culture.<br><br>We encourage applicants across any race, ethnicity, gender/gender expression, age, spirituality, ability, experience and more. Additionally, if you need any accommodations to make our interview process more accessible to you due to a disability, don't hesitate to let us know. You can learn more here. We can’t wait to meet you.<br><br>Applying from the EU? Please review our Candidate GDPR Notice.<br><br>By submitting this application, I consent to and authorize Chainalysis to contact my former employers, and any and all other persons and organizations for information bearing upon my qualifications for employment. I further authorize the listed employers, schools and personal references to give Chainalysis (without further notice to me) any and all information about my previous employment and education, along with other pertinent information they may have, and hereby waive any actions which I may have against either party(ies) for providing a reference. I understand any future employment will be contingent on the Company receiving satisfactory employment references.<br><br>",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05"
    },
    "company": {
        "name": "Chainalysis Inc.",
        "link": "https://www.linkedin.com/company/chainalysis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20398",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}