{
    "job": {
        "title": "Data Scientist I",
        "industry": [
            "Computer Software",
            "Information Technology and Services",
            "Internet"
        ],
        "description": "<strong><u>Description<br><br></u></strong><strong>DESCRIPTION<br><br></strong>The Organizational Research and Measurement (ORM) Team within World Wide Consumer guides the talent strategy for Amazon’s largest workforce comprised of over one million Amazon global employees across order fulfillment, transportation, corporate, consumer, and customer service organizations. We are an interdisciplinary team that combines the talents of science and engineering to develop and deliver research insights, data products, and solutions across the employee lifecycle including on-boarding; high-potential identification; talent development; engagement; movement; retention; and attrition.<br><br><strong><u>The Role<br><br></u></strong>We are looking for a truly innovative data scientist who is able to contribute to the research and engineering of end-to-end solutions for complex science and business problems around the future of talent evaluation, development, and management at Amazon. You will work closely with I/O psychologists, economists, engineers, and business partners to estimate and validate models on large scale data, and turn the results of these analyses into products, policies, programs, and actions that have a major impact on Amazon’s business. We are looking for creative thinkers who can combine strong data science, software engineering, and product development skillsets with a desire to innovate, and who know how to execute and deliver on big ideas.<br><br><strong><u>Key Responsibilities<br></u></strong><ul><li> Support the development of start-to-finish data product solutions from requirements gathering and ideation, through interface design and implementation.</li><li> Contribute to the design and implementation of data infrastructure and pipelines for machine learning and analytics products.</li><li> Obtain, merge, analyze, and report data using SQL, statistics software, and data visualization tools.</li><li> Apply various statistical and machine learning techniques to analyze large and complex data sets.</li><li> Communicate applied machine learning and statistic concepts to project sponsors, business leaders, and development teams across Amazon.</li><li> Understand business customer needs, iterate on feedback, and drive adoption<br><br></li></ul><strong><u>Basic Qualifications<br></u></strong><ul><li> A Bachelor’s Degree in Computer Science, Machine Learning, Operational research, Statistics or in a highly quantitative field or equivalent experience.</li><li> 4+ years of hands-on experience in predictive modeling and analysis, advanced statistics, and machine learning.</li><li> 3+ years conducting end-to-end scientific research in an applied setting.</li><li> Experience developing and applying models in a production environment.</li><li> Proficient with SQL and at least one scripting language (e.g., R, Python).</li><li> Demonstrable expertise in research design methodologies (e.g., experiments, quasi-experiments, surveys, sampling methods).</li><li> Strong communication and data presentation skills</li><li> Familiarity with using data visualization tools.<br></li></ul><strong><u>Preferred Qualifications<br></u></strong><ul><li> MS/PhD in Computer Science, Machine Learning, Operational research, Statistics or in a highly quantitative field. PhD strongly preferred.</li><li> Experience with AWS technologies (Sagemaker, S3, Glue, EC2, Data Pipeline, Lambda)</li><li> Demonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment.</li><li> A passion for continuous learning and self-development.<br></li></ul>Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, visit https://www.amazon.jobs/en/disability/us .<br><br><br><strong>Company</strong> - Amazon.com Services LLC<br>Job ID: A1645645",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29"
    },
    "company": {
        "name": "Amazon",
        "link": "https://www.linkedin.com/company/amazon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}