{
    "job": {
        "title": "REMOTE Senior Site Reliability Engineer",
        "industry": [
            "Information Technology and Services",
            "Computer Software",
            "Financial Services"
        ],
        "description": "If you are a Senior Site Reliability Engineer with experience, please read on!<br><br>Top Reasons to Work with Us<br><br>Based in Austin, TX, we are an innovative tech company using AI to automate scheduling for Fortune 500 companies! We are seeking curious, passionate problem solvers to join our team and help us build out our products!<br><br>What You Will Be Doing<br><br>We are currently seeking mid/senior engineers with experience building and maintaining CI/CD pipelines, monitoring and alerting systems. Our goal is to automate all aspects of our infrastructure.<br><br>What You Need for this Position<br><ul><li> EKS</li><li> Terraform</li><li> Kibana, DataDog</li><li> KMS, SQS, S3, Redis, Dynamo, Aurora, et al ...</li><li> Github, Gitlab &amp; GitLabCI</li><li> CloudFlare, Bonus if you have security and/or compliance experience.<br></li></ul>What's In It for You<br><ul><li> Vacation/PTO</li><li> Medical</li><li> Dental</li><li> Vision</li><li> 401k<br></li></ul>So, if you are a Senior Site Reliability Engineer with experience, please apply today!<br><br><strong><u>Email Your Resume In Word To<br><br></u></strong>Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:<br><br>Alison.Barker@Optello.com<br><ul><li>Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : AB12-1647685 -- in the email subject line for your application to be considered.***<br></li></ul>Alison Barker - Executive Recruiter - Optello<br><br>Applicants must be authorized to work in the U.S.<br><br><strong>Optello is proud to be an Equal Opportunity Employer<br><br></strong>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.<br><br><strong>Your Right to Work</strong> - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": {}
    },
    "salary": {
        "currency": "",
        "min_value": "",
        "max_value": "",
        "unit": ""
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}